[Killed] EqualityOperator
solutions-algorithm/15.js:27:13
             x--;
         }
 
-        if (y < end[1]) {
+        if (y <= end[1]) {
             move += 'U';
             y++;
killedBy: king one move left: c3 to b3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "L",
+   "LU",

[Killed] EqualityOperator
solutions-algorithm/15.js:30:20
         if (y < end[1]) {
             move += 'U';
             y++;
-        } else if (y > end[1]) {
+        } else if (y >= end[1]) {
             move += 'D';
             y--;
killedBy: king one move left: c3 to b3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "L",
+   "LD",
