[Killed] EqualityOperator
solutions-algorithm/28.js:14:54
         if (x[0] === f[0] && y[0] === f[0] && (f[1] - x[1]) * (f[1] - y[1]) < 0) {
 
             sum = Math.abs(x[1] - y[1]) + 2;
-        } else if (x[1] === f[1] && y[1] === f[1] && (f[0] - x[0]) * (f[0] - y[0]) < 0) {
+        } else if (x[1] === f[1] && y[1] === f[1] && (f[0] - x[0]) * (f[0] - y[0]) <= 0) {
 
             sum = Math.abs(x[0] - y[0]) + 2;
killedBy: start and end are the same point
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   2,
