[Killed] ConditionalExpression
solutions-algorithm/29.js:8:25
     return pins.map(pin => {
         let curr = 1;
         let sum = 0;
-        for (let j = 0; j < pin.length; j++) {
+        for (let j = 0; false; j++) {
             let next = pin[j] === '0' ? 10 : +pin[j];
             sum += Math.abs(curr - next);
killedBy: multiple pins with mixed types
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    4,
    4,

[Killed] ConditionalExpression
solutions-algorithm/29.js:9:24
         let curr = 1;
         let sum = 0;
         for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
+            let next = false ? 10 : +pin[j];
             sum += Math.abs(curr - next);
             curr = next;
killedBy: multiple pins with mixed types
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    4,
    4,
