[Killed] BlockStatement
solutions-algorithm/30.js:6:33
 export function solve(t, arr) {
     const results = [];
 
-    for (let i = 0; i < t; i++) {
-        const n = arr[i];
-        let found = false;
-
-        for (let x = 1; x < n && !found; x++) {
-            for (let y = 1; y < n - x && !found; y++) {
-                const z = n - x - y;
-                if (z > 0 && x % 3 !== 0 && y % 3 !== 0 && z % 3 !== 0) {
-                    // Sort in descending to match test cases like 5 4 1
-                    const sorted = [x, y, z].sort((a, b) => b - a);
-                    results.push("YES");
-                    results.push(`${sorted[0]} ${sorted[1]} ${sorted[2]}`);
-                    found = true;
-                }
-            }
-        }
-
-        if (!found) results.push("NO");
-    }
+    for (let i = 0; i < t; i++) {}
 
     return results;
killedBy: large input
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "YES"
Received array: []

[Killed] BooleanLiteral
solutions-algorithm/30.js:23:13
             }
         }
 
-        if (!found) results.push("NO");
+        if (found) results.push("NO");
     }
 
killedBy: large input
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  ["YES", "98 1 1", "NO"]
