[Killed] BlockStatement
solutions-algorithm/33.js:33:34
 
             for (const y of d.get(x)) {
                 const val = x + y;
-                if (!s.has(val)) {
-                    q.push(val);
-                    s.add(val);
-                    ans = Math.max(ans, val);
-                }
+                if (!s.has(val)) {}
             }
         }
killedBy: typical cases
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   10,
-   11,

[Killed] ConditionalExpression
solutions-algorithm/33.js:33:21
 
             for (const y of d.get(x)) {
                 const val = x + y;
-                if (!s.has(val)) {
+                if (false) {
                     q.push(val);
                     s.add(val);
killedBy: typical cases
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   10,
-   11,
