[Killed] ConditionalExpression
solutions-algorithm/39.js:6:9
     if (n !== 1 && n % 2 === 1) {
         return 'YES';
     }
-    if (n === 1) {
+    if (false) {
         return 'NO';
     }
killedBy: returns NO for n = 1
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BlockStatement
solutions-algorithm/39.js:6:18
     if (n !== 1 && n % 2 === 1) {
         return 'YES';
     }
-    if (n === 1) {
-        return 'NO';
-    }
+    if (n === 1) {}
     return solve(Math.floor(n / 2));
 }
killedBy: returns NO for n = 1
statusReason: RangeError: Maximum call stack size exceeded
