[Killed] EqualityOperator
solutions-algorithm/41.js:6:13
     const G = {};
     for (let i = 1; i <= n; i++) G[i] = [];
     for (const [a, b, w] of edges) {
-        if (a !== b) G[a].push({ node: b, weight: w });
+        if (a === b) G[a].push({ node: b, weight: w });
     }
 
killedBy: typical case, multiple paths, pick shortest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1 4 3 5"
Received: "-1"

[Killed] BooleanLiteral
solutions-algorithm/41.js:17:12
     distances[1] = 0;
     pq.enqueue(1, 0);
 
-    while (!pq.isEmpty()) {
+    while (pq.isEmpty()) {
         const { element: node } = pq.dequeue();
         for (const neighbor of G[node]) {
killedBy: typical case, multiple paths, pick shortest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1 4 3 5"
Received: "-1"

[Killed] ConditionalExpression
solutions-algorithm/41.js:21:17
         const { element: node } = pq.dequeue();
         for (const neighbor of G[node]) {
             const alt = distances[node] + neighbor.weight;
-            if (alt < distances[neighbor.node]) {
+            if (true) {
                 distances[neighbor.node] = alt;
                 prev[neighbor.node] = node;
killedBy: typical case, multiple paths, pick shortest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1 4 3 5"
Received: "1 2 3 5"

[Killed] ConditionalExpression
solutions-algorithm/41.js:33:12
 
     const path = [];
     let curr = n;
-    while (curr !== undefined) {
+    while (false) {
         path.push(curr);
         curr = prev[curr];
killedBy: typical case, multiple paths, pick shortest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1 4 3 5"
Received: ""
