[Killed] EqualityOperator
solutions-algorithm/42.js:6:21
 // Core logic function for Hackerrank-style use
 export function solve(n, a) {
     const stack = [];
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         let l = 0,
             r = stack.length;
killedBy: empty array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
