[Killed] BlockStatement
solutions-algorithm/45.js:22:16
         if (fa || arr[now - 2] < arr[now - 1]) {
             res = (res + dfs(now + 1, l + 1, 0) * p[l - 1]) % MOD;
         }
-        if (l) {
-            res = (res + dfs(now, l - 1, 1)) % MOD;
-        }
+        if (l) {}
 
         dp[now][l][fa] = res;
killedBy: solve returns 3 for [1,2,3]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2
