[Killed] BlockStatement
solutions-algorithm/47.js:4:46
 // Functional logic for each test case
 export function solve(n, k, numbers) {
     let check = 1;
-    for (let i = 0; i < numbers.length; i++) {
-        if (check === numbers[i]) check++;
-    }
+    for (let i = 0; i < numbers.length; i++) {}
     return Math.ceil((n - check + 1) / k);
 }
killedBy: All numbers in order, no operations needed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2
