[Survived] ArithmeticOperator
solutions-algorithm/48.js:38:22
     let ans = 1;
     for (let i = 1; i <= m; i++) {
         sumc[i] = sumc[i - 1] + cnt[i];
-        sum[i] = sum[i - 1] + cnt[i] * i;
+        sum[i] = sum[i + 1] + cnt[i] * i;
 
         let l = 1,

[Timeout] EqualityOperator
solutions-algorithm/48.js:42:16
 
         let l = 1,
             r = i;
-        while (l < r) {
+        while (l >= r) {
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];

[Survived] EqualityOperator
solutions-algorithm/48.js:46:17
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
-            if (v >= p) l = mid + 1;
+            if (v < p) l = mid + 1;
             else r = mid;
         }

[Killed] EqualityOperator
solutions-algorithm/48.js:52:13
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (l === 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: sample case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] ConditionalExpression
solutions-algorithm/48.js:52:13
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (true) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: sample case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5
