[Killed] ConditionalExpression
solutions-algorithm/9.js:24:23
     // Frequency map after second removal
     const freq2 = {};
     for (const num of original) {
-        freq2[num] = (freq2[num] || 0) + 1;
+        freq2[num] = (false) + 1;
     }
 
killedBy: with duplicate numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,
