[Survived] EqualityOperator
solutions-algorithm/30.js:10:25
         const n = arr[i];
         let found = false;
 
-        for (let x = 1; x < n && !found; x++) {
+        for (let x = 1; x <= n && !found; x++) {
             for (let y = 1; y < n - x && !found; y++) {
                 const z = n - x - y;

[Survived] UpdateOperator
solutions-algorithm/30.js:10:42
         const n = arr[i];
         let found = false;
 
-        for (let x = 1; x < n && !found; x++) {
+        for (let x = 1; x < n && !found; x--) {
             for (let y = 1; y < n - x && !found; y++) {
                 const z = n - x - y;
