[Killed] EqualityOperator
solutions-algorithm/35.js:14:12
         return num;
     }
     let count = 0;
-    while (num > 0) {
+    while (num <= 0) {
         count += num % k;
         num = Math.floor(num / k);
killedBy: Sample and boundary test cases
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   0,
