[Killed] EqualityOperator
solutions-algorithm/41.js:21:17
         const { element: node } = pq.dequeue();
         for (const neighbor of G[node]) {
             const alt = distances[node] + neighbor.weight;
-            if (alt < distances[neighbor.node]) {
+            if (alt >= distances[neighbor.node]) {
                 distances[neighbor.node] = alt;
                 prev[neighbor.node] = node;
killedBy: basic shortest path example
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1 4 3 5"
Received: "-1"
