[Killed] ArithmeticOperator
solutions-algorithm/48.js:51:26
         }
 
         let tmp = sumc[i] - sumc[l - 1];
-        const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
+        const rem = p - (tmp * i + (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
killedBy: chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] AssignmentOperator
solutions-algorithm/48.js:52:22
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (l !== 1) tmp -= Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:52:68
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i + (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
