[Killed] ConditionalExpression
solutions-algorithm/9.js:6:22
     // Frequency map after first removal
     const freq = {};
     for (const num of original) {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (false) + 1;
     }
 
killedBy: case 4: more repeated numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   undefined,
    1,
