[Killed] BlockStatement
solutions-algorithm/1.js:2:35
 // Core function
-export function solve(expression) {
-    return expression
-        .split('+')
-        .map(Number)
-        .sort((a, b) => a - b)
-        .join('+');
-}
+export function solve(expression) {}
 
 // Test function
killedBy: example 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1+2+3"
Received: undefined

[Killed] MethodExpression
solutions-algorithm/1.js:3:12
 // Core function
 export function solve(expression) {
-    return expression
-        .split('+')
-        .map(Number)
-        .sort((a, b) => a - b)
+    return expression.split('+').map(Number)
         .join('+');
 }
killedBy: example 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1+2+3"
Received: "3+2+1"

[Killed] StringLiteral
solutions-algorithm/1.js:4:16
 // Core function
 export function solve(expression) {
     return expression
-        .split('+')
+        .split("")
         .map(Number)
         .sort((a, b) => a - b)
killedBy: example 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1+2+3"
Received: "3+NaN+2+NaN+1"

[Killed] ArithmeticOperator
solutions-algorithm/1.js:6:25
     return expression
         .split('+')
         .map(Number)
-        .sort((a, b) => a - b)
+        .sort((a, b) => a + b)
         .join('+');
 }
killedBy: example 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1+2+3"
Received: "3+2+1"

[Killed] ArrowFunction
solutions-algorithm/1.js:6:15
     return expression
         .split('+')
         .map(Number)
-        .sort((a, b) => a - b)
+        .sort(() => undefined)
         .join('+');
 }
killedBy: example 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1+2+3"
Received: "3+2+1"
