[Killed] ConditionalExpression
solutions-algorithm/10.js:4:9
 // Core logic function
 export function solve(n) {
     // Ensure valid number
-    if (typeof n !== 'number' || n < 0 || !Number.isInteger(n)) {
+    if (true) {
         return [0, []];
     }
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 2

  Array [
-   2,
-   Array [

[Killed] EqualityOperator
solutions-algorithm/10.js:4:34
 // Core logic function
 export function solve(n) {
     // Ensure valid number
-    if (typeof n !== 'number' || n < 0 || !Number.isInteger(n)) {
+    if (typeof n !== 'number' || n >= 0 || !Number.isInteger(n)) {
         return [0, []];
     }
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 2

  Array [
-   2,
-   Array [

[Killed] EqualityOperator
solutions-algorithm/10.js:13:12
     let parts = [];
     let place = 1;
 
-    while (m > 0) {
+    while (m <= 0) {
         const digit = m % 10;
         if (digit !== 0) {
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 2

  Array [
-   2,
-   Array [

[Killed] ConditionalExpression
solutions-algorithm/10.js:13:12
     let parts = [];
     let place = 1;
 
-    while (m > 0) {
+    while (false) {
         const digit = m % 10;
         if (digit !== 0) {
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 2

  Array [
-   2,
-   Array [

[Killed] ArithmeticOperator
solutions-algorithm/10.js:14:23
     let place = 1;
 
     while (m > 0) {
-        const digit = m % 10;
+        const digit = m * 10;
         if (digit !== 0) {
             parts.push(digit * place);
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 5

  Array [
-   2,
+   4,

[Killed] EqualityOperator
solutions-algorithm/10.js:15:13
 
     while (m > 0) {
         const digit = m % 10;
-        if (digit !== 0) {
+        if (digit === 0) {
             parts.push(digit * place);
             count++;
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    2,
    Array [

[Killed] BlockStatement
solutions-algorithm/10.js:15:26
 
     while (m > 0) {
         const digit = m % 10;
-        if (digit !== 0) {
-            parts.push(digit * place);
-            count++;
-        }
+        if (digit !== 0) {}
         m = Math.floor(m / 10);
         place *= 10;
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 2

  Array [
-   2,
-   Array [

[Killed] ArithmeticOperator
solutions-algorithm/10.js:16:24
     while (m > 0) {
         const digit = m % 10;
         if (digit !== 0) {
-            parts.push(digit * place);
+            parts.push(digit / place);
             count++;
         }
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
    Array [

[Killed] UpdateOperator
solutions-algorithm/10.js:17:13
         const digit = m % 10;
         if (digit !== 0) {
             parts.push(digit * place);
-            count++;
+            count--;
         }
         m = Math.floor(m / 10);
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   -2,

[Timeout] ArithmeticOperator
solutions-algorithm/10.js:19:24
             parts.push(digit * place);
             count++;
         }
-        m = Math.floor(m / 10);
+        m = Math.floor(m * 10);
         place *= 10;
     }

[Killed] AssignmentOperator
solutions-algorithm/10.js:20:9
             count++;
         }
         m = Math.floor(m / 10);
-        place *= 10;
+        place /= 10;
     }
 
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
    Array [

[Killed] MethodExpression
solutions-algorithm/10.js:24:5
     }
 
     // Reverse to keep left-to-right order (like 4000 before 20)
-    parts.reverse();
+    parts;
 
     return [count, parts];
killedBy: example from description: n=5009
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
    Array [
