[Killed] BlockStatement
solutions-algorithm/11.js:4:32
 'use strict';
 
 // ✅ Pure function: accepts an array of two-digit numbers, returns an array of sums
-export function solve(numbers) {
-    return numbers.map(n => {
-        const tens = Math.floor(n / 10);
-        const ones = n % 10;
-        return tens + ones;
-    });
-}
+export function solve(numbers) {}
 
 // ✅ Test function with expected output
killedBy: sum of digits for 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] BlockStatement
solutions-algorithm/11.js:5:29
 
 // ✅ Pure function: accepts an array of two-digit numbers, returns an array of sums
 export function solve(numbers) {
-    return numbers.map(n => {
-        const tens = Math.floor(n / 10);
-        const ones = n % 10;
-        return tens + ones;
-    });
+    return numbers.map(n => {});
 }
 
killedBy: sum of digits for 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   undefined,

[Killed] ArithmeticOperator
solutions-algorithm/11.js:6:33
 // ✅ Pure function: accepts an array of two-digit numbers, returns an array of sums
 export function solve(numbers) {
     return numbers.map(n => {
-        const tens = Math.floor(n / 10);
+        const tens = Math.floor(n * 10);
         const ones = n % 10;
         return tens + ones;
killedBy: sum of digits for 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   100,

[Killed] ArithmeticOperator
solutions-algorithm/11.js:7:22
 export function solve(numbers) {
     return numbers.map(n => {
         const tens = Math.floor(n / 10);
-        const ones = n % 10;
+        const ones = n * 10;
         return tens + ones;
     });
killedBy: sum of digits for 10
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   101,

[Killed] ArithmeticOperator
solutions-algorithm/11.js:8:16
     return numbers.map(n => {
         const tens = Math.floor(n / 10);
         const ones = n % 10;
-        return tens + ones;
+        return tens - ones;
     });
 }
killedBy: sum of digits for 99
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   18,
+   0,
