[Killed] BlockStatement
solutions-algorithm/12.js:3:26
 'use strict';
 
-export function solve(n) {
-    const result = (n % 2) + 8;
-    return [result, n - result];
-}
+export function solve(n) {}
 
 // function testing_test() {
killedBy: n = 12
statusReason: TypeError: solve is not a function or its return value is not iterable

[Killed] ArithmeticOperator
solutions-algorithm/12.js:4:21
 'use strict';
 
 export function solve(n) {
-    const result = (n % 2) + 8;
+    const result = (n * 2) + 8;
     return [result, n - result];
 }
killedBy: n = 12
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   -20

[Killed] ArithmeticOperator
solutions-algorithm/12.js:4:20
 'use strict';
 
 export function solve(n) {
-    const result = (n % 2) + 8;
+    const result = n % 2 - 8;
     return [result, n - result];
 }
killedBy: n = 12
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1
Received:   -8

[Killed] ArithmeticOperator
solutions-algorithm/12.js:5:21
 
 export function solve(n) {
     const result = (n % 2) + 8;
-    return [result, n - result];
+    return [result, n + result];
 }
 
killedBy: n = 12
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 28
