[Killed] BlockStatement
solutions-algorithm/13.js:4:32
 'use strict';
 
 // ✅ Pure function: Takes array of integers, returns array of results
-export function solve(numbers) {
-    return numbers.map(n => n - 1);
-}
+export function solve(numbers) {}
 
 // ✅ Test function: Verifies correctness
killedBy: solve returns 1 for n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] ArrowFunction
solutions-algorithm/13.js:5:24
 
 // ✅ Pure function: Takes array of integers, returns array of results
 export function solve(numbers) {
-    return numbers.map(n => n - 1);
+    return numbers.map(() => undefined);
 }
 
killedBy: solve returns 1 for n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   undefined,

[Killed] ArithmeticOperator
solutions-algorithm/13.js:5:29
 
 // ✅ Pure function: Takes array of integers, returns array of results
 export function solve(numbers) {
-    return numbers.map(n => n - 1);
+    return numbers.map(n => n + 1);
 }
 
killedBy: solve returns 1 for n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   3,
