[Killed] BlockStatement
solutions-algorithm/14.js:4:36
 'use strict';
 
 // Pure function: performs the simulation and returns the final queue string
-export function solve(t, n, queue) {
-    let result = queue;
-    for (let i = 0; i < n; i++) {
-        result = result.replace(/BG/g, 'GB');
-    }
-    return result;
-}
+export function solve(t, n, queue) {}
 
 // Test function to validate correctness
killedBy: single boy, single girl, t=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GB"
Received: undefined

[Killed] EqualityOperator
solutions-algorithm/14.js:6:21
 // Pure function: performs the simulation and returns the final queue string
 export function solve(t, n, queue) {
     let result = queue;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         result = result.replace(/BG/g, 'GB');
     }
killedBy: boys and girls, t=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "BGBGG"
Received: "GBGBG"

[Killed] BlockStatement
solutions-algorithm/14.js:6:33
 // Pure function: performs the simulation and returns the final queue string
 export function solve(t, n, queue) {
     let result = queue;
-    for (let i = 0; i < n; i++) {
-        result = result.replace(/BG/g, 'GB');
-    }
+    for (let i = 0; i < n; i++) {}
     return result;
 }
killedBy: single boy, single girl, t=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "GB"
Received: "BG"
