[Killed] BlockStatement
solutions-algorithm/18.js:4:30
 'use strict';
 
 // Pure function: processes an array of [l, r] pairs
-export function solve(pairs) {
-    return pairs.map(([l, r]) => {
-        return r < 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
-    });
-}
+export function solve(pairs) {}
 
 // Test function
killedBy: Example 1: l=1, r=2
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
solutions-algorithm/18.js:5:34
 
 // Pure function: processes an array of [l, r] pairs
 export function solve(pairs) {
-    return pairs.map(([l, r]) => {
-        return r < 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
-    });
+    return pairs.map(([l, r]) => {});
 }
 
killedBy: Example 1: l=1, r=2
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] EqualityOperator
solutions-algorithm/18.js:6:16
 // Pure function: processes an array of [l, r] pairs
 export function solve(pairs) {
     return pairs.map(([l, r]) => {
-        return r < 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
+        return r >= 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
     });
 }
killedBy: Example 1: l=1, r=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Killed] EqualityOperator
solutions-algorithm/18.js:6:16
 // Pure function: processes an array of [l, r] pairs
 export function solve(pairs) {
     return pairs.map(([l, r]) => {
-        return r < 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
+        return r <= 2 * l ? ['-1', '-1'] : [String(l), String(2 * l)];
     });
 }
killedBy: Example 1: l=1, r=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,
