[Killed] BlockStatement
solutions-algorithm/19.js:4:26
 'use strict';
 
 // Pure function: returns the minimum number of steps
-export function solve(x) {
-    return Math.floor(x / 5) + (x % 5 !== 0 ? 1 : 0);
-}
+export function solve(x) {}
 
 // Test function to verify correctness
killedBy: solves for x = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ConditionalExpression
solutions-algorithm/19.js:5:33
 
 // Pure function: returns the minimum number of steps
 export function solve(x) {
-    return Math.floor(x / 5) + (x % 5 !== 0 ? 1 : 0);
+    return Math.floor(x / 5) + (false ? 1 : 0);
 }
 
killedBy: solves for x = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
solutions-algorithm/19.js:5:33
 
 // Pure function: returns the minimum number of steps
 export function solve(x) {
-    return Math.floor(x / 5) + (x % 5 !== 0 ? 1 : 0);
+    return Math.floor(x / 5) + (x % 5 === 0 ? 1 : 0);
 }
 
killedBy: solves for x = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
