[Killed] BlockStatement
solutions-algorithm/21.js:4:33
 'use strict';
 
 // Pure function: processes a list of [a, b, c] triples and returns results
-export function solve(triplets) {
-    return triplets.map(([a, b, c]) => {
-        return (
-            a + b === c ||
-            b + c === a ||
-            a + c === b
-        ) ? "YES" : "NO";
-    });
-}
+export function solve(triplets) {}
 
 // Test function
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["YES"]
Received: undefined

[Killed] BlockStatement
solutions-algorithm/21.js:5:40
 
 // Pure function: processes a list of [a, b, c] triples and returns results
 export function solve(triplets) {
-    return triplets.map(([a, b, c]) => {
-        return (
-            a + b === c ||
-            b + c === a ||
-            a + c === b
-        ) ? "YES" : "NO";
-    });
+    return triplets.map(([a, b, c]) => {});
 }
 
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   undefined,

[Killed] ConditionalExpression
solutions-algorithm/21.js:7:13
 export function solve(triplets) {
     return triplets.map(([a, b, c]) => {
         return (
-            a + b === c ||
-            b + c === a ||
-            a + c === b
+            false
         ) ? "YES" : "NO";
     });
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] ConditionalExpression
solutions-algorithm/21.js:7:13
 export function solve(triplets) {
     return triplets.map(([a, b, c]) => {
         return (
-            a + b === c ||
-            b + c === a ||
+            false ||
             a + c === b
         ) ? "YES" : "NO";
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] ArithmeticOperator
solutions-algorithm/21.js:8:13
     return triplets.map(([a, b, c]) => {
         return (
             a + b === c ||
-            b + c === a ||
+            b - c === a ||
             a + c === b
         ) ? "YES" : "NO";
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] EqualityOperator
solutions-algorithm/21.js:8:13
     return triplets.map(([a, b, c]) => {
         return (
             a + b === c ||
-            b + c === a ||
+            b + c !== a ||
             a + c === b
         ) ? "YES" : "NO";
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] ConditionalExpression
solutions-algorithm/21.js:9:13
         return (
             a + b === c ||
             b + c === a ||
-            a + c === b
+            false
         ) ? "YES" : "NO";
     });
killedBy: b is sum of a and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] EqualityOperator
solutions-algorithm/21.js:9:13
         return (
             a + b === c ||
             b + c === a ||
-            a + c === b
+            a + c !== b
         ) ? "YES" : "NO";
     });
killedBy: b is sum of a and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "NO",

[Killed] StringLiteral
solutions-algorithm/21.js:10:13
             a + b === c ||
             b + c === a ||
             a + c === b
-        ) ? "YES" : "NO";
+        ) ? "" : "NO";
     });
 }
killedBy: a is sum of b and c
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "YES",
+   "",
