[Killed] BlockStatement
solutions-algorithm/22.js:4:32
 'use strict';
 
 // ✅ Pure function: takes an array of integers and returns the corresponding winners
-export function solve(numbers) {
-    return numbers.map(n => (n % 3 === 0 ? "Second" : "First"));
-}
+export function solve(numbers) {}
 
 // ✅ Test function to verify correctness
killedBy: n = 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["First"]
Received: undefined

[Killed] ConditionalExpression
solutions-algorithm/22.js:5:30
 
 // ✅ Pure function: takes an array of integers and returns the corresponding winners
 export function solve(numbers) {
-    return numbers.map(n => (n % 3 === 0 ? "Second" : "First"));
+    return numbers.map(n => (true ? "Second" : "First"));
 }
 
killedBy: n = 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "First",
+   "Second",

[Killed] EqualityOperator
solutions-algorithm/22.js:5:30
 
 // ✅ Pure function: takes an array of integers and returns the corresponding winners
 export function solve(numbers) {
-    return numbers.map(n => (n % 3 === 0 ? "Second" : "First"));
+    return numbers.map(n => (n % 3 !== 0 ? "Second" : "First"));
 }
 
killedBy: n = 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "First",
+   "Second",
