[Killed] BlockStatement
solutions-algorithm/24.js:4:32
 'use strict';
 
 // Pure function: returns an array of floor(n / 2)
-export function solve(numbers) {
-    return numbers.map(n => Math.floor(n / 2));
-}
+export function solve(numbers) {}
 
 // Test function to verify correctness
killedBy: n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] ArithmeticOperator
solutions-algorithm/24.js:5:40
 
 // Pure function: returns an array of floor(n / 2)
 export function solve(numbers) {
-    return numbers.map(n => Math.floor(n / 2));
+    return numbers.map(n => Math.floor(n * 2));
 }
 
killedBy: n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   4,

[Killed] ArrowFunction
solutions-algorithm/24.js:5:24
 
 // Pure function: returns an array of floor(n / 2)
 export function solve(numbers) {
-    return numbers.map(n => Math.floor(n / 2));
+    return numbers.map(() => undefined);
 }
 
killedBy: n=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   undefined,
