[Killed] BlockStatement
solutions-algorithm/25.js:4:34
 'use strict';
 
 // ✅ Pure logic function
-export function solve(testCases) {
-    return testCases.map(({ n, arr }) => {
-        let totalTwos = arr.filter(x => x === 2).length;
-
-        if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
-
-        let halfTwos = totalTwos / 2;
-        let seenTwos = 0;
-
-        for (let i = 0; i < n; i++) {
-            if (arr[i] === 2) {
-                seenTwos++;
-            }
-            if (seenTwos === halfTwos) {
-                return i + 1; // 1-based index
-            }
-        }
-
-        return -1;
-    });
-}
+export function solve(testCases) {}
 
 // ✅ Test function
killedBy: Example 1: n=2 [1,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [-1]
Received: undefined

[Killed] BlockStatement
solutions-algorithm/25.js:5:42
 
 // ✅ Pure logic function
 export function solve(testCases) {
-    return testCases.map(({ n, arr }) => {
-        let totalTwos = arr.filter(x => x === 2).length;
-
-        if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
-
-        let halfTwos = totalTwos / 2;
-        let seenTwos = 0;
-
-        for (let i = 0; i < n; i++) {
-            if (arr[i] === 2) {
-                seenTwos++;
-            }
-            if (seenTwos === halfTwos) {
-                return i + 1; // 1-based index
-            }
-        }
-
-        return -1;
-    });
+    return testCases.map(({ n, arr }) => {});
 }
 
killedBy: Example 1: n=2 [1,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -1,
+   undefined,

[Killed] ConditionalExpression
solutions-algorithm/25.js:6:41
 // ✅ Pure logic function
 export function solve(testCases) {
     return testCases.map(({ n, arr }) => {
-        let totalTwos = arr.filter(x => x === 2).length;
+        let totalTwos = arr.filter(x => false).length;
 
         if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] MethodExpression
solutions-algorithm/25.js:6:25
 // ✅ Pure logic function
 export function solve(testCases) {
     return testCases.map(({ n, arr }) => {
-        let totalTwos = arr.filter(x => x === 2).length;
+        let totalTwos = arr.length;
 
         if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
killedBy: Example 3: n=3 [1,2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   -1,

[Killed] EqualityOperator
solutions-algorithm/25.js:8:13
     return testCases.map(({ n, arr }) => {
         let totalTwos = arr.filter(x => x === 2).length;
 
-        if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
+        if (totalTwos !== 0 || totalTwos % 2 !== 0) return -1;
 
         let halfTwos = totalTwos / 2;
killedBy: Example 1: n=2 [1,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -1,
+   1,

[Killed] LogicalOperator
solutions-algorithm/25.js:8:13
     return testCases.map(({ n, arr }) => {
         let totalTwos = arr.filter(x => x === 2).length;
 
-        if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
+        if (totalTwos === 0 && totalTwos % 2 !== 0) return -1;
 
         let halfTwos = totalTwos / 2;
killedBy: Example 1: n=2 [1,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -1,
+   1,

[Killed] ArithmeticOperator
solutions-algorithm/25.js:10:24
 
         if (totalTwos === 0 || totalTwos % 2 !== 0) return -1;
 
-        let halfTwos = totalTwos / 2;
+        let halfTwos = totalTwos * 2;
         let seenTwos = 0;
 
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] EqualityOperator
solutions-algorithm/25.js:13:25
         let halfTwos = totalTwos / 2;
         let seenTwos = 0;
 
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; i >= n; i++) {
             if (arr[i] === 2) {
                 seenTwos++;
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] ConditionalExpression
solutions-algorithm/25.js:13:25
         let halfTwos = totalTwos / 2;
         let seenTwos = 0;
 
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; false; i++) {
             if (arr[i] === 2) {
                 seenTwos++;
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] BlockStatement
solutions-algorithm/25.js:14:31
         let seenTwos = 0;
 
         for (let i = 0; i < n; i++) {
-            if (arr[i] === 2) {
-                seenTwos++;
-            }
+            if (arr[i] === 2) {}
             if (seenTwos === halfTwos) {
                 return i + 1; // 1-based index
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] ConditionalExpression
solutions-algorithm/25.js:14:17
         let seenTwos = 0;
 
         for (let i = 0; i < n; i++) {
-            if (arr[i] === 2) {
+            if (false) {
                 seenTwos++;
             }
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] UpdateOperator
solutions-algorithm/25.js:15:17
 
         for (let i = 0; i < n; i++) {
             if (arr[i] === 2) {
-                seenTwos++;
+                seenTwos--;
             }
             if (seenTwos === halfTwos) {
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] EqualityOperator
solutions-algorithm/25.js:17:17
             if (arr[i] === 2) {
                 seenTwos++;
             }
-            if (seenTwos === halfTwos) {
+            if (seenTwos !== halfTwos) {
                 return i + 1; // 1-based index
             }
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   2,

[Killed] BlockStatement
solutions-algorithm/25.js:17:40
             if (arr[i] === 2) {
                 seenTwos++;
             }
-            if (seenTwos === halfTwos) {
-                return i + 1; // 1-based index
-            }
+            if (seenTwos === halfTwos) {}
         }
 
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] ArithmeticOperator
solutions-algorithm/25.js:18:24
                 seenTwos++;
             }
             if (seenTwos === halfTwos) {
-                return i + 1; // 1-based index
+                return i - 1; // 1-based index
             }
         }
killedBy: Example 2: n=2 [2,2]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,
