[Killed] BlockStatement
solutions-algorithm/29.js:4:29
 'use strict';
 
 // Core logic
-export function solve(pins) {
-    return pins.map(pin => {
-        let curr = 1;
-        let sum = 0;
-        for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
-            sum += Math.abs(curr - next);
-            curr = next;
-        }
-        return sum + 4;
-    });
-}
+export function solve(pins) {}
 
 // Test function
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [8]
Received: undefined

[Killed] BlockStatement
solutions-algorithm/29.js:5:28
 
 // Core logic
 export function solve(pins) {
-    return pins.map(pin => {
-        let curr = 1;
-        let sum = 0;
-        for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
-            sum += Math.abs(curr - next);
-            curr = next;
-        }
-        return sum + 4;
-    });
+    return pins.map(pin => {});
 }
 
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   undefined,

[Killed] BlockStatement
solutions-algorithm/29.js:8:46
     return pins.map(pin => {
         let curr = 1;
         let sum = 0;
-        for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
-            sum += Math.abs(curr - next);
-            curr = next;
-        }
+        for (let j = 0; j < pin.length; j++) {}
         return sum + 4;
     });
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   4,

[Killed] EqualityOperator
solutions-algorithm/29.js:8:25
     return pins.map(pin => {
         let curr = 1;
         let sum = 0;
-        for (let j = 0; j < pin.length; j++) {
+        for (let j = 0; j >= pin.length; j++) {
             let next = pin[j] === '0' ? 10 : +pin[j];
             sum += Math.abs(curr - next);
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   4,

[Killed] ConditionalExpression
solutions-algorithm/29.js:9:24
         let curr = 1;
         let sum = 0;
         for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
+            let next = true ? 10 : +pin[j];
             sum += Math.abs(curr - next);
             curr = next;
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   13,

[Killed] UnaryOperator
solutions-algorithm/29.js:9:46
         let curr = 1;
         let sum = 0;
         for (let j = 0; j < pin.length; j++) {
-            let next = pin[j] === '0' ? 10 : +pin[j];
+            let next = pin[j] === '0' ? 10 : -pin[j];
             sum += Math.abs(curr - next);
             curr = next;
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   10,

[Killed] AssignmentOperator
solutions-algorithm/29.js:10:13
         let sum = 0;
         for (let j = 0; j < pin.length; j++) {
             let next = pin[j] === '0' ? 10 : +pin[j];
-            sum += Math.abs(curr - next);
+            sum -= Math.abs(curr - next);
             curr = next;
         }
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   0,

[Killed] ArithmeticOperator
solutions-algorithm/29.js:10:29
         let sum = 0;
         for (let j = 0; j < pin.length; j++) {
             let next = pin[j] === '0' ? 10 : +pin[j];
-            sum += Math.abs(curr - next);
+            sum += Math.abs(curr + next);
             curr = next;
         }
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   40,

[Killed] ArithmeticOperator
solutions-algorithm/29.js:13:16
             sum += Math.abs(curr - next);
             curr = next;
         }
-        return sum + 4;
+        return sum - 4;
     });
 }
killedBy: pin code 5555
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   8,
+   0,
