[Survived] BlockStatement
solutions-algorithm/31.js:3:34
 'use strict';
 
-export function solve(t, values) {
-    const results = [];
-
-    for (let i = 0; i < t; i++) {
-        const value = values[i];
-        let result = "";
-
-        if (value === 3) {
-            result = "-1";
-        } else {
-            const arr = [value, value - 1];
-            for (let j = 1; j < value - 1; j++) {
-                arr.push(j);
-            }
-            result = arr.join(' ');
-        }
-
-        results.push(result);
-    }
-
-    return results;
-}
+export function solve(t, values) {}
 
 // Test Function

[Survived] ArrayDeclaration
solutions-algorithm/31.js:4:21
 'use strict';
 
 export function solve(t, values) {
-    const results = [];
+    const results = ["Stryker was here"];
 
     for (let i = 0; i < t; i++) {

[Survived] EqualityOperator
solutions-algorithm/31.js:6:21
 export function solve(t, values) {
     const results = [];
 
-    for (let i = 0; i < t; i++) {
+    for (let i = 0; i <= t; i++) {
         const value = values[i];
         let result = "";

[Survived] BlockStatement
solutions-algorithm/31.js:6:33
 export function solve(t, values) {
     const results = [];
 
-    for (let i = 0; i < t; i++) {
-        const value = values[i];
-        let result = "";
-
-        if (value === 3) {
-            result = "-1";
-        } else {
-            const arr = [value, value - 1];
-            for (let j = 1; j < value - 1; j++) {
-                arr.push(j);
-            }
-            result = arr.join(' ');
-        }
-
-        results.push(result);
-    }
+    for (let i = 0; i < t; i++) {}
 
     return results;

[Survived] StringLiteral
solutions-algorithm/31.js:8:22
 
     for (let i = 0; i < t; i++) {
         const value = values[i];
-        let result = "";
+        let result = "Stryker was here!";
 
         if (value === 3) {

[Survived] ConditionalExpression
solutions-algorithm/31.js:10:13
         const value = values[i];
         let result = "";
 
-        if (value === 3) {
+        if (true) {
             result = "-1";
         } else {

[Survived] BlockStatement
solutions-algorithm/31.js:10:26
         const value = values[i];
         let result = "";
 
-        if (value === 3) {
-            result = "-1";
-        } else {
+        if (value === 3) {} else {
             const arr = [value, value - 1];
             for (let j = 1; j < value - 1; j++) {

[Survived] BlockStatement
solutions-algorithm/31.js:12:16
 
         if (value === 3) {
             result = "-1";
-        } else {
-            const arr = [value, value - 1];
-            for (let j = 1; j < value - 1; j++) {
-                arr.push(j);
-            }
-            result = arr.join(' ');
-        }
+        } else {}
 
         results.push(result);

[Survived] ArithmeticOperator
solutions-algorithm/31.js:13:33
         if (value === 3) {
             result = "-1";
         } else {
-            const arr = [value, value - 1];
+            const arr = [value, value + 1];
             for (let j = 1; j < value - 1; j++) {
                 arr.push(j);

[Survived] ArrayDeclaration
solutions-algorithm/31.js:13:25
         if (value === 3) {
             result = "-1";
         } else {
-            const arr = [value, value - 1];
+            const arr = [];
             for (let j = 1; j < value - 1; j++) {
                 arr.push(j);

[Survived] ConditionalExpression
solutions-algorithm/31.js:14:29
             result = "-1";
         } else {
             const arr = [value, value - 1];
-            for (let j = 1; j < value - 1; j++) {
+            for (let j = 1; false; j++) {
                 arr.push(j);
             }

[Survived] ArithmeticOperator
solutions-algorithm/31.js:14:33
             result = "-1";
         } else {
             const arr = [value, value - 1];
-            for (let j = 1; j < value - 1; j++) {
+            for (let j = 1; j < value + 1; j++) {
                 arr.push(j);
             }

[Survived] StringLiteral
solutions-algorithm/31.js:17:31
             for (let j = 1; j < value - 1; j++) {
                 arr.push(j);
             }
-            result = arr.join(' ');
+            result = arr.join("");
         }
 
