[Survived] ArrayDeclaration
solutions-algorithm/32.js:11:21
 export function solve(testCases) {
     //TODO error has to fix
     const MODD = 1000000007;
-    const results = [];
+    const results = ["Stryker was here"];
 
     for (const { N, A, B, C }

[Survived] UpdateOperator
solutions-algorithm/32.js:16:32
     for (const { N, A, B, C }
         of testCases) {
         const arrow = {};
-        for (let i = 0; i < N; i++) {
+        for (let i = 0; i < N; i--) {
             arrow[A[i]] = B[i];
         }

[Survived] BlockStatement
solutions-algorithm/32.js:16:37
     for (const { N, A, B, C }
         of testCases) {
         const arrow = {};
-        for (let i = 0; i < N; i++) {
-            arrow[A[i]] = B[i];
-        }
+        for (let i = 0; i < N; i++) {}
 
         const cSet = new Set();

[Survived] EqualityOperator
solutions-algorithm/32.js:21:25
         }
 
         const cSet = new Set();
-        for (let i = 0; i < N; i++) {
+        for (let i = 0; i >= N; i++) {
             if (C[i] !== 0) cSet.add(C[i]);
         }

[Survived] BlockStatement
solutions-algorithm/32.js:21:37
         }
 
         const cSet = new Set();
-        for (let i = 0; i < N; i++) {
-            if (C[i] !== 0) cSet.add(C[i]);
-        }
+        for (let i = 0; i < N; i++) {}
 
         const taken = new Array(N + 1).fill(false);

[Survived] ConditionalExpression
solutions-algorithm/32.js:22:17
 
         const cSet = new Set();
         for (let i = 0; i < N; i++) {
-            if (C[i] !== 0) cSet.add(C[i]);
+            if (true) cSet.add(C[i]);
         }
 

[Survived] EqualityOperator
solutions-algorithm/32.js:22:17
 
         const cSet = new Set();
         for (let i = 0; i < N; i++) {
-            if (C[i] !== 0) cSet.add(C[i]);
+            if (C[i] === 0) cSet.add(C[i]);
         }
 

[Survived] BooleanLiteral
solutions-algorithm/32.js:25:45
             if (C[i] !== 0) cSet.add(C[i]);
         }
 
-        const taken = new Array(N + 1).fill(false);
+        const taken = new Array(N + 1).fill(true);
         const cycles = [];
 

[Survived] ArithmeticOperator
solutions-algorithm/32.js:25:33
             if (C[i] !== 0) cSet.add(C[i]);
         }
 
-        const taken = new Array(N + 1).fill(false);
+        const taken = new Array(N - 1).fill(false);
         const cycles = [];
 

[Survived] BlockStatement
solutions-algorithm/32.js:28:38
         const taken = new Array(N + 1).fill(false);
         const cycles = [];
 
-        for (let i = 1; i <= N; i++) {
-            if (!taken[i]) {
-                const cycle = [];
-                let j = i;
-                while (!taken[j]) {
-                    taken[j] = true;
-                    cycle.push(j);
-                    j = arrow[j];
-                }
-                cycles.push(cycle);
-            }
-        }
+        for (let i = 1; i <= N; i++) {}
 
         let ans = 1;

[Survived] UpdateOperator
solutions-algorithm/32.js:28:33
         const taken = new Array(N + 1).fill(false);
         const cycles = [];
 
-        for (let i = 1; i <= N; i++) {
+        for (let i = 1; i <= N; i--) {
             if (!taken[i]) {
                 const cycle = [];

[Survived] BooleanLiteral
solutions-algorithm/32.js:29:17
         const cycles = [];
 
         for (let i = 1; i <= N; i++) {
-            if (!taken[i]) {
+            if (taken[i]) {
                 const cycle = [];
                 let j = i;

[Survived] ConditionalExpression
solutions-algorithm/32.js:29:17
         const cycles = [];
 
         for (let i = 1; i <= N; i++) {
-            if (!taken[i]) {
+            if (false) {
                 const cycle = [];
                 let j = i;

[Survived] ConditionalExpression
solutions-algorithm/32.js:32:24
             if (!taken[i]) {
                 const cycle = [];
                 let j = i;
-                while (!taken[j]) {
+                while (false) {
                     taken[j] = true;
                     cycle.push(j);

[Survived] BlockStatement
solutions-algorithm/32.js:32:35
             if (!taken[i]) {
                 const cycle = [];
                 let j = i;
-                while (!taken[j]) {
-                    taken[j] = true;
-                    cycle.push(j);
-                    j = arrow[j];
-                }
+                while (!taken[j]) {}
                 cycles.push(cycle);
             }

[Survived] BooleanLiteral
solutions-algorithm/32.js:33:32
                 const cycle = [];
                 let j = i;
                 while (!taken[j]) {
-                    taken[j] = true;
+                    taken[j] = false;
                     cycle.push(j);
                     j = arrow[j];

[Survived] BlockStatement
solutions-algorithm/32.js:42:37
         }
 
         let ans = 1;
-        for (const cycle of cycles) {
-            let hasFixed = false;
-            for (const u of cycle) {
-                if (cSet.has(u)) {
-                    hasFixed = true;
-                    break;
-                }
-            }
-
-            if (!hasFixed && cycle.length > 1) {
-                ans = (ans * 2) % MODD;
-            }
-        }
+        for (const cycle of cycles) {}
 
         results.push(ans);

[Survived] BooleanLiteral
solutions-algorithm/32.js:43:28
 
         let ans = 1;
         for (const cycle of cycles) {
-            let hasFixed = false;
+            let hasFixed = true;
             for (const u of cycle) {
                 if (cSet.has(u)) {

[Survived] BlockStatement
solutions-algorithm/32.js:44:36
         let ans = 1;
         for (const cycle of cycles) {
             let hasFixed = false;
-            for (const u of cycle) {
-                if (cSet.has(u)) {
-                    hasFixed = true;
-                    break;
-                }
-            }
+            for (const u of cycle) {}
 
             if (!hasFixed && cycle.length > 1) {

[Survived] ConditionalExpression
solutions-algorithm/32.js:45:21
         for (const cycle of cycles) {
             let hasFixed = false;
             for (const u of cycle) {
-                if (cSet.has(u)) {
+                if (false) {
                     hasFixed = true;
                     break;

[Survived] ConditionalExpression
solutions-algorithm/32.js:45:21
         for (const cycle of cycles) {
             let hasFixed = false;
             for (const u of cycle) {
-                if (cSet.has(u)) {
+                if (true) {
                     hasFixed = true;
                     break;

[Survived] BooleanLiteral
solutions-algorithm/32.js:46:32
             let hasFixed = false;
             for (const u of cycle) {
                 if (cSet.has(u)) {
-                    hasFixed = true;
+                    hasFixed = false;
                     break;
                 }

[Survived] BlockStatement
solutions-algorithm/32.js:51:48
                 }
             }
 
-            if (!hasFixed && cycle.length > 1) {
-                ans = (ans * 2) % MODD;
-            }
+            if (!hasFixed && cycle.length > 1) {}
         }
 

[Survived] EqualityOperator
solutions-algorithm/32.js:51:30
                 }
             }
 
-            if (!hasFixed && cycle.length > 1) {
+            if (!hasFixed && cycle.length <= 1) {
                 ans = (ans * 2) % MODD;
             }

[Survived] ArithmeticOperator
solutions-algorithm/32.js:52:24
             }
 
             if (!hasFixed && cycle.length > 1) {
-                ans = (ans * 2) % MODD;
+                ans = (ans / 2) % MODD;
             }
         }

[Survived] ArithmeticOperator
solutions-algorithm/32.js:52:23
             }
 
             if (!hasFixed && cycle.length > 1) {
-                ans = (ans * 2) % MODD;
+                ans = ans * 2 * MODD;
             }
         }
