[Survived] EqualityOperator
solutions-algorithm/33.js:19:25
         let ans = n;
         const q = [n];
 
-        for (let i = 0; i < n; i++) {
+        for (let i = 0; i <= n; i++) {
             let e = a[i] + i;
             if (d.has(e)) {

[Survived] ArithmeticOperator
solutions-algorithm/33.js:20:21
         const q = [n];
 
         for (let i = 0; i < n; i++) {
-            let e = a[i] + i;
+            let e = a[i] - i;
             if (d.has(e)) {
                 d.get(e).push(i);

[Survived] ConditionalExpression
solutions-algorithm/33.js:21:17
 
         for (let i = 0; i < n; i++) {
             let e = a[i] + i;
-            if (d.has(e)) {
+            if (false) {
                 d.get(e).push(i);
             } else {

[Survived] ConditionalExpression
solutions-algorithm/33.js:21:17
 
         for (let i = 0; i < n; i++) {
             let e = a[i] + i;
-            if (d.has(e)) {
+            if (true) {
                 d.get(e).push(i);
             } else {

[Survived] BlockStatement
solutions-algorithm/33.js:23:20
             let e = a[i] + i;
             if (d.has(e)) {
                 d.get(e).push(i);
-            } else {
-                d.set(e, [i]);
-            }
+            } else {}
         }
 

[Survived] ArrayDeclaration
solutions-algorithm/33.js:24:26
             if (d.has(e)) {
                 d.get(e).push(i);
             } else {
-                d.set(e, [i]);
+                d.set(e, []);
             }
         }

[Survived] BlockStatement
solutions-algorithm/33.js:28:28
             }
         }
 
-        for (const x of q) {
-            if (!d.has(x)) continue;
-
-            for (const y of d.get(x)) {
-                const val = x + y;
-                if (!s.has(val)) {
-                    q.push(val);
-                    s.add(val);
-                    ans = Math.max(ans, val);
-                }
-            }
-        }
+        for (const x of q) {}
 
         results.push(ans);

[Survived] ConditionalExpression
solutions-algorithm/33.js:29:17
         }
 
         for (const x of q) {
-            if (!d.has(x)) continue;
+            if (true) continue;
 
             for (const y of d.get(x)) {

[Survived] ConditionalExpression
solutions-algorithm/33.js:29:17
         }
 
         for (const x of q) {
-            if (!d.has(x)) continue;
+            if (false) continue;
 
             for (const y of d.get(x)) {

[Survived] BlockStatement
solutions-algorithm/33.js:31:39
         for (const x of q) {
             if (!d.has(x)) continue;
 
-            for (const y of d.get(x)) {
-                const val = x + y;
-                if (!s.has(val)) {
-                    q.push(val);
-                    s.add(val);
-                    ans = Math.max(ans, val);
-                }
-            }
+            for (const y of d.get(x)) {}
         }
 

[Survived] ArithmeticOperator
solutions-algorithm/33.js:32:29
             if (!d.has(x)) continue;
 
             for (const y of d.get(x)) {
-                const val = x + y;
+                const val = x - y;
                 if (!s.has(val)) {
                     q.push(val);

[Survived] BooleanLiteral
solutions-algorithm/33.js:33:21
 
             for (const y of d.get(x)) {
                 const val = x + y;
-                if (!s.has(val)) {
+                if (s.has(val)) {
                     q.push(val);
                     s.add(val);

[Survived] ConditionalExpression
solutions-algorithm/33.js:33:21
 
             for (const y of d.get(x)) {
                 const val = x + y;
-                if (!s.has(val)) {
+                if (true) {
                     q.push(val);
                     s.add(val);

[Survived] MethodExpression
solutions-algorithm/33.js:36:27
                 if (!s.has(val)) {
                     q.push(val);
                     s.add(val);
-                    ans = Math.max(ans, val);
+                    ans = Math.min(ans, val);
                 }
             }
