[Survived] BlockStatement
solutions-algorithm/34.js:8:31
  * @param {number[]} inputs - Array of integers
  * @returns {number[]} - Resulting array with each number minus one
  */
-export function solve(inputs) {
-    return inputs.map(x => x - 1);
-}
+export function solve(inputs) {}
 
 // Test Function

[Survived] ArithmeticOperator
solutions-algorithm/34.js:9:28
  * @returns {number[]} - Resulting array with each number minus one
  */
 export function solve(inputs) {
-    return inputs.map(x => x - 1);
+    return inputs.map(x => x + 1);
 }
 

[Survived] ArrowFunction
solutions-algorithm/34.js:9:23
  * @returns {number[]} - Resulting array with each number minus one
  */
 export function solve(inputs) {
-    return inputs.map(x => x - 1);
+    return inputs.map(() => undefined);
 }
 
