[Survived] BlockStatement
solutions-algorithm/35.js:9:30
  * @param {number} k - The base for operations.
  * @returns {number}
  */
-function calculation(num, k) {
-    if (k === 1) {
-        return num;
-    }
-    let count = 0;
-    while (num > 0) {
-        count += num % k;
-        num = Math.floor(num / k);
-    }
-    return count;
-}
+function calculation(num, k) {}
 
 /**

[Survived] ConditionalExpression
solutions-algorithm/35.js:10:9
  * @returns {number}
  */
 function calculation(num, k) {
-    if (k === 1) {
+    if (true) {
         return num;
     }

[Survived] ConditionalExpression
solutions-algorithm/35.js:10:9
  * @returns {number}
  */
 function calculation(num, k) {
-    if (k === 1) {
+    if (false) {
         return num;
     }

[Survived] EqualityOperator
solutions-algorithm/35.js:14:12
         return num;
     }
     let count = 0;
-    while (num > 0) {
+    while (num >= 0) {
         count += num % k;
         num = Math.floor(num / k);

[Survived] ConditionalExpression
solutions-algorithm/35.js:14:12
         return num;
     }
     let count = 0;
-    while (num > 0) {
+    while (false) {
         count += num % k;
         num = Math.floor(num / k);

[Survived] ArithmeticOperator
solutions-algorithm/35.js:15:18
     }
     let count = 0;
     while (num > 0) {
-        count += num % k;
+        count += num * k;
         num = Math.floor(num / k);
     }

[Survived] AssignmentOperator
solutions-algorithm/35.js:15:9
     }
     let count = 0;
     while (num > 0) {
-        count += num % k;
+        count -= num % k;
         num = Math.floor(num / k);
     }

[Survived] ArithmeticOperator
solutions-algorithm/35.js:16:26
     let count = 0;
     while (num > 0) {
         count += num % k;
-        num = Math.floor(num / k);
+        num = Math.floor(num * k);
     }
     return count;

[Survived] BlockStatement
solutions-algorithm/35.js:26:30
  * @param {Array<[number, number]>} cases - An array of [num, k] pairs.
  * @returns {number[]} - Array of results for each test case.
  */
-export function solve(cases) {
-    return cases.map(([num, k]) => calculation(num, k));
-}
+export function solve(cases) {}
 
 // ✅ Test function

[Survived] ArrowFunction
solutions-algorithm/35.js:27:22
  * @returns {number[]} - Array of results for each test case.
  */
 export function solve(cases) {
-    return cases.map(([num, k]) => calculation(num, k));
+    return cases.map(() => undefined);
 }
 
