[Killed] BlockStatement
solutions-algorithm/37.js:2:26
 // ✅ Functional version (HackerRank style)
-export function solve(n) {
-    const res = [];
-    for (let i = 0; i < n; i++) {
-        res.push(1 + 2 * i);
-    }
-    return res;
-}
+export function solve(n) {}
 
 // 🧪 Test function
killedBy: n = 2
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
solutions-algorithm/37.js:4:21
 // ✅ Functional version (HackerRank style)
 export function solve(n) {
     const res = [];
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         res.push(1 + 2 * i);
     }
killedBy: n = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
solutions-algorithm/37.js:4:21
 // ✅ Functional version (HackerRank style)
 export function solve(n) {
     const res = [];
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i <= n; i++) {
         res.push(1 + 2 * i);
     }
killedBy: n = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
solutions-algorithm/37.js:5:22
 export function solve(n) {
     const res = [];
     for (let i = 0; i < n; i++) {
-        res.push(1 + 2 * i);
+        res.push(1 + 2 / i);
     }
     return res;
killedBy: n = 2
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 3
Received:   Infinity

[Killed] ArithmeticOperator
solutions-algorithm/37.js:5:18
 export function solve(n) {
     const res = [];
     for (let i = 0; i < n; i++) {
-        res.push(1 + 2 * i);
+        res.push(1 - 2 * i);
     }
     return res;
killedBy: n = 2
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < -1
Received:   1
