[Killed] BlockStatement
solutions-algorithm/38.js:2:29
 // ✅ Functional logic
-export function solve(n, y) {
-    return n === y ? n : "1";
-}
+export function solve(n, y) {}
 
 // 🧪 Test runner
killedBy: GCD of range where a == b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] ConditionalExpression
solutions-algorithm/38.js:3:12
 // ✅ Functional logic
 export function solve(n, y) {
-    return n === y ? n : "1";
+    return true ? n : "1";
 }
 
killedBy: GCD of two consecutive integers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "5"

[Killed] EqualityOperator
solutions-algorithm/38.js:3:12
 // ✅ Functional logic
 export function solve(n, y) {
-    return n === y ? n : "1";
+    return n !== y ? n : "1";
 }
 
killedBy: GCD of range where a == b
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "15"
Received: "1"
