[Killed] BlockStatement
solutions-algorithm/4.js:2:28
 // Core logic function
-export function solve(arr) {
-    const lenOfArray = arr.length;
-    const sortedArr = [...arr].sort((a, b) => a - b);
-    const max1 = sortedArr[lenOfArray - 1];
-    const max2 = sortedArr[lenOfArray - 2];
-
-    const temp = arr.map(value => {
-        if (value !== max1) {
-            return value - max1;
-        } else {
-            return value - max2;
-        }
-    });
-
-    return temp;
-}
+export function solve(arr) {}
 
 // Test function
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [-1, 1]
Received: undefined

[Killed] ArrowFunction
solutions-algorithm/4.js:4:37
 // Core logic function
 export function solve(arr) {
     const lenOfArray = arr.length;
-    const sortedArr = [...arr].sort((a, b) => a - b);
+    const sortedArr = [...arr].sort(() => undefined);
     const max1 = sortedArr[lenOfArray - 1];
     const max2 = sortedArr[lenOfArray - 2];
killedBy: second max duplicate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   -2,
-   0,

[Killed] ArithmeticOperator
solutions-algorithm/4.js:4:47
 // Core logic function
 export function solve(arr) {
     const lenOfArray = arr.length;
-    const sortedArr = [...arr].sort((a, b) => a - b);
+    const sortedArr = [...arr].sort((a, b) => a + b);
     const max1 = sortedArr[lenOfArray - 1];
     const max2 = sortedArr[lenOfArray - 2];
killedBy: second max duplicate
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   -2,
-   0,

[Killed] ArithmeticOperator
solutions-algorithm/4.js:5:28
 export function solve(arr) {
     const lenOfArray = arr.length;
     const sortedArr = [...arr].sort((a, b) => a - b);
-    const max1 = sortedArr[lenOfArray - 1];
+    const max1 = sortedArr[lenOfArray + 1];
     const max2 = sortedArr[lenOfArray - 2];
 
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   -1,
-   1,

[Killed] ArithmeticOperator
solutions-algorithm/4.js:6:28
     const lenOfArray = arr.length;
     const sortedArr = [...arr].sort((a, b) => a - b);
     const max1 = sortedArr[lenOfArray - 1];
-    const max2 = sortedArr[lenOfArray - 2];
+    const max2 = sortedArr[lenOfArray + 2];
 
     const temp = arr.map(value => {
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    -1,
-   1,

[Killed] BlockStatement
solutions-algorithm/4.js:8:35
     const max1 = sortedArr[lenOfArray - 1];
     const max2 = sortedArr[lenOfArray - 2];
 
-    const temp = arr.map(value => {
-        if (value !== max1) {
-            return value - max1;
-        } else {
-            return value - max2;
-        }
-    });
+    const temp = arr.map(value => {});
 
     return temp;
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   -1,
-   1,

[Killed] ConditionalExpression
solutions-algorithm/4.js:9:13
     const max2 = sortedArr[lenOfArray - 2];
 
     const temp = arr.map(value => {
-        if (value !== max1) {
+        if (true) {
             return value - max1;
         } else {
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    -1,
-   1,

[Killed] ConditionalExpression
solutions-algorithm/4.js:9:13
     const max2 = sortedArr[lenOfArray - 2];
 
     const temp = arr.map(value => {
-        if (value !== max1) {
+        if (false) {
             return value - max1;
         } else {
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -1,
+   0,

[Killed] ArithmeticOperator
solutions-algorithm/4.js:10:20
 
     const temp = arr.map(value => {
         if (value !== max1) {
-            return value - max1;
+            return value + max1;
         } else {
             return value - max2;
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   -1,
+   3,

[Killed] BlockStatement
solutions-algorithm/4.js:11:16
     const temp = arr.map(value => {
         if (value !== max1) {
             return value - max1;
-        } else {
-            return value - max2;
-        }
+        } else {}
     });
 
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    -1,
-   1,

[Killed] ArithmeticOperator
solutions-algorithm/4.js:12:20
         if (value !== max1) {
             return value - max1;
         } else {
-            return value - max2;
+            return value + max2;
         }
     });
killedBy: sample test 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    -1,
-   1,
