[Killed] BlockStatement
solutions-algorithm/40.js:2:30
 // Function to compute GCD (NOD)
-export function gcd(...args) {
-    let x = args[0];
-    for (let i = 1; i < args.length; i++) {
-        let y = args[i];
-        while (x && y) {
-            x > y ? (x %= y) : (y %= x);
-        }
-        x += y;
-    }
-    return x;
-}
+export function gcd(...args) {}
 
 // Function to compute the desired result for one pair (a,b)
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: NaN

[Killed] EqualityOperator
solutions-algorithm/40.js:4:21
 // Function to compute GCD (NOD)
 export function gcd(...args) {
     let x = args[0];
-    for (let i = 1; i < args.length; i++) {
+    for (let i = 1; i <= args.length; i++) {
         let y = args[i];
         while (x && y) {
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: NaN

[Survived] EqualityOperator
solutions-algorithm/40.js:4:21
 // Function to compute GCD (NOD)
 export function gcd(...args) {
     let x = args[0];
-    for (let i = 1; i < args.length; i++) {
+    for (let i = 1; i >= args.length; i++) {
         let y = args[i];
         while (x && y) {

[Killed] ConditionalExpression
solutions-algorithm/40.js:6:16
     let x = args[0];
     for (let i = 1; i < args.length; i++) {
         let y = args[i];
-        while (x && y) {
+        while (false) {
             x > y ? (x %= y) : (y %= x);
         }
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1.3333333333333333

[Killed] LogicalOperator
solutions-algorithm/40.js:6:16
     let x = args[0];
     for (let i = 1; i < args.length; i++) {
         let y = args[i];
-        while (x && y) {
+        while (x || y) {
             x > y ? (x %= y) : (y %= x);
         }
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: NaN

[Survived] ConditionalExpression
solutions-algorithm/40.js:7:13
     for (let i = 1; i < args.length; i++) {
         let y = args[i];
         while (x && y) {
-            x > y ? (x %= y) : (y %= x);
+            false ? (x %= y) : (y %= x);
         }
         x += y;

[Survived] EqualityOperator
solutions-algorithm/40.js:7:13
     for (let i = 1; i < args.length; i++) {
         let y = args[i];
         while (x && y) {
-            x > y ? (x %= y) : (y %= x);
+            x >= y ? (x %= y) : (y %= x);
         }
         x += y;

[Survived] AssignmentOperator
solutions-algorithm/40.js:9:9
         while (x && y) {
             x > y ? (x %= y) : (y %= x);
         }
-        x += y;
+        x -= y;
     }
     return x;

[Killed] BlockStatement
solutions-algorithm/40.js:15:29
 }
 
 // Function to compute the desired result for one pair (a,b)
-export function solve(a, b) {
-    const n = gcd(a, b);
-    let res = (a / n) * b;
-    if (res === b) {
-        if (a === n) {
-            res *= b / n;
-        } else {
-            res *= 2;
-        }
-    }
-    return res;
-}
+export function solve(a, b) {}
 
 // Test function to verify correctness
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] ArithmeticOperator
solutions-algorithm/40.js:17:16
 // Function to compute the desired result for one pair (a,b)
 export function solve(a, b) {
     const n = gcd(a, b);
-    let res = (a / n) * b;
+    let res = (a * n) * b;
     if (res === b) {
         if (a === n) {
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 16

[Killed] ArithmeticOperator
solutions-algorithm/40.js:17:15
 // Function to compute the desired result for one pair (a,b)
 export function solve(a, b) {
     const n = gcd(a, b);
-    let res = (a / n) * b;
+    let res = a / n / b;
     if (res === b) {
         if (a === n) {
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 0.25

[Killed] ConditionalExpression
solutions-algorithm/40.js:18:9
 export function solve(a, b) {
     const n = gcd(a, b);
     let res = (a / n) * b;
-    if (res === b) {
+    if (false) {
         if (a === n) {
             res *= b / n;
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 4

[Killed] BlockStatement
solutions-algorithm/40.js:18:20
 export function solve(a, b) {
     const n = gcd(a, b);
     let res = (a / n) * b;
-    if (res === b) {
-        if (a === n) {
-            res *= b / n;
-        } else {
-            res *= 2;
-        }
-    }
+    if (res === b) {}
     return res;
 }
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 4

[Killed] BlockStatement
solutions-algorithm/40.js:19:22
     const n = gcd(a, b);
     let res = (a / n) * b;
     if (res === b) {
-        if (a === n) {
-            res *= b / n;
-        } else {
+        if (a === n) {} else {
             res *= 2;
         }
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 4

[Survived] EqualityOperator
solutions-algorithm/40.js:19:13
     const n = gcd(a, b);
     let res = (a / n) * b;
     if (res === b) {
-        if (a === n) {
+        if (a !== n) {
             res *= b / n;
         } else {

[Killed] ArithmeticOperator
solutions-algorithm/40.js:20:20
     let res = (a / n) * b;
     if (res === b) {
         if (a === n) {
-            res *= b / n;
+            res *= b * n;
         } else {
             res *= 2;
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 32

[Killed] AssignmentOperator
solutions-algorithm/40.js:20:13
     let res = (a / n) * b;
     if (res === b) {
         if (a === n) {
-            res *= b / n;
+            res /= b / n;
         } else {
             res *= 2;
killedBy: Test case 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 2

[Survived] BlockStatement
solutions-algorithm/40.js:21:16
     if (res === b) {
         if (a === n) {
             res *= b / n;
-        } else {
-            res *= 2;
-        }
+        } else {}
     }
     return res;

[Survived] AssignmentOperator
solutions-algorithm/40.js:22:13
         if (a === n) {
             res *= b / n;
         } else {
-            res *= 2;
+            res /= 2;
         }
     }
