[Killed] BlockStatement
solutions-algorithm/42.js:4:29
 "use strict";
 
 // Core logic function for Hackerrank-style use
-export function solve(n, a) {
-    const stack = [];
-    for (let i = 0; i < n; i++) {
-        let l = 0,
-            r = stack.length;
-        while (l < r) {
-            const m = (l + r) >> 1;
-            if (stack[m] <= a[i]) {
-                l = m + 1;
-            } else {
-                r = m;
-            }
-        }
-        stack[l] = a[i];
-    }
-    return stack.length;
-}
+export function solve(n, a) {}
 
 // Test function to ensure correctness
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] EqualityOperator
solutions-algorithm/42.js:6:21
 // Core logic function for Hackerrank-style use
 export function solve(n, a) {
     const stack = [];
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         let l = 0,
             r = stack.length;
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
solutions-algorithm/42.js:6:33
 // Core logic function for Hackerrank-style use
 export function solve(n, a) {
     const stack = [];
-    for (let i = 0; i < n; i++) {
-        let l = 0,
-            r = stack.length;
-        while (l < r) {
-            const m = (l + r) >> 1;
-            if (stack[m] <= a[i]) {
-                l = m + 1;
-            } else {
-                r = m;
-            }
-        }
-        stack[l] = a[i];
-    }
+    for (let i = 0; i < n; i++) {}
     return stack.length;
 }
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
solutions-algorithm/42.js:9:16
     for (let i = 0; i < n; i++) {
         let l = 0,
             r = stack.length;
-        while (l < r) {
+        while (false) {
             const m = (l + r) >> 1;
             if (stack[m] <= a[i]) {
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Timeout] EqualityOperator
solutions-algorithm/42.js:9:16
     for (let i = 0; i < n; i++) {
         let l = 0,
             r = stack.length;
-        while (l < r) {
+        while (l <= r) {
             const m = (l + r) >> 1;
             if (stack[m] <= a[i]) {

[Killed] ArithmeticOperator
solutions-algorithm/42.js:10:24
         let l = 0,
             r = stack.length;
         while (l < r) {
-            const m = (l + r) >> 1;
+            const m = (l - r) >> 1;
             if (stack[m] <= a[i]) {
                 l = m + 1;
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/42.js:11:17
             r = stack.length;
         while (l < r) {
             const m = (l + r) >> 1;
-            if (stack[m] <= a[i]) {
+            if (false) {
                 l = m + 1;
             } else {
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
solutions-algorithm/42.js:11:17
             r = stack.length;
         while (l < r) {
             const m = (l + r) >> 1;
-            if (stack[m] <= a[i]) {
+            if (stack[m] > a[i]) {
                 l = m + 1;
             } else {
killedBy: n=2 sorted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Timeout] ArithmeticOperator
solutions-algorithm/42.js:12:21
         while (l < r) {
             const m = (l + r) >> 1;
             if (stack[m] <= a[i]) {
-                l = m + 1;
+                l = m - 1;
             } else {
                 r = m;

[Timeout] BlockStatement
solutions-algorithm/42.js:13:20
             const m = (l + r) >> 1;
             if (stack[m] <= a[i]) {
                 l = m + 1;
-            } else {
-                r = m;
-            }
+            } else {}
         }
         stack[l] = a[i];
