[Killed] ArithmeticOperator
solutions-algorithm/43.js:5:38
 
 //  Core logic function
 export function solve(n, a) {
-    const dp1 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
+    const dp1 = Array.from({ length: n - 2 }, () => Array(n + 2).fill(0));
     const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
 
killedBy: n=2, reversed permutation [1,0]
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
solutions-algorithm/43.js:5:47
 
 //  Core logic function
 export function solve(n, a) {
-    const dp1 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
+    const dp1 = Array.from({ length: n + 2 }, () => undefined);
     const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
 
killedBy: n=2, reversed permutation [1,0]
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
solutions-algorithm/43.js:6:59
 //  Core logic function
 export function solve(n, a) {
     const dp1 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
-    const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
+    const dp2 = Array.from({ length: n + 2 }, () => Array(n - 2).fill(0));
 
     // Precompute dp1 and dp2
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:6:38
 //  Core logic function
 export function solve(n, a) {
     const dp1 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
-    const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
+    const dp2 = Array.from({ length: n - 2 }, () => Array(n + 2).fill(0));
 
     // Precompute dp1 and dp2
killedBy: n=2, reversed permutation [1,0]
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
solutions-algorithm/43.js:9:34
     const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
 
     // Precompute dp1 and dp2
-    for (let i = 1; i <= n; i++) {
-        for (let j = 1; j <= n; j++) {
-            dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
-            dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
-        }
-    }
+    for (let i = 1; i <= n; i++) {}
 
     //  Fix: Compute total inversion count correctly
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] UpdateOperator
solutions-algorithm/43.js:9:29
     const dp2 = Array.from({ length: n + 2 }, () => Array(n + 2).fill(0));
 
     // Precompute dp1 and dp2
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i <= n; i--) {
         for (let j = 1; j <= n; j++) {
             dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
killedBy: n=2, reversed permutation [1,0]
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
solutions-algorithm/43.js:10:38
 
     // Precompute dp1 and dp2
     for (let i = 1; i <= n; i++) {
-        for (let j = 1; j <= n; j++) {
-            dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
-            dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
-        }
+        for (let j = 1; j <= n; j++) {}
     }
 
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] EqualityOperator
solutions-algorithm/43.js:10:25
 
     // Precompute dp1 and dp2
     for (let i = 1; i <= n; i++) {
-        for (let j = 1; j <= n; j++) {
+        for (let j = 1; j < n; j++) {
             dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
             dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   1,

[Survived] ArithmeticOperator
solutions-algorithm/43.js:11:55
     // Precompute dp1 and dp2
     for (let i = 1; i <= n; i++) {
         for (let j = 1; j <= n; j++) {
-            dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
+            dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i + 1] ? 1 : 0);
             dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
         }

[Survived] ArithmeticOperator
solutions-algorithm/43.js:11:25
     // Precompute dp1 and dp2
     for (let i = 1; i <= n; i++) {
         for (let j = 1; j <= n; j++) {
-            dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
+            dp1[i][j] = dp1[i][j - 1] - (a[j - 1] < a[i - 1] ? 1 : 0);
             dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
         }

[Killed] ConditionalExpression
solutions-algorithm/43.js:12:42
     for (let i = 1; i <= n; i++) {
         for (let j = 1; j <= n; j++) {
             dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
-            dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
+            dp2[i][j] = dp2[i][j - 1] + (true ? 1 : 0);
         }
     }
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:12:55
     for (let i = 1; i <= n; i++) {
         for (let j = 1; j <= n; j++) {
             dp1[i][j] = dp1[i][j - 1] + (a[j - 1] < a[i - 1] ? 1 : 0);
-            dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i - 1] ? 1 : 0);
+            dp2[i][j] = dp2[i][j - 1] + (a[j - 1] > a[i + 1] ? 1 : 0);
         }
     }
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] ConditionalExpression
solutions-algorithm/43.js:18:21
 
     //  Fix: Compute total inversion count correctly
     let sm = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         for (let j = i + 1; j < n; j++) {
             if (a[i] > a[j]) sm++;
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] EqualityOperator
solutions-algorithm/43.js:18:21
 
     //  Fix: Compute total inversion count correctly
     let sm = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         for (let j = i + 1; j < n; j++) {
             if (a[i] > a[j]) sm++;
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] ConditionalExpression
solutions-algorithm/43.js:19:29
     //  Fix: Compute total inversion count correctly
     let sm = 0;
     for (let i = 0; i < n; i++) {
-        for (let j = i + 1; j < n; j++) {
+        for (let j = i + 1; false; j++) {
             if (a[i] > a[j]) sm++;
         }
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] BlockStatement
solutions-algorithm/43.js:19:41
     //  Fix: Compute total inversion count correctly
     let sm = 0;
     for (let i = 0; i < n; i++) {
-        for (let j = i + 1; j < n; j++) {
-            if (a[i] > a[j]) sm++;
-        }
+        for (let j = i + 1; j < n; j++) {}
     }
 
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] UpdateOperator
solutions-algorithm/43.js:20:30
     let sm = 0;
     for (let i = 0; i < n; i++) {
         for (let j = i + 1; j < n; j++) {
-            if (a[i] > a[j]) sm++;
+            if (a[i] > a[j]) sm--;
         }
     }
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -2,

[Killed] ConditionalExpression
solutions-algorithm/43.js:20:17
     let sm = 0;
     for (let i = 0; i < n; i++) {
         for (let j = i + 1; j < n; j++) {
-            if (a[i] > a[j]) sm++;
+            if (false) sm++;
         }
     }
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] EqualityOperator
solutions-algorithm/43.js:27:21
     let mx = Number.MAX_SAFE_INTEGER;
     let cnt = 0;
 
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i > n; i++) {
         for (let j = i + 1; j <= n; j++) {
             const p =
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,

[Killed] ConditionalExpression
solutions-algorithm/43.js:27:21
     let mx = Number.MAX_SAFE_INTEGER;
     let cnt = 0;
 
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; false; i++) {
         for (let j = i + 1; j <= n; j++) {
             const p =
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,

[Killed] BlockStatement
solutions-algorithm/43.js:28:42
     let cnt = 0;
 
     for (let i = 1; i <= n; i++) {
-        for (let j = i + 1; j <= n; j++) {
-            const p =
-                sm +
-                (dp1[j][j - 1] - dp1[j][i]) -
-                (dp2[j][j] - dp2[j][i]) -
-                1 -
-                (dp1[i][j - 1] - dp1[i][i]) +
-                (dp2[i][j] - dp2[i][i]);
-
-            if (p === mx) cnt++;
-            else if (p < mx) {
-                mx = p;
-                cnt = 1;
-            }
-        }
+        for (let j = i + 1; j <= n; j++) {}
     }
 
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,

[Killed] UpdateOperator
solutions-algorithm/43.js:28:37
     let cnt = 0;
 
     for (let i = 1; i <= n; i++) {
-        for (let j = i + 1; j <= n; j++) {
+        for (let j = i + 1; j <= n; j--) {
             const p =
                 sm +
killedBy: n=2, reversed permutation [1,0]
statusReason: TypeError: Cannot read properties of undefined (reading '-2')

[Killed] ArithmeticOperator
solutions-algorithm/43.js:30:17
     for (let i = 1; i <= n; i++) {
         for (let j = i + 1; j <= n; j++) {
             const p =
-                sm +
-                (dp1[j][j - 1] - dp1[j][i]) -
-                (dp2[j][j] - dp2[j][i]) -
-                1 -
-                (dp1[i][j - 1] - dp1[i][i]) +
-                (dp2[i][j] - dp2[i][i]);
+                sm + (dp1[j][j - 1] - dp1[j][i]) - (dp2[j][j] - dp2[j][i]) - 1 - (dp1[i][j - 1] - dp1[i][i]) - (dp2[i][j] - dp2[i][i]);
 
             if (p === mx) cnt++;
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   -1,
    1,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:30:17
     for (let i = 1; i <= n; i++) {
         for (let j = i + 1; j <= n; j++) {
             const p =
-                sm +
-                (dp1[j][j - 1] - dp1[j][i]) -
-                (dp2[j][j] - dp2[j][i]) -
-                1 -
+                sm + (dp1[j][j - 1] - dp1[j][i]) - (dp2[j][j] - dp2[j][i]) + 1 -
                 (dp1[i][j - 1] - dp1[i][i]) +
                 (dp2[i][j] - dp2[i][i]);
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   2,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:31:18
         for (let j = i + 1; j <= n; j++) {
             const p =
                 sm +
-                (dp1[j][j - 1] - dp1[j][i]) -
+                (dp1[j][j - 1] + dp1[j][i]) -
                 (dp2[j][j] - dp2[j][i]) -
                 1 -
killedBy: n=2, sorted permutation [0,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   2,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:31:25
         for (let j = i + 1; j <= n; j++) {
             const p =
                 sm +
-                (dp1[j][j - 1] - dp1[j][i]) -
+                (dp1[j][j + 1] - dp1[j][i]) -
                 (dp2[j][j] - dp2[j][i]) -
                 1 -
killedBy: n=2, sorted permutation [0,1]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -1,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:32:18
             const p =
                 sm +
                 (dp1[j][j - 1] - dp1[j][i]) -
-                (dp2[j][j] - dp2[j][i]) -
+                (dp2[j][j] + dp2[j][i]) -
                 1 -
                 (dp1[i][j - 1] - dp1[i][i]) +
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   0,
+   -2,

[Killed] ArithmeticOperator
solutions-algorithm/43.js:34:18
                 (dp1[j][j - 1] - dp1[j][i]) -
                 (dp2[j][j] - dp2[j][i]) -
                 1 -
-                (dp1[i][j - 1] - dp1[i][i]) +
+                (dp1[i][j - 1] + dp1[i][i]) +
                 (dp2[i][j] - dp2[i][i]);
 
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   -1,
    1,

[Survived] ArithmeticOperator
solutions-algorithm/43.js:34:25
                 (dp1[j][j - 1] - dp1[j][i]) -
                 (dp2[j][j] - dp2[j][i]) -
                 1 -
-                (dp1[i][j - 1] - dp1[i][i]) +
+                (dp1[i][j + 1] - dp1[i][i]) +
                 (dp2[i][j] - dp2[i][i]);
 

[Survived] ArithmeticOperator
solutions-algorithm/43.js:35:18
                 (dp2[j][j] - dp2[j][i]) -
                 1 -
                 (dp1[i][j - 1] - dp1[i][i]) +
-                (dp2[i][j] - dp2[i][i]);
+                (dp2[i][j] + dp2[i][i]);
 
             if (p === mx) cnt++;

[Killed] ConditionalExpression
solutions-algorithm/43.js:37:17
                 (dp1[i][j - 1] - dp1[i][i]) +
                 (dp2[i][j] - dp2[i][i]);
 
-            if (p === mx) cnt++;
+            if (false) cnt++;
             else if (p < mx) {
                 mx = p;
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] UpdateOperator
solutions-algorithm/43.js:37:27
                 (dp1[i][j - 1] - dp1[i][i]) +
                 (dp2[i][j] - dp2[i][i]);
 
-            if (p === mx) cnt++;
+            if (p === mx) cnt--;
             else if (p < mx) {
                 mx = p;
killedBy: n=3, permutation [1,2,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] EqualityOperator
solutions-algorithm/43.js:38:22
                 (dp2[i][j] - dp2[i][i]);
 
             if (p === mx) cnt++;
-            else if (p < mx) {
+            else if (p >= mx) {
                 mx = p;
                 cnt = 1;
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,

[Killed] ConditionalExpression
solutions-algorithm/43.js:38:22
                 (dp2[i][j] - dp2[i][i]);
 
             if (p === mx) cnt++;
-            else if (p < mx) {
+            else if (false) {
                 mx = p;
                 cnt = 1;
killedBy: n=2, reversed permutation [1,0]
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   9007199254740991,
    0,
