[Killed] BlockStatement
solutions-algorithm/44.js:2:29
 // Functional logic
-export function solve(n, k) {
-    if (k % 2 === 0 || k > 2 * n - 1) return -1;
-
-    const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
-    k--;
-
-    function mg(l, r) {
-        if (k === 0 || l === r - 1) return;
-        k -= 2;
-        const mid = Math.floor((l + r) / 2);
-        [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
-        mg(l, mid);
-        mg(mid, r);
-    }
-
-    mg(1, n + 1);
-    return a.slice(1, n + 1);
-}
+export function solve(n, k) {}
 
 // Test runner
killedBy: n=1, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1]
Received: undefined

[Killed] ArithmeticOperator
solutions-algorithm/44.js:3:9
 // Functional logic
 export function solve(n, k) {
-    if (k % 2 === 0 || k > 2 * n - 1) return -1;
+    if (k * 2 === 0 || k > 2 * n - 1) return -1;
 
     const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
killedBy: n=3, k=2 (impossible)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: [2, 3, 1]

[Killed] UnaryOperator
solutions-algorithm/44.js:3:46
 // Functional logic
 export function solve(n, k) {
-    if (k % 2 === 0 || k > 2 * n - 1) return -1;
+    if (k % 2 === 0 || k > 2 * n - 1) return +1;
 
     const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
killedBy: n=3, k=2 (impossible)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Killed] ArrowFunction
solutions-algorithm/44.js:5:45
 export function solve(n, k) {
     if (k % 2 === 0 || k > 2 * n - 1) return -1;
 
-    const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
+    const a = Array.from({ length: n + 2 }, () => undefined); // 1-based indexing
     k--;
 
killedBy: n=1, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   undefined,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:5:36
 export function solve(n, k) {
     if (k % 2 === 0 || k > 2 * n - 1) return -1;
 
-    const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
+    const a = Array.from({ length: n - 2 }, (_, i) => i); // 1-based indexing
     k--;
 
killedBy: n=1, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] UpdateOperator
solutions-algorithm/44.js:6:5
     if (k % 2 === 0 || k > 2 * n - 1) return -1;
 
     const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
-    k--;
+    k++;
 
     function mg(l, r) {
killedBy: n=4, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   2,

[Killed] BlockStatement
solutions-algorithm/44.js:8:23
     const a = Array.from({ length: n + 2 }, (_, i) => i); // 1-based indexing
     k--;
 
-    function mg(l, r) {
-        if (k === 0 || l === r - 1) return;
-        k -= 2;
-        const mid = Math.floor((l + r) / 2);
-        [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
-        mg(l, mid);
-        mg(mid, r);
-    }
+    function mg(l, r) {}
 
     mg(1, n + 1);
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ConditionalExpression
solutions-algorithm/44.js:9:13
     k--;
 
     function mg(l, r) {
-        if (k === 0 || l === r - 1) return;
+        if (false) return;
         k -= 2;
         const mid = Math.floor((l + r) / 2);
killedBy: n=1, k=1
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
solutions-algorithm/44.js:9:13
     k--;
 
     function mg(l, r) {
-        if (k === 0 || l === r - 1) return;
+        if (false || l === r - 1) return;
         k -= 2;
         const mid = Math.floor((l + r) / 2);
killedBy: n=4, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   2,

[Killed] AssignmentOperator
solutions-algorithm/44.js:10:9
 
     function mg(l, r) {
         if (k === 0 || l === r - 1) return;
-        k -= 2;
+        k += 2;
         const mid = Math.floor((l + r) / 2);
         [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
-   1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:11:33
     function mg(l, r) {
         if (k === 0 || l === r - 1) return;
         k -= 2;
-        const mid = Math.floor((l + r) / 2);
+        const mid = Math.floor((l - r) / 2);
         [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
         mg(l, mid);
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:11:32
     function mg(l, r) {
         if (k === 0 || l === r - 1) return;
         k -= 2;
-        const mid = Math.floor((l + r) / 2);
+        const mid = Math.floor((l + r) * 2);
         [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
         mg(l, mid);
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:12:20
         if (k === 0 || l === r - 1) return;
         k -= 2;
         const mid = Math.floor((l + r) / 2);
-        [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
+        [a[mid], a[mid + 1]] = [a[mid - 1], a[mid]];
         mg(l, mid);
         mg(mid, r);
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   2,
    1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:12:35
         if (k === 0 || l === r - 1) return;
         k -= 2;
         const mid = Math.floor((l + r) / 2);
-        [a[mid], a[mid - 1]] = [a[mid - 1], a[mid]];
+        [a[mid], a[mid - 1]] = [a[mid + 1], a[mid]];
         mg(l, mid);
         mg(mid, r);
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    2,
-   1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:17:11
         mg(mid, r);
     }
 
-    mg(1, n + 1);
+    mg(1, n - 1);
     return a.slice(1, n + 1);
 }
killedBy: n=3, k=3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
    1,

[Killed] ArithmeticOperator
solutions-algorithm/44.js:18:23
     }
 
     mg(1, n + 1);
-    return a.slice(1, n + 1);
+    return a.slice(1, n - 1);
 }
 
killedBy: n=1, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   1,
- ]

[Killed] MethodExpression
solutions-algorithm/44.js:18:12
     }
 
     mg(1, n + 1);
-    return a.slice(1, n + 1);
+    return a;
 }
 
killedBy: n=1, k=1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   0,
    1,
