[Killed] BlockStatement
solutions-algorithm/46.js:2:36
 // Functional logic: Find max depth in organization chart/tree
-export function solve(n, managers) {
-    const graph = {};
-    let maxDepth = 0;
-
-    // Build graph
-    for (let i = 1; i <= n; i++) {
-        const parent = managers[i - 1]; // manager of employee i
-        if (!graph[i]) graph[i] = [];
-        if (!graph[parent]) graph[parent] = [];
-        graph[parent].push(i);
-    }
-
-    // DFS to compute depth
-    function dfs(node, depth) {
-        maxDepth = Math.max(maxDepth, depth);
-        for (const child of graph[node]) {
-            dfs(child, depth + 1);
-        }
-    }
-
-    dfs(-1, 0); // root is -1
-    return maxDepth;
-}
+export function solve(n, managers) {}
 
 // ✅ Test function to verify correctness
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] EqualityOperator
solutions-algorithm/46.js:7:21
     let maxDepth = 0;
 
     // Build graph
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i < n; i++) {
         const parent = managers[i - 1]; // manager of employee i
         if (!graph[i]) graph[i] = [];
killedBy: single employee
statusReason: TypeError: graph[node] is not iterable

[Killed] BlockStatement
solutions-algorithm/46.js:7:34
     let maxDepth = 0;
 
     // Build graph
-    for (let i = 1; i <= n; i++) {
-        const parent = managers[i - 1]; // manager of employee i
-        if (!graph[i]) graph[i] = [];
-        if (!graph[parent]) graph[parent] = [];
-        graph[parent].push(i);
-    }
+    for (let i = 1; i <= n; i++) {}
 
     // DFS to compute depth
killedBy: single employee
statusReason: TypeError: graph[node] is not iterable

[Killed] ArithmeticOperator
solutions-algorithm/46.js:8:33
 
     // Build graph
     for (let i = 1; i <= n; i++) {
-        const parent = managers[i - 1]; // manager of employee i
+        const parent = managers[i + 1]; // manager of employee i
         if (!graph[i]) graph[i] = [];
         if (!graph[parent]) graph[parent] = [];
killedBy: single employee
statusReason: TypeError: graph[node] is not iterable

[Killed] BooleanLiteral
solutions-algorithm/46.js:9:13
     // Build graph
     for (let i = 1; i <= n; i++) {
         const parent = managers[i - 1]; // manager of employee i
-        if (!graph[i]) graph[i] = [];
+        if (graph[i]) graph[i] = [];
         if (!graph[parent]) graph[parent] = [];
         graph[parent].push(i);
killedBy: single employee
statusReason: TypeError: graph[node] is not iterable

[Killed] ConditionalExpression
solutions-algorithm/46.js:9:13
     // Build graph
     for (let i = 1; i <= n; i++) {
         const parent = managers[i - 1]; // manager of employee i
-        if (!graph[i]) graph[i] = [];
+        if (false) graph[i] = [];
         if (!graph[parent]) graph[parent] = [];
         graph[parent].push(i);
killedBy: single employee
statusReason: TypeError: graph[node] is not iterable

[Killed] BooleanLiteral
solutions-algorithm/46.js:10:13
     for (let i = 1; i <= n; i++) {
         const parent = managers[i - 1]; // manager of employee i
         if (!graph[i]) graph[i] = [];
-        if (!graph[parent]) graph[parent] = [];
+        if (graph[parent]) graph[parent] = [];
         graph[parent].push(i);
     }
killedBy: single employee
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
solutions-algorithm/46.js:10:13
     for (let i = 1; i <= n; i++) {
         const parent = managers[i - 1]; // manager of employee i
         if (!graph[i]) graph[i] = [];
-        if (!graph[parent]) graph[parent] = [];
+        if (true) graph[parent] = [];
         graph[parent].push(i);
     }
killedBy: deep and shallow trees
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] BlockStatement
solutions-algorithm/46.js:15:31
     }
 
     // DFS to compute depth
-    function dfs(node, depth) {
-        maxDepth = Math.max(maxDepth, depth);
-        for (const child of graph[node]) {
-            dfs(child, depth + 1);
-        }
-    }
+    function dfs(node, depth) {}
 
     dfs(-1, 0); // root is -1
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
solutions-algorithm/46.js:16:20
 
     // DFS to compute depth
     function dfs(node, depth) {
-        maxDepth = Math.max(maxDepth, depth);
+        maxDepth = Math.min(maxDepth, depth);
         for (const child of graph[node]) {
             dfs(child, depth + 1);
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
solutions-algorithm/46.js:17:42
     // DFS to compute depth
     function dfs(node, depth) {
         maxDepth = Math.max(maxDepth, depth);
-        for (const child of graph[node]) {
-            dfs(child, depth + 1);
-        }
+        for (const child of graph[node]) {}
     }
 
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-algorithm/46.js:18:24
     function dfs(node, depth) {
         maxDepth = Math.max(maxDepth, depth);
         for (const child of graph[node]) {
-            dfs(child, depth + 1);
+            dfs(child, depth - 1);
         }
     }
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UnaryOperator
solutions-algorithm/46.js:22:9
         }
     }
 
-    dfs(-1, 0); // root is -1
+    dfs(+1, 0); // root is -1
     return maxDepth;
 }
killedBy: single employee
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
