[Killed] BlockStatement
solutions-algorithm/47.js:2:38
 // Functional logic for each test case
-export function solve(n, k, numbers) {
-    let check = 1;
-    for (let i = 0; i < numbers.length; i++) {
-        if (check === numbers[i]) check++;
-    }
-    return Math.ceil((n - check + 1) / k);
-}
+export function solve(n, k, numbers) {}
 
 // Test function
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
solutions-algorithm/47.js:4:21
 // Functional logic for each test case
 export function solve(n, k, numbers) {
     let check = 1;
-    for (let i = 0; i < numbers.length; i++) {
+    for (let i = 0; false; i++) {
         if (check === numbers[i]) check++;
     }
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] EqualityOperator
solutions-algorithm/47.js:4:21
 // Functional logic for each test case
 export function solve(n, k, numbers) {
     let check = 1;
-    for (let i = 0; i < numbers.length; i++) {
+    for (let i = 0; i >= numbers.length; i++) {
         if (check === numbers[i]) check++;
     }
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] EqualityOperator
solutions-algorithm/47.js:5:13
 export function solve(n, k, numbers) {
     let check = 1;
     for (let i = 0; i < numbers.length; i++) {
-        if (check === numbers[i]) check++;
+        if (check !== numbers[i]) check++;
     }
     return Math.ceil((n - check + 1) / k);
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/47.js:5:13
 export function solve(n, k, numbers) {
     let check = 1;
     for (let i = 0; i < numbers.length; i++) {
-        if (check === numbers[i]) check++;
+        if (false) check++;
     }
     return Math.ceil((n - check + 1) / k);
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ArithmeticOperator
solutions-algorithm/47.js:7:22
     for (let i = 0; i < numbers.length; i++) {
         if (check === numbers[i]) check++;
     }
-    return Math.ceil((n - check + 1) / k);
+    return Math.ceil((n - check + 1) * k);
 }
 
killedBy: reverse order, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 8

[Killed] ArithmeticOperator
solutions-algorithm/47.js:7:23
     for (let i = 0; i < numbers.length; i++) {
         if (check === numbers[i]) check++;
     }
-    return Math.ceil((n - check + 1) / k);
+    return Math.ceil((n + check + 1) / k);
 }
 
killedBy: already sorted, k = 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 12
