[Timeout] UnaryOperator
solutions-algorithm/48.js:3:36
 // Functional logic
 export function solve(n, k, p, edges) {
-    const head = Array(n + 2).fill(-1);
+    const head = Array(n + 2).fill(+1);
     const ver = [];
     const nxt = [];

[Timeout] ArithmeticOperator
solutions-algorithm/48.js:3:24
 // Functional logic
 export function solve(n, k, p, edges) {
-    const head = Array(n + 2).fill(-1);
+    const head = Array(n - 2).fill(-1);
     const ver = [];
     const nxt = [];

[Killed] ArithmeticOperator
solutions-algorithm/48.js:7:23
     const ver = [];
     const nxt = [];
     let tot = 0;
-    const cnt = Array(n + 2).fill(0);
+    const cnt = Array(n - 2).fill(0);
     const sumc = Array(n + 2).fill(0);
     const sum = Array(n + 2).fill(0);
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ArrayDeclaration
solutions-algorithm/48.js:7:17
     const ver = [];
     const nxt = [];
     let tot = 0;
-    const cnt = Array(n + 2).fill(0);
+    const cnt = Array().fill(0);
     const sumc = Array(n + 2).fill(0);
     const sum = Array(n + 2).fill(0);
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ArithmeticOperator
solutions-algorithm/48.js:8:24
     const nxt = [];
     let tot = 0;
     const cnt = Array(n + 2).fill(0);
-    const sumc = Array(n + 2).fill(0);
+    const sumc = Array(n - 2).fill(0);
     const sum = Array(n + 2).fill(0);
     let m = 0;
killedBy: single water, no cost
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Survived] ArithmeticOperator
solutions-algorithm/48.js:9:23
     let tot = 0;
     const cnt = Array(n + 2).fill(0);
     const sumc = Array(n + 2).fill(0);
-    const sum = Array(n + 2).fill(0);
+    const sum = Array(n - 2).fill(0);
     let m = 0;
 

[Killed] BlockStatement
solutions-algorithm/48.js:12:28
     const sum = Array(n + 2).fill(0);
     let m = 0;
 
-    function addedge(x, y) {
-        ver[++tot] = y;
-        nxt[tot] = head[x];
-        head[x] = tot;
-    }
+    function addedge(x, y) {}
 
     for (const [x, y] of edges) {
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] UpdateOperator
solutions-algorithm/48.js:13:13
     let m = 0;
 
     function addedge(x, y) {
-        ver[++tot] = y;
+        ver[--tot] = y;
         nxt[tot] = head[x];
         head[x] = tot;
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
solutions-algorithm/48.js:18:33
         head[x] = tot;
     }
 
-    for (const [x, y] of edges) {
-        addedge(x, y);
-        addedge(y, x);
-    }
+    for (const [x, y] of edges) {}
 
     function dfs(x, fa, dep) {
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
solutions-algorithm/48.js:23:30
         addedge(y, x);
     }
 
-    function dfs(x, fa, dep) {
-        cnt[dep]++;
-        m = Math.max(m, dep);
-        for (let i = head[x]; i !== -1; i = nxt[i]) {
-            const y = ver[i];
-            if (y === fa) continue;
-            dfs(y, x, dep + 1);
-        }
-    }
+    function dfs(x, fa, dep) {}
 
     dfs(1, 0, 0);
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] UpdateOperator
solutions-algorithm/48.js:24:9
     }
 
     function dfs(x, fa, dep) {
-        cnt[dep]++;
+        cnt[dep]--;
         m = Math.max(m, dep);
         for (let i = head[x]; i !== -1; i = nxt[i]) {
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] MethodExpression
solutions-algorithm/48.js:25:13
 
     function dfs(x, fa, dep) {
         cnt[dep]++;
-        m = Math.max(m, dep);
+        m = Math.min(m, dep);
         for (let i = head[x]; i !== -1; i = nxt[i]) {
             const y = ver[i];
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
solutions-algorithm/48.js:26:53
     function dfs(x, fa, dep) {
         cnt[dep]++;
         m = Math.max(m, dep);
-        for (let i = head[x]; i !== -1; i = nxt[i]) {
-            const y = ver[i];
-            if (y === fa) continue;
-            dfs(y, x, dep + 1);
-        }
+        for (let i = head[x]; i !== -1; i = nxt[i]) {}
     }
 
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/48.js:26:31
     function dfs(x, fa, dep) {
         cnt[dep]++;
         m = Math.max(m, dep);
-        for (let i = head[x]; i !== -1; i = nxt[i]) {
+        for (let i = head[x]; false; i = nxt[i]) {
             const y = ver[i];
             if (y === fa) continue;
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
solutions-algorithm/48.js:28:17
         m = Math.max(m, dep);
         for (let i = head[x]; i !== -1; i = nxt[i]) {
             const y = ver[i];
-            if (y === fa) continue;
+            if (y !== fa) continue;
             dfs(y, x, dep + 1);
         }
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/48.js:28:17
         m = Math.max(m, dep);
         for (let i = head[x]; i !== -1; i = nxt[i]) {
             const y = ver[i];
-            if (y === fa) continue;
+            if (true) continue;
             dfs(y, x, dep + 1);
         }
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:29:23
         for (let i = head[x]; i !== -1; i = nxt[i]) {
             const y = ver[i];
             if (y === fa) continue;
-            dfs(y, x, dep + 1);
+            dfs(y, x, dep - 1);
         }
     }
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
solutions-algorithm/48.js:36:34
     dfs(1, 0, 0);
 
     let ans = 1;
-    for (let i = 1; i <= m; i++) {
-        sumc[i] = sumc[i - 1] + cnt[i];
-        sum[i] = sum[i - 1] + cnt[i] * i;
-
-        let l = 1,
-            r = i;
-        while (l < r) {
-            const mid = Math.floor((l + r) / 2);
-            const c = sumc[i] - sumc[mid - 1];
-            const v = c * i - (sum[i] - sum[mid - 1]);
-            if (v >= p) l = mid + 1;
-            else r = mid;
-        }
-
-        let tmp = sumc[i] - sumc[l - 1];
-        const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
-        ans = Math.max(ans, Math.min(k, tmp));
-    }
+    for (let i = 1; i <= m; i++) {}
 
     return ans;
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/48.js:36:21
     dfs(1, 0, 0);
 
     let ans = 1;
-    for (let i = 1; i <= m; i++) {
+    for (let i = 1; false; i++) {
         sumc[i] = sumc[i - 1] + cnt[i];
         sum[i] = sum[i - 1] + cnt[i] * i;
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:37:24
 
     let ans = 1;
     for (let i = 1; i <= m; i++) {
-        sumc[i] = sumc[i - 1] + cnt[i];
+        sumc[i] = sumc[i + 1] + cnt[i];
         sum[i] = sum[i - 1] + cnt[i] * i;
 
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:37:19
 
     let ans = 1;
     for (let i = 1; i <= m; i++) {
-        sumc[i] = sumc[i - 1] + cnt[i];
+        sumc[i] = sumc[i - 1] - cnt[i];
         sum[i] = sum[i - 1] + cnt[i] * i;
 
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:38:18
     let ans = 1;
     for (let i = 1; i <= m; i++) {
         sumc[i] = sumc[i - 1] + cnt[i];
-        sum[i] = sum[i - 1] + cnt[i] * i;
+        sum[i] = sum[i - 1] - cnt[i] * i;
 
         let l = 1,
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-algorithm/48.js:38:31
     let ans = 1;
     for (let i = 1; i <= m; i++) {
         sumc[i] = sumc[i - 1] + cnt[i];
-        sum[i] = sum[i - 1] + cnt[i] * i;
+        sum[i] = sum[i - 1] + cnt[i] / i;
 
         let l = 1,
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-algorithm/48.js:42:16
 
         let l = 1,
             r = i;
-        while (l < r) {
+        while (false) {
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Timeout] BlockStatement
solutions-algorithm/48.js:42:23
 
         let l = 1,
             r = i;
-        while (l < r) {
-            const mid = Math.floor((l + r) / 2);
-            const c = sumc[i] - sumc[mid - 1];
-            const v = c * i - (sum[i] - sum[mid - 1]);
-            if (v >= p) l = mid + 1;
-            else r = mid;
-        }
+        while (l < r) {}
 
         let tmp = sumc[i] - sumc[l - 1];

[Killed] ArithmeticOperator
solutions-algorithm/48.js:43:37
         let l = 1,
             r = i;
         while (l < r) {
-            const mid = Math.floor((l + r) / 2);
+            const mid = Math.floor((l - r) / 2);
             const c = sumc[i] - sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Timeout] ArithmeticOperator
solutions-algorithm/48.js:43:36
         let l = 1,
             r = i;
         while (l < r) {
-            const mid = Math.floor((l + r) / 2);
+            const mid = Math.floor((l + r) * 2);
             const c = sumc[i] - sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);

[Killed] ArithmeticOperator
solutions-algorithm/48.js:44:38
             r = i;
         while (l < r) {
             const mid = Math.floor((l + r) / 2);
-            const c = sumc[i] - sumc[mid - 1];
+            const c = sumc[i] - sumc[mid + 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
             if (v >= p) l = mid + 1;
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Survived] ArithmeticOperator
solutions-algorithm/48.js:44:23
             r = i;
         while (l < r) {
             const mid = Math.floor((l + r) / 2);
-            const c = sumc[i] - sumc[mid - 1];
+            const c = sumc[i] + sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
             if (v >= p) l = mid + 1;

[Killed] ArithmeticOperator
solutions-algorithm/48.js:45:23
         while (l < r) {
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
-            const v = c * i - (sum[i] - sum[mid - 1]);
+            const v = c / i - (sum[i] - sum[mid - 1]);
             if (v >= p) l = mid + 1;
             else r = mid;
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Survived] ArithmeticOperator
solutions-algorithm/48.js:45:23
         while (l < r) {
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
-            const v = c * i - (sum[i] - sum[mid - 1]);
+            const v = c * i + (sum[i] - sum[mid - 1]);
             if (v >= p) l = mid + 1;
             else r = mid;

[Killed] ConditionalExpression
solutions-algorithm/48.js:46:17
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
-            if (v >= p) l = mid + 1;
+            if (false) l = mid + 1;
             else r = mid;
         }
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Survived] EqualityOperator
solutions-algorithm/48.js:46:17
             const mid = Math.floor((l + r) / 2);
             const c = sumc[i] - sumc[mid - 1];
             const v = c * i - (sum[i] - sum[mid - 1]);
-            if (v >= p) l = mid + 1;
+            if (v > p) l = mid + 1;
             else r = mid;
         }

[Killed] ArithmeticOperator
solutions-algorithm/48.js:50:34
             else r = mid;
         }
 
-        let tmp = sumc[i] - sumc[l - 1];
+        let tmp = sumc[i] - sumc[l + 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] ArithmeticOperator
solutions-algorithm/48.js:50:19
             else r = mid;
         }
 
-        let tmp = sumc[i] - sumc[l - 1];
+        let tmp = sumc[i] + sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));

[Killed] ArithmeticOperator
solutions-algorithm/48.js:51:21
         }
 
         let tmp = sumc[i] - sumc[l - 1];
-        const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
+        const rem = p + (tmp * i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
solutions-algorithm/48.js:51:26
         }
 
         let tmp = sumc[i] - sumc[l - 1];
-        const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
+        const rem = p - (tmp / i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] MethodExpression
solutions-algorithm/48.js:52:29
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (l !== 1) tmp += Math.max(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ArithmeticOperator
solutions-algorithm/48.js:52:61
 
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
-        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
+        if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem * (i - (l - 1))));
         ans = Math.max(ans, Math.min(k, tmp));
     }
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] MethodExpression
solutions-algorithm/48.js:53:15
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
-        ans = Math.max(ans, Math.min(k, tmp));
+        ans = Math.min(ans, Math.min(k, tmp));
     }
 
killedBy: sample test 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] MethodExpression
solutions-algorithm/48.js:53:29
         let tmp = sumc[i] - sumc[l - 1];
         const rem = p - (tmp * i - (sum[i] - sum[l - 1]));
         if (l !== 1) tmp += Math.min(cnt[l - 1], Math.floor(rem / (i - (l - 1))));
-        ans = Math.max(ans, Math.min(k, tmp));
+        ans = Math.max(ans, Math.max(k, tmp));
     }
 
killedBy: linear tree, more water than length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 5
