[Killed] BlockStatement
solutions-algorithm/49.js:2:32
 // Functional logic
-export function solve(n, m, k) {
-    return n * m - 1 === k ? 'YES' : 'NO';
-}
+export function solve(n, m, k) {}
 
 // Testing logic
killedBy: example 1: n=3, m=3, k=8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: undefined

[Killed] EqualityOperator
solutions-algorithm/49.js:3:12
 // Functional logic
 export function solve(n, m, k) {
-    return n * m - 1 === k ? 'YES' : 'NO';
+    return n * m - 1 !== k ? 'YES' : 'NO';
 }
 
killedBy: example 1: n=3, m=3, k=8
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-algorithm/49.js:3:12
 // Functional logic
 export function solve(n, m, k) {
-    return n * m - 1 === k ? 'YES' : 'NO';
+    return true ? 'YES' : 'NO';
 }
 
killedBy: example 3: n=2, m=2, k=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NO"
Received: "YES"
