[Killed] BlockStatement
solutions-algorithm/5.js:1:28
-export function solve(arr) {
-    const n = arr.length;
-    const seen = {};
-    let moves = 0;
-
-    for (let j = n - 1; j >= 0; j--) {
-        if (seen[arr[j]] === 1) {
-            moves = j + 1;
-            break;
-        } else {
-            seen[arr[j]] = 1;
-        }
-    }
-
-    return moves;
-}
+export function solve(arr) {}
 
 // Test function
killedBy: all elements unique
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
solutions-algorithm/5.js:6:25
     const seen = {};
     let moves = 0;
 
-    for (let j = n - 1; j >= 0; j--) {
+    for (let j = n - 1; j < 0; j--) {
         if (seen[arr[j]] === 1) {
             moves = j + 1;
killedBy: all elements same
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
solutions-algorithm/5.js:6:18
     const seen = {};
     let moves = 0;
 
-    for (let j = n - 1; j >= 0; j--) {
+    for (let j = n + 1; j >= 0; j--) {
         if (seen[arr[j]] === 1) {
             moves = j + 1;
killedBy: all elements unique
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] ConditionalExpression
solutions-algorithm/5.js:7:13
     let moves = 0;
 
     for (let j = n - 1; j >= 0; j--) {
-        if (seen[arr[j]] === 1) {
+        if (true) {
             moves = j + 1;
             break;
killedBy: all elements unique
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] BlockStatement
solutions-algorithm/5.js:7:33
     let moves = 0;
 
     for (let j = n - 1; j >= 0; j--) {
-        if (seen[arr[j]] === 1) {
-            moves = j + 1;
-            break;
-        } else {
+        if (seen[arr[j]] === 1) {} else {
             seen[arr[j]] = 1;
         }
killedBy: all elements same
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
solutions-algorithm/5.js:8:21
 
     for (let j = n - 1; j >= 0; j--) {
         if (seen[arr[j]] === 1) {
-            moves = j + 1;
+            moves = j - 1;
             break;
         } else {
killedBy: all elements same
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] BlockStatement
solutions-algorithm/5.js:10:16
         if (seen[arr[j]] === 1) {
             moves = j + 1;
             break;
-        } else {
-            seen[arr[j]] = 1;
-        }
+        } else {}
     }
 
killedBy: all elements same
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0
