[Survived] BlockStatement
solutions-algorithm/50.js:2:35
 // Functional logic: Computes prefix sums and returns query results
-export function solve(s, queries) {
-    const a = [0]; // prefix sum array
-
-    for (let i = 0; i < s.length; i++) {
-        const x = s.charCodeAt(i) - 96; // 'a' = 1, 'b' = 2, ...
-        a.push(x + a[i]);
-    }
-
-    return queries.map(([l, r]) => a[r] - a[l - 1]);
-}
+export function solve(s, queries) {}
 
 // Test function

[Survived] ArrayDeclaration
solutions-algorithm/50.js:3:15
 // Functional logic: Computes prefix sums and returns query results
 export function solve(s, queries) {
-    const a = [0]; // prefix sum array
+    const a = []; // prefix sum array
 
     for (let i = 0; i < s.length; i++) {

[Survived] EqualityOperator
solutions-algorithm/50.js:5:21
 export function solve(s, queries) {
     const a = [0]; // prefix sum array
 
-    for (let i = 0; i < s.length; i++) {
+    for (let i = 0; i >= s.length; i++) {
         const x = s.charCodeAt(i) - 96; // 'a' = 1, 'b' = 2, ...
         a.push(x + a[i]);

[Survived] ConditionalExpression
solutions-algorithm/50.js:5:21
 export function solve(s, queries) {
     const a = [0]; // prefix sum array
 
-    for (let i = 0; i < s.length; i++) {
+    for (let i = 0; false; i++) {
         const x = s.charCodeAt(i) - 96; // 'a' = 1, 'b' = 2, ...
         a.push(x + a[i]);

[Survived] ArithmeticOperator
solutions-algorithm/50.js:6:19
     const a = [0]; // prefix sum array
 
     for (let i = 0; i < s.length; i++) {
-        const x = s.charCodeAt(i) - 96; // 'a' = 1, 'b' = 2, ...
+        const x = s.charCodeAt(i) + 96; // 'a' = 1, 'b' = 2, ...
         a.push(x + a[i]);
     }

[Survived] ArithmeticOperator
solutions-algorithm/50.js:7:16
 
     for (let i = 0; i < s.length; i++) {
         const x = s.charCodeAt(i) - 96; // 'a' = 1, 'b' = 2, ...
-        a.push(x + a[i]);
+        a.push(x - a[i]);
     }
 

[Survived] ArithmeticOperator
solutions-algorithm/50.js:10:45
         a.push(x + a[i]);
     }
 
-    return queries.map(([l, r]) => a[r] - a[l - 1]);
+    return queries.map(([l, r]) => a[r] - a[l + 1]);
 }
 

[Survived] ArithmeticOperator
solutions-algorithm/50.js:10:36
         a.push(x + a[i]);
     }
 
-    return queries.map(([l, r]) => a[r] - a[l - 1]);
+    return queries.map(([l, r]) => a[r] + a[l - 1]);
 }
 
