[Killed] BlockStatement
solutions-algorithm/7.js:2:29
 // Core logic function
-export function solve(n, s) {
-    let running = [0];
-    let power = 0;
-
-    for (let i = 0; i < n; i++) {
-        if (s[i] !== 0) {
-            running.push(s[i]);
-        } else {
-            if (running.length < 1) {
-                continue;
-            }
-            running.sort((a, b) => a - b);
-            power += running.pop();
-        }
-    }
-
-    return power;
-}
+export function solve(n, s) {}
 
 // Test function with your exact input/output
killedBy: single hero card only
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Survived] ArrayDeclaration
solutions-algorithm/7.js:3:19
 // Core logic function
 export function solve(n, s) {
-    let running = [0];
+    let running = [];
     let power = 0;
 

[Killed] ConditionalExpression
solutions-algorithm/7.js:7:13
     let power = 0;
 
     for (let i = 0; i < n; i++) {
-        if (s[i] !== 0) {
+        if (false) {
             running.push(s[i]);
         } else {
killedBy: bonus then hero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
solutions-algorithm/7.js:7:25
     let power = 0;
 
     for (let i = 0; i < n; i++) {
-        if (s[i] !== 0) {
-            running.push(s[i]);
-        } else {
+        if (s[i] !== 0) {} else {
             if (running.length < 1) {
                 continue;
killedBy: bonus then hero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
solutions-algorithm/7.js:9:16
     for (let i = 0; i < n; i++) {
         if (s[i] !== 0) {
             running.push(s[i]);
-        } else {
-            if (running.length < 1) {
-                continue;
-            }
-            running.sort((a, b) => a - b);
-            power += running.pop();
-        }
+        } else {}
     }
 
killedBy: bonus then hero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
solutions-algorithm/7.js:10:17
         if (s[i] !== 0) {
             running.push(s[i]);
         } else {
-            if (running.length < 1) {
+            if (true) {
                 continue;
             }
killedBy: bonus then hero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
solutions-algorithm/7.js:10:17
         if (s[i] !== 0) {
             running.push(s[i]);
         } else {
-            if (running.length < 1) {
+            if (false) {
                 continue;
             }
killedBy: all hero cards
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: NaN

[Survived] MethodExpression
solutions-algorithm/7.js:13:13
             if (running.length < 1) {
                 continue;
             }
-            running.sort((a, b) => a - b);
+            running;
             power += running.pop();
         }

[Survived] ArithmeticOperator
solutions-algorithm/7.js:13:36
             if (running.length < 1) {
                 continue;
             }
-            running.sort((a, b) => a - b);
+            running.sort((a, b) => a + b);
             power += running.pop();
         }

[Killed] AssignmentOperator
solutions-algorithm/7.js:14:13
                 continue;
             }
             running.sort((a, b) => a - b);
-            power += running.pop();
+            power -= running.pop();
         }
     }
killedBy: bonus then hero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5
