[Killed] BlockStatement
solutions-algorithm/9.js:5:33
 export function solve(original, firstRemoved, secondRemoved) {
     // Frequency map after first removal
     const freq = {};
-    for (const num of original) {
-        freq[num] = (freq[num] || 0) + 1;
-    }
+    for (const num of original) {}
 
     for (const num of firstRemoved) {
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   undefined,

[Killed] ArithmeticOperator
solutions-algorithm/9.js:6:21
     // Frequency map after first removal
     const freq = {};
     for (const num of original) {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (freq[num] || 0) - 1;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   undefined,

[Killed] ConditionalExpression
solutions-algorithm/9.js:6:22
     // Frequency map after first removal
     const freq = {};
     for (const num of original) {
-        freq[num] = (freq[num] || 0) + 1;
+        freq[num] = (true) + 1;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   1,

[Killed] BlockStatement
solutions-algorithm/9.js:9:37
         freq[num] = (freq[num] || 0) + 1;
     }
 
-    for (const num of firstRemoved) {
-        freq[num]--;
-    }
+    for (const num of firstRemoved) {}
 
     let firstMissing;
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   1,

[Killed] UpdateOperator
solutions-algorithm/9.js:10:9
     }
 
     for (const num of firstRemoved) {
-        freq[num]--;
+        freq[num]++;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   1,

[Killed] BlockStatement
solutions-algorithm/9.js:14:29
     }
 
     let firstMissing;
-    for (const key in freq) {
-        if (freq[key] > 0) {
-            firstMissing = +key;
-            break;
-        }
-    }
+    for (const key in freq) {}
 
     // Frequency map after second removal
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   undefined,

[Killed] ConditionalExpression
solutions-algorithm/9.js:15:13
 
     let firstMissing;
     for (const key in freq) {
-        if (freq[key] > 0) {
+        if (true) {
             firstMissing = +key;
             break;
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   1,

[Killed] BlockStatement
solutions-algorithm/9.js:15:28
 
     let firstMissing;
     for (const key in freq) {
-        if (freq[key] > 0) {
-            firstMissing = +key;
-            break;
-        }
+        if (freq[key] > 0) {}
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   undefined,

[Killed] UnaryOperator
solutions-algorithm/9.js:16:28
     let firstMissing;
     for (const key in freq) {
         if (freq[key] > 0) {
-            firstMissing = +key;
+            firstMissing = -key;
             break;
         }
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   -3,

[Killed] BlockStatement
solutions-algorithm/9.js:23:33
 
     // Frequency map after second removal
     const freq2 = {};
-    for (const num of original) {
-        freq2[num] = (freq2[num] || 0) + 1;
-    }
+    for (const num of original) {}
 
     for (const num of secondRemoved) {
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] ArithmeticOperator
solutions-algorithm/9.js:24:22
     // Frequency map after second removal
     const freq2 = {};
     for (const num of original) {
-        freq2[num] = (freq2[num] || 0) + 1;
+        freq2[num] = (freq2[num] || 0) - 1;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] LogicalOperator
solutions-algorithm/9.js:24:23
     // Frequency map after second removal
     const freq2 = {};
     for (const num of original) {
-        freq2[num] = (freq2[num] || 0) + 1;
+        freq2[num] = (freq2[num] && 0) + 1;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] BlockStatement
solutions-algorithm/9.js:27:38
         freq2[num] = (freq2[num] || 0) + 1;
     }
 
-    for (const num of secondRemoved) {
-        freq2[num]--;
-    }
+    for (const num of secondRemoved) {}
 
     freq2[firstMissing]--; // remove the first missing one more time
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] UpdateOperator
solutions-algorithm/9.js:28:9
     }
 
     for (const num of secondRemoved) {
-        freq2[num]--;
+        freq2[num]++;
     }
 
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] UpdateOperator
solutions-algorithm/9.js:31:5
         freq2[num]--;
     }
 
-    freq2[firstMissing]--; // remove the first missing one more time
+    freq2[firstMissing]++; // remove the first missing one more time
 
     let secondMissing;
killedBy: case 3
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    6,
-   8,

[Killed] BlockStatement
solutions-algorithm/9.js:34:30
     freq2[firstMissing]--; // remove the first missing one more time
 
     let secondMissing;
-    for (const key in freq2) {
-        if (freq2[key] > 0) {
-            secondMissing = +key;
-            break;
-        }
-    }
+    for (const key in freq2) {}
 
     return [firstMissing, secondMissing];
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] EqualityOperator
solutions-algorithm/9.js:35:13
 
     let secondMissing;
     for (const key in freq2) {
-        if (freq2[key] > 0) {
+        if (freq2[key] <= 0) {
             secondMissing = +key;
             break;
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] EqualityOperator
solutions-algorithm/9.js:35:13
 
     let secondMissing;
     for (const key in freq2) {
-        if (freq2[key] > 0) {
+        if (freq2[key] >= 0) {
             secondMissing = +key;
             break;
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,

[Killed] UnaryOperator
solutions-algorithm/9.js:36:29
     let secondMissing;
     for (const key in freq2) {
         if (freq2[key] > 0) {
-            secondMissing = +key;
+            secondMissing = -key;
             break;
         }
killedBy: case 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    3,
-   2,
