[Survived] UpdateOperator
solutions-descriptive/10.js:20:28
 
     const h = [];
     let hSize = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i < n; i--) {
         if (deg[i] === 1) {
             h[hSize++] = i;

[Survived] ConditionalExpression
solutions-descriptive/10.js:21:13
     const h = [];
     let hSize = 0;
     for (let i = 0; i < n; i++) {
-        if (deg[i] === 1) {
+        if (true) {
             h[hSize++] = i;
         }

[Survived] EqualityOperator
solutions-descriptive/10.js:36:20
         if (l[u] > r[v]) {
             ans += l[u] - r[v];
             l[v] = r[v];
-        } else if (l[u] > l[v]) {
+        } else if (l[u] >= l[v]) {
             l[v] = l[u];
         }

[Survived] ConditionalExpression
solutions-descriptive/10.js:42:13
 
         mix[v] ^= u;
         deg[v]--;
-        if (deg[v] === 1) {
+        if (true) {
             h[hSize++] = v;
         }
