[Survived] ConditionalExpression
solutions-descriptive/15.js:20:17
         }
 
         if (!middleSkipped) {
-            if (selectedIndex < leftMid) {
+            if (false) {
                 leftMid--;
             } else if (selectedIndex > rightMid) {

[Survived] ConditionalExpression
solutions-descriptive/15.js:22:24
         if (!middleSkipped) {
             if (selectedIndex < leftMid) {
                 leftMid--;
-            } else if (selectedIndex > rightMid) {
+            } else if (true) {
                 rightMid++;
             } else {

[Survived] AssignmentOperator
solutions-descriptive/15.js:41:13
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
         } else {
             visibleElements += countRange(leftMid, rightMid);
-            visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
+            visibleElements -= countRange(1, Math.min(rightBoundary, leftMid - 1));
             visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
         }
