[Survived] ConditionalExpression
solutions-descriptive/16.js:9:13
         sum += x;
         count++;
     }
-    return (sum >= need) ? count : 1000000000;
+    return (true) ? count : 1000000000;
 }
 

[Killed] MethodExpression
solutions-descriptive/16.js:16:13
 function canTransform(s, a, b, ab, ba) {
     let totalA = (s.match(/A/g) || []).length;
     let totalB = (s.match(/B/g) || []).length;
-    let m = Math.max(totalA - a, totalB - b, 0);
+    let m = Math.min(totalA - a, totalB - b, 0);
 
     let totalPairs = 0;
killedBy: tricky: prohibited AA, impossible to split
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NO"
Received: "YES"

[Survived] EqualityOperator
solutions-descriptive/16.js:26:16
     let i = 0;
     while (i < n) {
         let j = i;
-        while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
+        while (j + 1 <= n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
         if (len >= 2) {

[Survived] ConditionalExpression
solutions-descriptive/16.js:26:16
     let i = 0;
     while (i < n) {
         let j = i;
-        while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
+        while (true && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
         if (len >= 2) {

[Survived] ConditionalExpression
solutions-descriptive/16.js:28:13
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
-        if (len >= 2) {
+        if (true) {
             let p = Math.floor(len / 2);
             totalPairs += p;

[Survived] ConditionalExpression
solutions-descriptive/16.js:41:27
         i = j + 1;
     }
 
-    if (totalPairs < m || m > ab + ba) {
+    if (totalPairs < m || false) {
         return "NO";
     }

[Survived] ArithmeticOperator
solutions-descriptive/16.js:57:13
     let dA = minPicks(evenA, needA);
     let dB = minPicks(evenB, needB);
 
-    return (dA + dB) <= availableDrop ? "YES" : "NO";
+    return (dA - dB) <= availableDrop ? "YES" : "NO";
 }
 

[Survived] ConditionalExpression
solutions-descriptive/16.js:57:12
     let dA = minPicks(evenA, needA);
     let dB = minPicks(evenB, needB);
 
-    return (dA + dB) <= availableDrop ? "YES" : "NO";
+    return true ? "YES" : "NO";
 }
 
