[Killed] EqualityOperator
solutions-descriptive/17.js:2:9
 export function solve(totalNodes, totalEdges) {
-    if (2 * totalNodes <= totalEdges) {
+    if (2 * totalNodes > totalEdges) {
         return 'NO';
     }
killedBy: n=2, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "yes"
Received: "no"
