[Survived] EqualityOperator
solutions-descriptive/18.js:4:29
 export function solve(targetRows, targetCols, sourceMatrix, targetMatrix) {
     const MAX_ITER = Math.min(targetRows, targetCols) + 1;
 
-    for (let iteration = 0; iteration < MAX_ITER; iteration++) {
+    for (let iteration = 0; iteration <= MAX_ITER; iteration++) {
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;

[Survived] UpdateOperator
solutions-descriptive/18.js:7:49
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;
-            for (let col = 0; col < targetCols; col++) {
+            for (let col = 0; col < targetCols; col--) {
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
             }

[Survived] UpdateOperator
solutions-descriptive/18.js:12:49
             }
 
             const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
-            for (let col = 0; col < targetCols; col++) {
+            for (let col = 0; col < targetCols; col--) {
                 sourceMatrix[row][col] &= Number(clearMask);
             }

[Survived] EqualityOperator
solutions-descriptive/18.js:17:27
             }
         }
 
-        for (let col = 0; col < targetCols; col++) {
+        for (let col = 0; col <= targetCols; col++) {
             let mismatchMask = 0;
             for (let row = 0; row < targetRows; row++) {

[Survived] UpdateOperator
solutions-descriptive/18.js:30:45
     }
 
     for (let row = 0; row < targetRows; row++) {
-        for (let col = 0; col < targetCols; col++) {
+        for (let col = 0; col < targetCols; col--) {
             if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
                 return "No\n";
