[Survived] ArithmeticOperator
solutions-descriptive/2.js:2:20
 const MOD = 1e9 + 7;
-const MOD_APPROX = ((1 << 20) * (1 << 20)) % MOD;
+const MOD_APPROX = (1 << 20) * (1 << 20) * MOD;
 
 

[Survived] ArithmeticOperator
solutions-descriptive/2.js:2:21
 const MOD = 1e9 + 7;
-const MOD_APPROX = ((1 << 20) * (1 << 20)) % MOD;
+const MOD_APPROX = ((1 << 20) / (1 << 20)) % MOD;
 
 

[Killed] BlockStatement
solutions-descriptive/2.js:5:23
 const MOD_APPROX = ((1 << 20) * (1 << 20)) % MOD;
 
 
-function modAdd(a, b) {
-    return (a + b) % MOD;
-}
+function modAdd(a, b) {}
 
 function modSub(a, b) {
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] ArithmeticOperator
solutions-descriptive/2.js:6:13
 
 
 function modAdd(a, b) {
-    return (a + b) % MOD;
+    return (a - b) % MOD;
 }
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 90

[Killed] ArithmeticOperator
solutions-descriptive/2.js:6:12
 
 
 function modAdd(a, b) {
-    return (a + b) % MOD;
+    return (a + b) * MOD;
 }
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 7.939667457234848e+53

[Killed] BlockStatement
solutions-descriptive/2.js:9:23
     return (a + b) % MOD;
 }
 
-function modSub(a, b) {
-    return modAdd(modAdd(a, -b), MOD);
-}
+function modSub(a, b) {}
 
 function modMul(a, b) {
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: NaN

[Killed] UnaryOperator
solutions-descriptive/2.js:10:29
 }
 
 function modSub(a, b) {
-    return modAdd(modAdd(a, -b), MOD);
+    return modAdd(modAdd(a, +b), MOD);
 }
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 90

[Killed] BlockStatement
solutions-descriptive/2.js:13:23
     return modAdd(modAdd(a, -b), MOD);
 }
 
-function modMul(a, b) {
-
-    let result = (a >> 20) * (b >> 20) * MOD_APPROX +
-        (a & 0xfff00000) * (b & 0xfffff) +
-        (a & 0xfffff) * b;
-    return result % MOD;
-}
+function modMul(a, b) {}
 
 const MAX_N = 3e5;
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
solutions-descriptive/2.js:15:18
 
 function modMul(a, b) {
 
-    let result = (a >> 20) * (b >> 20) * MOD_APPROX +
-        (a & 0xfff00000) * (b & 0xfffff) +
-        (a & 0xfffff) * b;
+    let result = (a >> 20) * (b >> 20) * MOD_APPROX + (a & 0xfff00000) * (b & 0xfffff) - (a & 0xfffff) * b;
     return result % MOD;
 }
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ArithmeticOperator
solutions-descriptive/2.js:15:18
 
 function modMul(a, b) {
 
-    let result = (a >> 20) * (b >> 20) * MOD_APPROX +
+    let result = (a >> 20) / (b >> 20) * MOD_APPROX +
         (a & 0xfff00000) * (b & 0xfffff) +
         (a & 0xfffff) * b;
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/2.js:16:9
 function modMul(a, b) {
 
     let result = (a >> 20) * (b >> 20) * MOD_APPROX +
-        (a & 0xfff00000) * (b & 0xfffff) +
+        (a & 0xfff00000) / (b & 0xfffff) +
         (a & 0xfffff) * b;
     return result % MOD;
killedBy: k equals n: n = 15, k = 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 357
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/2.js:18:12
     let result = (a >> 20) * (b >> 20) * MOD_APPROX +
         (a & 0xfff00000) * (b & 0xfffff) +
         (a & 0xfffff) * b;
-    return result % MOD;
+    return result * MOD;
 }
 
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 1000000007

[Survived] ArithmeticOperator
solutions-descriptive/2.js:22:29
 }
 
 const MAX_N = 3e5;
-const prefixSum = new Array(MAX_N + 1).fill(0);
+const prefixSum = new Array(MAX_N - 1).fill(0);
 const prefixSumSquares = new Array(MAX_N + 1).fill(0);
 

[Killed] ArrayDeclaration
solutions-descriptive/2.js:22:19
 }
 
 const MAX_N = 3e5;
-const prefixSum = new Array(MAX_N + 1).fill(0);
+const prefixSum = new Array().fill(0);
 const prefixSumSquares = new Array(MAX_N + 1).fill(0);
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: NaN

[Survived] ArithmeticOperator
solutions-descriptive/2.js:23:36
 
 const MAX_N = 3e5;
 const prefixSum = new Array(MAX_N + 1).fill(0);
-const prefixSumSquares = new Array(MAX_N + 1).fill(0);
+const prefixSumSquares = new Array(MAX_N - 1).fill(0);
 
 for (let i = 1; i <= MAX_N; i++) {

[Killed] EqualityOperator
solutions-descriptive/2.js:25:17
 const prefixSum = new Array(MAX_N + 1).fill(0);
 const prefixSumSquares = new Array(MAX_N + 1).fill(0);
 
-for (let i = 1; i <= MAX_N; i++) {
+for (let i = 1; i > MAX_N; i++) {
     prefixSum[i] = modAdd(prefixSum[i - 1], i);
     prefixSumSquares[i] = modAdd(prefixSumSquares[i - 1], modMul(i, i));
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 3

[Killed] BlockStatement
solutions-descriptive/2.js:25:34
 const prefixSum = new Array(MAX_N + 1).fill(0);
 const prefixSumSquares = new Array(MAX_N + 1).fill(0);
 
-for (let i = 1; i <= MAX_N; i++) {
-    prefixSum[i] = modAdd(prefixSum[i - 1], i);
-    prefixSumSquares[i] = modAdd(prefixSumSquares[i - 1], modMul(i, i));
-}
+for (let i = 1; i <= MAX_N; i++) {}
 
 function computeRangeSum(n, baseA, left, right) {
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 3

[Killed] ArithmeticOperator
solutions-descriptive/2.js:26:37
 const prefixSumSquares = new Array(MAX_N + 1).fill(0);
 
 for (let i = 1; i <= MAX_N; i++) {
-    prefixSum[i] = modAdd(prefixSum[i - 1], i);
+    prefixSum[i] = modAdd(prefixSum[i + 1], i);
     prefixSumSquares[i] = modAdd(prefixSumSquares[i - 1], modMul(i, i));
 }
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 999999993

[Killed] ArithmeticOperator
solutions-descriptive/2.js:27:51
 
 for (let i = 1; i <= MAX_N; i++) {
     prefixSum[i] = modAdd(prefixSum[i - 1], i);
-    prefixSumSquares[i] = modAdd(prefixSumSquares[i - 1], modMul(i, i));
+    prefixSumSquares[i] = modAdd(prefixSumSquares[i + 1], modMul(i, i));
 }
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 19

[Killed] BlockStatement
solutions-descriptive/2.js:30:49
     prefixSumSquares[i] = modAdd(prefixSumSquares[i - 1], modMul(i, i));
 }
 
-function computeRangeSum(n, baseA, left, right) {
-    const count = right - left + 1;
-    const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left - 1]));
-    const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left - 1]));
-    const term3 = modMul(baseA, count);
-    return modSub(modAdd(term2, term3), term1);
-}
+function computeRangeSum(n, baseA, left, right) {}
 
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/2.js:31:19
 }
 
 function computeRangeSum(n, baseA, left, right) {
-    const count = right - left + 1;
+    const count = right - left - 1;
     const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left - 1]));
     const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left - 1]));
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 4

[Killed] ArithmeticOperator
solutions-descriptive/2.js:31:19
 }
 
 function computeRangeSum(n, baseA, left, right) {
-    const count = right - left + 1;
+    const count = right + left + 1;
     const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left - 1]));
     const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left - 1]));
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 12

[Killed] ArithmeticOperator
solutions-descriptive/2.js:32:82
 
 function computeRangeSum(n, baseA, left, right) {
     const count = right - left + 1;
-    const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left - 1]));
+    const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left + 1]));
     const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left - 1]));
     const term3 = modMul(baseA, count);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 31

[Killed] ArithmeticOperator
solutions-descriptive/2.js:33:64
 function computeRangeSum(n, baseA, left, right) {
     const count = right - left + 1;
     const term1 = modMul(baseA, modSub(prefixSumSquares[right], prefixSumSquares[left - 1]));
-    const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left - 1]));
+    const term2 = modMul(n, modSub(prefixSum[right], prefixSum[left + 1]));
     const term3 = modMul(baseA, count);
     return modSub(modAdd(term2, term3), term1);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 999999985

[Killed] BlockStatement
solutions-descriptive/2.js:39:37
 }
 
 
-function calculateBaseSum(baseP, n) {
-    let number = n;
-    const baseDigits = [];
-
-    while (number > 0) {
-        baseDigits.unshift(number % baseP);
-        number = Math.floor(number / baseP);
-    }
-
-    let result = 0,
-        basePower = 1;
-
-    for (let i = 0; i < baseDigits.length; i++) {
-        result = modAdd(result, modMul(baseDigits[i], basePower));
-        basePower = modMul(basePower, baseP);
-    }
-
-    return result;
-}
+function calculateBaseSum(baseP, n) {}
 
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/2.js:43:12
     let number = n;
     const baseDigits = [];
 
-    while (number > 0) {
+    while (false) {
         baseDigits.unshift(number % baseP);
         number = Math.floor(number / baseP);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] EqualityOperator
solutions-descriptive/2.js:43:12
     let number = n;
     const baseDigits = [];
 
-    while (number > 0) {
+    while (number <= 0) {
         baseDigits.unshift(number % baseP);
         number = Math.floor(number / baseP);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ArithmeticOperator
solutions-descriptive/2.js:44:28
     const baseDigits = [];
 
     while (number > 0) {
-        baseDigits.unshift(number % baseP);
+        baseDigits.unshift(number * baseP);
         number = Math.floor(number / baseP);
     }
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 47

[Timeout] ArithmeticOperator
solutions-descriptive/2.js:45:29
 
     while (number > 0) {
         baseDigits.unshift(number % baseP);
-        number = Math.floor(number / baseP);
+        number = Math.floor(number * baseP);
     }
 

[Killed] ConditionalExpression
solutions-descriptive/2.js:51:21
     let result = 0,
         basePower = 1;
 
-    for (let i = 0; i < baseDigits.length; i++) {
+    for (let i = 0; false; i++) {
         result = modAdd(result, modMul(baseDigits[i], basePower));
         basePower = modMul(basePower, baseP);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] EqualityOperator
solutions-descriptive/2.js:51:21
     let result = 0,
         basePower = 1;
 
-    for (let i = 0; i < baseDigits.length; i++) {
+    for (let i = 0; i >= baseDigits.length; i++) {
         result = modAdd(result, modMul(baseDigits[i], basePower));
         basePower = modMul(basePower, baseP);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
solutions-descriptive/2.js:64:9
     let totalSum = 0;
     let effectiveK;
 
-    if (k > n) {
+    if (false) {
         const surplus = (BigInt(k) - BigInt(n)) % BigInt(MOD);
         totalSum = modMul(Number(surplus), n);
killedBy: Stress test: n = 3, k = 100000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 299995
Received: 669233265

[Killed] BlockStatement
solutions-descriptive/2.js:64:16
     let totalSum = 0;
     let effectiveK;
 
-    if (k > n) {
-        const surplus = (BigInt(k) - BigInt(n)) % BigInt(MOD);
-        totalSum = modMul(Number(surplus), n);
-        effectiveK = n;
-    } else {
+    if (k > n) {} else {
         effectiveK = Number(k);
     }
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/2.js:65:25
     let effectiveK;
 
     if (k > n) {
-        const surplus = (BigInt(k) - BigInt(n)) % BigInt(MOD);
+        const surplus = (BigInt(k) - BigInt(n)) * BigInt(MOD);
         totalSum = modMul(Number(surplus), n);
         effectiveK = n;
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/2.js:65:26
     let effectiveK;
 
     if (k > n) {
-        const surplus = (BigInt(k) - BigInt(n)) % BigInt(MOD);
+        const surplus = (BigInt(k) + BigInt(n)) % BigInt(MOD);
         totalSum = modMul(Number(surplus), n);
         effectiveK = n;
killedBy: Simple case: n = 1, k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] BlockStatement
solutions-descriptive/2.js:68:12
         const surplus = (BigInt(k) - BigInt(n)) % BigInt(MOD);
         totalSum = modMul(Number(surplus), n);
         effectiveK = n;
-    } else {
-        effectiveK = Number(k);
-    }
+    } else {}
 
     let previous = effectiveK;
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] UpdateOperator
solutions-descriptive/2.js:74:26
 
     let previous = effectiveK;
 
-    for (let baseA = 1;; baseA++) {
+    for (let baseA = 1;; baseA--) {
         const lowerBound = Math.floor(n / (baseA + 1)) + 1;
         if (n >= lowerBound * lowerBound) break;
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 93

[Survived] ConditionalExpression
solutions-descriptive/2.js:74:5
 
     let previous = effectiveK;
 
-    for (let baseA = 1;; baseA++) {
-        const lowerBound = Math.floor(n / (baseA + 1)) + 1;
-        if (n >= lowerBound * lowerBound) break;
-
-        if (lowerBound <= effectiveK) {
-            const from = Math.max(2, lowerBound);
-            const to = Math.min(effectiveK, previous);
-            totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
-        }
-
-        previous = lowerBound - 1;
-    }
+    for (let baseA = 1; false; baseA++) {
+  const lowerBound = Math.floor(n / (baseA + 1)) + 1;
+  if (n >= lowerBound * lowerBound) break;
+  if (lowerBound <= effectiveK) {
+    const from = Math.max(2, lowerBound);
+    const to = Math.min(effectiveK, previous);
+    totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
+  }
+  previous = lowerBound - 1;
+}
 
     previous = Math.min(previous, effectiveK);

[Killed] ArithmeticOperator
solutions-descriptive/2.js:75:44
     let previous = effectiveK;
 
     for (let baseA = 1;; baseA++) {
-        const lowerBound = Math.floor(n / (baseA + 1)) + 1;
+        const lowerBound = Math.floor(n / (baseA - 1)) + 1;
         if (n >= lowerBound * lowerBound) break;
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 999999967

[Killed] ArithmeticOperator
solutions-descriptive/2.js:75:28
     let previous = effectiveK;
 
     for (let baseA = 1;; baseA++) {
-        const lowerBound = Math.floor(n / (baseA + 1)) + 1;
+        const lowerBound = Math.floor(n / (baseA + 1)) - 1;
         if (n >= lowerBound * lowerBound) break;
 
killedBy: n = 10, k = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 27
Received: 66

[Timeout] EqualityOperator
solutions-descriptive/2.js:76:13
 
     for (let baseA = 1;; baseA++) {
         const lowerBound = Math.floor(n / (baseA + 1)) + 1;
-        if (n >= lowerBound * lowerBound) break;
+        if (n > lowerBound * lowerBound) break;
 
         if (lowerBound <= effectiveK) {

[Timeout] EqualityOperator
solutions-descriptive/2.js:76:13
 
     for (let baseA = 1;; baseA++) {
         const lowerBound = Math.floor(n / (baseA + 1)) + 1;
-        if (n >= lowerBound * lowerBound) break;
+        if (n < lowerBound * lowerBound) break;
 
         if (lowerBound <= effectiveK) {

[Killed] BlockStatement
solutions-descriptive/2.js:78:39
         const lowerBound = Math.floor(n / (baseA + 1)) + 1;
         if (n >= lowerBound * lowerBound) break;
 
-        if (lowerBound <= effectiveK) {
-            const from = Math.max(2, lowerBound);
-            const to = Math.min(effectiveK, previous);
-            totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
-        }
+        if (lowerBound <= effectiveK) {}
 
         previous = lowerBound - 1;
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] ConditionalExpression
solutions-descriptive/2.js:78:13
         const lowerBound = Math.floor(n / (baseA + 1)) + 1;
         if (n >= lowerBound * lowerBound) break;
 
-        if (lowerBound <= effectiveK) {
+        if (false) {
             const from = Math.max(2, lowerBound);
             const to = Math.min(effectiveK, previous);
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] MethodExpression
solutions-descriptive/2.js:79:26
         if (n >= lowerBound * lowerBound) break;
 
         if (lowerBound <= effectiveK) {
-            const from = Math.max(2, lowerBound);
+            const from = Math.min(2, lowerBound);
             const to = Math.min(effectiveK, previous);
             totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 11

[Killed] MethodExpression
solutions-descriptive/2.js:80:24
 
         if (lowerBound <= effectiveK) {
             const from = Math.max(2, lowerBound);
-            const to = Math.min(effectiveK, previous);
+            const to = Math.max(effectiveK, previous);
             totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
         }
killedBy: k equals n: n = 15, k = 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 357
Received: 999994464

[Killed] ArithmeticOperator
solutions-descriptive/2.js:84:20
             totalSum = modAdd(totalSum, computeRangeSum(n, baseA, from, to));
         }
 
-        previous = lowerBound - 1;
+        previous = lowerBound + 1;
     }
 
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 11

[Killed] MethodExpression
solutions-descriptive/2.js:87:16
         previous = lowerBound - 1;
     }
 
-    previous = Math.min(previous, effectiveK);
+    previous = Math.max(previous, effectiveK);
 
     for (let baseP = 2; baseP <= previous; baseP++) {
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 11

[Killed] BlockStatement
solutions-descriptive/2.js:89:53
 
     previous = Math.min(previous, effectiveK);
 
-    for (let baseP = 2; baseP <= previous; baseP++) {
-        totalSum = modAdd(totalSum, calculateBaseSum(baseP, n));
-    }
+    for (let baseP = 2; baseP <= previous; baseP++) {}
 
     return totalSum;
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5

[Killed] ConditionalExpression
solutions-descriptive/2.js:89:25
 
     previous = Math.min(previous, effectiveK);
 
-    for (let baseP = 2; baseP <= previous; baseP++) {
+    for (let baseP = 2; false; baseP++) {
         totalSum = modAdd(totalSum, calculateBaseSum(baseP, n));
     }
killedBy: Simple base: n = 4, k = 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 5
