[Survived] ConditionalExpression
solutions-descriptive/21.js:7:9
 
 
 for (let i = 2; i <= MAX_P; i++) {
-    if (!sieve[i]) primes.push(i);
+    if (true) primes.push(i);
     for (let p of primes) {
         if (i * p > MAX_P) break;

[Survived] ArithmeticOperator
solutions-descriptive/21.js:11:13
     for (let p of primes) {
         if (i * p > MAX_P) break;
         sieve[i * p] = p;
-        if (i % p === 0) break;
+        if (i * p === 0) break;
     }
 }

[Survived] EqualityOperator
solutions-descriptive/21.js:19:13
 function rad(k) {
     let r = [];
     while (k > 1) {
-        if (sieve[k] === 0) {
+        if (sieve[k] !== 0) {
             r.push(k);
             break;

[Survived] UpdateOperator
solutions-descriptive/21.js:48:35
         V[Math.abs(d)] = 1;
     }
 
-    for (let i = 1; i < a.length; i++) {
+    for (let i = 1; i < a.length; i--) {
         let divs = rad(a[i]);
         let ways = 0;
