[Survived] BlockStatement
solutions-descriptive/22.js:35:23
             }
         }
 
-        if (isEnough) {
-            minimumTime = midTime;
-            high = midTime - 1;
-        } else {
+        if (isEnough) {} else {
             low = midTime + 1;
         }

[Survived] ObjectLiteral
solutions-descriptive/22.js:49:9
 
 function testing_test() {
     const testCases = [
-        {
-            input: [5, 5, 3, [7, 7, 7, 7, 7], [1, 2, 3, 4, 5]],
-            expected: 2
-        },
+        {},
         {
             input: [9, 5, 9, [2, 4, 6, 8, 10, 8, 6, 4, 2], [1, 2, 3, 4, 5, 6, 7, 8, 9]],

[Survived] ObjectLiteral
solutions-descriptive/22.js:53:9
             input: [5, 5, 3, [7, 7, 7, 7, 7], [1, 2, 3, 4, 5]],
             expected: 2
         },
-        {
-            input: [9, 5, 9, [2, 4, 6, 8, 10, 8, 6, 4, 2], [1, 2, 3, 4, 5, 6, 7, 8, 9]],
-            expected: 2
-        },
+        {},
         {
             input: [2, 10, 2, [1, 1], [1, 20]],

[Survived] ObjectLiteral
solutions-descriptive/22.js:57:9
             input: [9, 5, 9, [2, 4, 6, 8, 10, 8, 6, 4, 2], [1, 2, 3, 4, 5, 6, 7, 8, 9]],
             expected: 2
         },
-        {
-            input: [2, 10, 2, [1, 1], [1, 20]],
-            expected: -1
-        },
+        {},
         {
             input: [2, 2, 2, [1000000000, 1], [1, 3]],

[Survived] ObjectLiteral
solutions-descriptive/22.js:61:9
             input: [2, 10, 2, [1, 1], [1, 20]],
             expected: -1
         },
-        {
-            input: [2, 2, 2, [1000000000, 1], [1, 3]],
-            expected: 1000000000
-        }
+        {}
     ];
 

[Survived] UpdateOperator
solutions-descriptive/22.js:67:43
         }
     ];
 
-    for (let i = 0; i < testCases.length; i++) {
+    for (let i = 0; i < testCases.length; i--) {
         const { input, expected } = testCases[i];
         const result = solve(...input);
