[Survived] ConditionalExpression
solutions-descriptive/23.js:6:26
       let xorResult = 0n;
 
       
-      for (let rem = 0n; rem < limit % 4n; rem++) {
+      for (let rem = 0n; false; rem++) {
           xorResult ^= limit - (limit % 4n) + rem;
       }

[Survived] ArithmeticOperator
solutions-descriptive/23.js:6:32
       let xorResult = 0n;
 
       
-      for (let rem = 0n; rem < limit % 4n; rem++) {
+      for (let rem = 0n; rem < limit * 4n; rem++) {
           xorResult ^= limit - (limit % 4n) + rem;
       }

[Survived] ArithmeticOperator
solutions-descriptive/23.js:7:33
 
       
       for (let rem = 0n; rem < limit % 4n; rem++) {
-          xorResult ^= limit - (limit % 4n) + rem;
+          xorResult ^= limit - (limit * 4n) + rem;
       }
 

[Survived] ArithmeticOperator
solutions-descriptive/23.js:7:24
 
       
       for (let rem = 0n; rem < limit % 4n; rem++) {
-          xorResult ^= limit - (limit % 4n) + rem;
+          xorResult ^= limit + limit % 4n + rem;
       }
 

[Survived] ArithmeticOperator
solutions-descriptive/23.js:11:16
       }
 
       
-      limit -= xorConstant + 1n;
+      limit -= xorConstant - 1n;
       if (limit >= 0n) {
           let shiftedCount = limit / (1n << bitIndex);

[Survived] AssignmentOperator
solutions-descriptive/23.js:11:7
       }
 
       
-      limit -= xorConstant + 1n;
+      limit += xorConstant + 1n;
       if (limit >= 0n) {
           let shiftedCount = limit / (1n << bitIndex);

[Survived] ConditionalExpression
solutions-descriptive/23.js:12:11
 
       
       limit -= xorConstant + 1n;
-      if (limit >= 0n) {
+      if (false) {
           let shiftedCount = limit / (1n << bitIndex);
           shiftedCount += 1n;

[Survived] EqualityOperator
solutions-descriptive/23.js:12:11
 
       
       limit -= xorConstant + 1n;
-      if (limit >= 0n) {
+      if (limit < 0n) {
           let shiftedCount = limit / (1n << bitIndex);
           shiftedCount += 1n;

[Survived] ArithmeticOperator
solutions-descriptive/23.js:13:30
       
       limit -= xorConstant + 1n;
       if (limit >= 0n) {
-          let shiftedCount = limit / (1n << bitIndex);
+          let shiftedCount = limit * (1n << bitIndex);
           shiftedCount += 1n;
 

[Survived] AssignmentOperator
solutions-descriptive/23.js:14:11
       limit -= xorConstant + 1n;
       if (limit >= 0n) {
           let shiftedCount = limit / (1n << bitIndex);
-          shiftedCount += 1n;
+          shiftedCount -= 1n;
 
           

[Survived] BlockStatement
solutions-descriptive/23.js:17:62
           shiftedCount += 1n;
 
           
-          for (let rem = 0n; rem < shiftedCount % 4n; rem++) {
-              xorResult ^= (shiftedCount - (shiftedCount % 4n) + rem) * (1n << bitIndex);
-          }
+          for (let rem = 0n; rem < shiftedCount % 4n; rem++) {}
 
           

[Survived] UpdateOperator
solutions-descriptive/23.js:17:55
           shiftedCount += 1n;
 
           
-          for (let rem = 0n; rem < shiftedCount % 4n; rem++) {
+          for (let rem = 0n; rem < shiftedCount % 4n; rem--) {
               xorResult ^= (shiftedCount - (shiftedCount % 4n) + rem) * (1n << bitIndex);
           }

[Survived] ArithmeticOperator
solutions-descriptive/23.js:18:45
 
           
           for (let rem = 0n; rem < shiftedCount % 4n; rem++) {
-              xorResult ^= (shiftedCount - (shiftedCount % 4n) + rem) * (1n << bitIndex);
+              xorResult ^= (shiftedCount - (shiftedCount * 4n) + rem) * (1n << bitIndex);
           }
 

[Survived] ArithmeticOperator
solutions-descriptive/23.js:18:29
 
           
           for (let rem = 0n; rem < shiftedCount % 4n; rem++) {
-              xorResult ^= (shiftedCount - (shiftedCount % 4n) + rem) * (1n << bitIndex);
+              xorResult ^= (shiftedCount + shiftedCount % 4n + rem) * (1n << bitIndex);
           }
 

[Survived] BlockStatement
solutions-descriptive/23.js:22:41
           }
 
           
-          if (shiftedCount % 2n === 1n) {
-              xorResult ^= xorConstant;
-          }
+          if (shiftedCount % 2n === 1n) {}
       }
 

[Survived] ConditionalExpression
solutions-descriptive/23.js:22:15
           }
 
           
-          if (shiftedCount % 2n === 1n) {
+          if (true) {
               xorResult ^= xorConstant;
           }

[Survived] ArithmeticOperator
solutions-descriptive/23.js:30:31
       return xorResult;
   };
 
-  const finalXor = computeXor(right + 1n, bitIndex, xorConstant) ^ computeXor(left, bitIndex, xorConstant);
+  const finalXor = computeXor(right - 1n, bitIndex, xorConstant) ^ computeXor(left, bitIndex, xorConstant);
   return finalXor;
 }
