[Survived] ConditionalExpression
solutions-descriptive/25.js:32:17
             result.push(perm.join(' '));
             result.push(perm.map(x => n + 1 - x).join(' '));
             count += 2;
-            if (count === k) break;
+            if (false) break;
         } while (nextPermutation(perm));
     } else {

[Survived] UpdateOperator
solutions-descriptive/25.js:43:38
         let mid = Math.floor(n / 2);
         let value = 1;
 
-        for (let i = mid + 1; i < n; i++) initialSet[1][i] = value++;
+        for (let i = mid + 1; i < n; i--) initialSet[1][i] = value++;
         for (let i = 0; i <= mid; i++) initialSet[1][i] = value++;
 

[Survived] UpdateOperator
solutions-descriptive/25.js:49:38
         value = 1;
         for (let i = mid; i >= 0; i--) initialSet[2][i] = value, value += 2;
         value = 2;
-        for (let i = n - 1; i > mid; i--) initialSet[2][i] = value, value += 2;
+        for (let i = n - 1; i > mid; i++) initialSet[2][i] = value, value += 2;
 
         for (let i = 0; i < 3; i++) {

[Survived] ConditionalExpression
solutions-descriptive/25.js:57:17
 
         let count = 3;
         outer: do {
-            if (count === k) break;
+            if (false) break;
 
             for (let i = 0; i < 3; i++) {

[Survived] BlockStatement
solutions-descriptive/25.js:59:41
         outer: do {
             if (count === k) break;
 
-            for (let i = 0; i < 3; i++) {
-                let matchOriginal = basePerm.every((val, idx) => val === initialSet[i][idx]);
-                let matchInverted = basePerm.every((val, idx) => (n + 1 - val) === initialSet[i][idx]);
-
-                if (matchOriginal || matchInverted) continue outer;
-            }
+            for (let i = 0; i < 3; i++) {}
 
             result.push(basePerm.join(' '));

[Survived] UpdateOperator
solutions-descriptive/25.js:77:48
 
 function nextPermutation(array) {
     let i = -1;
-    for (let idx = array.length - 2; idx >= 0; idx--) {
+    for (let idx = array.length - 2; idx >= 0; idx++) {
         if (array[idx] < array[idx + 1]) {
             i = idx;
