[Killed] ConditionalExpression
solutions-descriptive/26.js:7:13
 
    
     for (let i = 0; i < length; i++) {
-        if (binaryString[i] === binaryString[i - 1]) {
+        if (true) {
             currentSegment.count++;
             currentSegment.right = i;
killedBy: n=1, s=1
statusReason: TypeError: Cannot read properties of undefined (reading 'count')

[Killed] EqualityOperator
solutions-descriptive/26.js:7:13
 
    
     for (let i = 0; i < length; i++) {
-        if (binaryString[i] === binaryString[i - 1]) {
+        if (binaryString[i] !== binaryString[i - 1]) {
             currentSegment.count++;
             currentSegment.right = i;
killedBy: n=1, s=1
statusReason: TypeError: Cannot read properties of undefined (reading 'count')

[Killed] LogicalOperator
solutions-descriptive/26.js:17:9
     }
 
     
-    if (currentSegment.count === length && binaryString[0] === '0') {
+    if (currentSegment.count === length || binaryString[0] === '0') {
         return arithmeticSum(1, length - 1);
     }
killedBy: n=1, s=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
solutions-descriptive/26.js:31:17
         if (binaryString[segment.left] === '1') {
             let tempSum;
 
-            if (segment.count > 1) {
+            if (true) {
                 tempSum = 1 + Math.max(
                     computeTailSum(segments[i - 1], false),

[Killed] ArithmeticOperator
solutions-descriptive/26.js:58:17
 
     
     function arithmeticSum(start, count) {
-        return (start + start + count - 1) * count / 2;
+        return (start + start + count + 1) * count / 2;
     }
 }
killedBy: n=2, s=01
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3
