[Killed] BlockStatement
solutions-descriptive/29.js:1:39
-function maxOperations(start, target) {
-    let temp = start;
-    while (temp % 2 === 0 && Math.floor(temp / 2) !== target) {
-        temp = Math.floor(temp / 2);
-    }
-
-    if (temp % 2 === 1) {
-        return Math.floor(start / temp);
-    }
-
-    let smallestOdd = temp;
-    while (smallestOdd % 2 === 0) {
-        smallestOdd = Math.floor(smallestOdd / 2);
-    }
-
-    return 1 + Math.floor((start - temp) / smallestOdd);
-}
+function maxOperations(start, target) {}
 
 //canReachTargetOperations -> solve
killedBy: single element, minimal k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/29.js:3:12
 function maxOperations(start, target) {
     let temp = start;
-    while (temp % 2 === 0 && Math.floor(temp / 2) !== target) {
+    while (false) {
         temp = Math.floor(temp / 2);
     }
killedBy: n=2, k=3, two elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ArithmeticOperator
solutions-descriptive/29.js:3:12
 function maxOperations(start, target) {
     let temp = start;
-    while (temp % 2 === 0 && Math.floor(temp / 2) !== target) {
+    while (temp * 2 === 0 && Math.floor(temp / 2) !== target) {
         temp = Math.floor(temp / 2);
     }
killedBy: n=2, k=3, two elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Timeout] ArithmeticOperator
solutions-descriptive/29.js:4:27
 function maxOperations(start, target) {
     let temp = start;
     while (temp % 2 === 0 && Math.floor(temp / 2) !== target) {
-        temp = Math.floor(temp / 2);
+        temp = Math.floor(temp * 2);
     }
 

[Survived] ArithmeticOperator
solutions-descriptive/29.js:7:9
         temp = Math.floor(temp / 2);
     }
 
-    if (temp % 2 === 1) {
+    if (temp * 2 === 1) {
         return Math.floor(start / temp);
     }

[Survived] EqualityOperator
solutions-descriptive/29.js:7:9
         temp = Math.floor(temp / 2);
     }
 
-    if (temp % 2 === 1) {
+    if (temp % 2 !== 1) {
         return Math.floor(start / temp);
     }

[Killed] ArithmeticOperator
solutions-descriptive/29.js:8:27
     }
 
     if (temp % 2 === 1) {
-        return Math.floor(start / temp);
+        return Math.floor(start * temp);
     }
 
killedBy: single element, excessive k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NO"
Received: "YES"

[Survived] ArithmeticOperator
solutions-descriptive/29.js:12:12
     }
 
     let smallestOdd = temp;
-    while (smallestOdd % 2 === 0) {
+    while (smallestOdd * 2 === 0) {
         smallestOdd = Math.floor(smallestOdd / 2);
     }

[Survived] ConditionalExpression
solutions-descriptive/29.js:12:12
     }
 
     let smallestOdd = temp;
-    while (smallestOdd % 2 === 0) {
+    while (false) {
         smallestOdd = Math.floor(smallestOdd / 2);
     }

[Survived] ArithmeticOperator
solutions-descriptive/29.js:13:34
 
     let smallestOdd = temp;
     while (smallestOdd % 2 === 0) {
-        smallestOdd = Math.floor(smallestOdd / 2);
+        smallestOdd = Math.floor(smallestOdd * 2);
     }
 

[Survived] ArithmeticOperator
solutions-descriptive/29.js:16:12
         smallestOdd = Math.floor(smallestOdd / 2);
     }
 
-    return 1 + Math.floor((start - temp) / smallestOdd);
+    return 1 - Math.floor((start - temp) / smallestOdd);
 }
 

[Survived] ArithmeticOperator
solutions-descriptive/29.js:16:28
         smallestOdd = Math.floor(smallestOdd / 2);
     }
 
-    return 1 + Math.floor((start - temp) / smallestOdd);
+    return 1 + Math.floor((start + temp) / smallestOdd);
 }
 

[Killed] BlockStatement
solutions-descriptive/29.js:20:37
 }
 
 //canReachTargetOperations -> solve
-export function solve(n, k, values) {
-    const prefix = new Array(n).fill(0);
-    for (let i = 1; i < n; i++) {
-        prefix[i] = prefix[i - 1] + maxOperations(values[i - 1], values[i]);
-    }
-
-    const suffix = new Array(n).fill(0);
-    for (let i = n - 2; i >= 0; i--) {
-        suffix[i] = suffix[i + 1] + maxOperations(values[i + 1], values[i]);
-    }
-
-    for (let i = 0; i < n; i++) {
-        const totalOps = maxOperations(values[i], 0) + prefix[i] + suffix[i];
-        if (totalOps >= k) {
-            return "YES";  // string
-        }
-    }
-
-    return "NO";  // string
-}
+export function solve(n, k, values) {}
 
 
killedBy: single element, minimal k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: undefined

[Timeout] UpdateOperator
solutions-descriptive/29.js:22:28
 //canReachTargetOperations -> solve
 export function solve(n, k, values) {
     const prefix = new Array(n).fill(0);
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; i < n; i--) {
         prefix[i] = prefix[i - 1] + maxOperations(values[i - 1], values[i]);
     }

[Timeout] EqualityOperator
solutions-descriptive/29.js:22:21
 //canReachTargetOperations -> solve
 export function solve(n, k, values) {
     const prefix = new Array(n).fill(0);
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; i >= n; i++) {
         prefix[i] = prefix[i - 1] + maxOperations(values[i - 1], values[i]);
     }

[Killed] ArithmeticOperator
solutions-descriptive/29.js:23:21
 export function solve(n, k, values) {
     const prefix = new Array(n).fill(0);
     for (let i = 1; i < n; i++) {
-        prefix[i] = prefix[i - 1] + maxOperations(values[i - 1], values[i]);
+        prefix[i] = prefix[i - 1] - maxOperations(values[i - 1], values[i]);
     }
 
killedBy: n=3, k=5, three elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/29.js:23:28
 export function solve(n, k, values) {
     const prefix = new Array(n).fill(0);
     for (let i = 1; i < n; i++) {
-        prefix[i] = prefix[i - 1] + maxOperations(values[i - 1], values[i]);
+        prefix[i] = prefix[i + 1] + maxOperations(values[i - 1], values[i]);
     }
 

[Killed] ArithmeticOperator
solutions-descriptive/29.js:27:18
     }
 
     const suffix = new Array(n).fill(0);
-    for (let i = n - 2; i >= 0; i--) {
+    for (let i = n + 2; i >= 0; i--) {
         suffix[i] = suffix[i + 1] + maxOperations(values[i + 1], values[i]);
     }
killedBy: single element, minimal k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ConditionalExpression
solutions-descriptive/29.js:27:25
     }
 
     const suffix = new Array(n).fill(0);
-    for (let i = n - 2; i >= 0; i--) {
+    for (let i = n - 2; false; i--) {
         suffix[i] = suffix[i + 1] + maxOperations(values[i + 1], values[i]);
     }

[Survived] ArithmeticOperator
solutions-descriptive/29.js:28:58
 
     const suffix = new Array(n).fill(0);
     for (let i = n - 2; i >= 0; i--) {
-        suffix[i] = suffix[i + 1] + maxOperations(values[i + 1], values[i]);
+        suffix[i] = suffix[i + 1] + maxOperations(values[i - 1], values[i]);
     }
 

[Survived] ArithmeticOperator
solutions-descriptive/29.js:28:21
 
     const suffix = new Array(n).fill(0);
     for (let i = n - 2; i >= 0; i--) {
-        suffix[i] = suffix[i + 1] + maxOperations(values[i + 1], values[i]);
+        suffix[i] = suffix[i + 1] - maxOperations(values[i + 1], values[i]);
     }
 

[Killed] ArithmeticOperator
solutions-descriptive/29.js:32:26
     }
 
     for (let i = 0; i < n; i++) {
-        const totalOps = maxOperations(values[i], 0) + prefix[i] + suffix[i];
+        const totalOps = maxOperations(values[i], 0) - prefix[i] + suffix[i];
         if (totalOps >= k) {
             return "YES";  // string
killedBy: n=3, k=5, three elements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/29.js:32:26
     }
 
     for (let i = 0; i < n; i++) {
-        const totalOps = maxOperations(values[i], 0) + prefix[i] + suffix[i];
+        const totalOps = maxOperations(values[i], 0) + prefix[i] - suffix[i];
         if (totalOps >= k) {
             return "YES";  // string

[Killed] ConditionalExpression
solutions-descriptive/29.js:33:13
 
     for (let i = 0; i < n; i++) {
         const totalOps = maxOperations(values[i], 0) + prefix[i] + suffix[i];
-        if (totalOps >= k) {
+        if (false) {
             return "YES";  // string
         }
killedBy: single element, minimal k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/29.js:33:13
 
     for (let i = 0; i < n; i++) {
         const totalOps = maxOperations(values[i], 0) + prefix[i] + suffix[i];
-        if (totalOps >= k) {
+        if (true) {
             return "YES";  // string
         }
killedBy: single element, excessive k
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NO"
Received: "YES"
