[Survived] BlockStatement
solutions-descriptive/33.js:1:25
-export function solve() {
-    const a = Kattio.nextNumber()
-    const b = Kattio.nextNumber()
-    const c = Kattio.nextNumber()
-    const d = Kattio.nextNumber()
-
-    const q1 = [],
-        q2 = []
-    divide(q1, a, b, 0, 1 << 20)
-    divide(q2, c, d, 0, 1 << 20)
-
-    let s = 0
-    for (let x of q1) {
-        for (let y of q2) {
-            const g = gcd(x, y)
-            s += (x / g) * (y / g)
-        }
-    }
-    return s
-}
+export function solve() {}
 
 function divide(q, l, r, L, R) {

[Survived] ArrayDeclaration
solutions-descriptive/33.js:8:14
     const d = Kattio.nextNumber()
 
     const q1 = [],
-        q2 = []
+        q2 = ["Stryker was here"]
     divide(q1, a, b, 0, 1 << 20)
     divide(q2, c, d, 0, 1 << 20)

[Survived] BlockStatement
solutions-descriptive/33.js:13:23
     divide(q2, c, d, 0, 1 << 20)
 
     let s = 0
-    for (let x of q1) {
-        for (let y of q2) {
-            const g = gcd(x, y)
-            s += (x / g) * (y / g)
-        }
-    }
+    for (let x of q1) {}
     return s
 }

[Survived] BlockStatement
solutions-descriptive/33.js:14:27
 
     let s = 0
     for (let x of q1) {
-        for (let y of q2) {
-            const g = gcd(x, y)
-            s += (x / g) * (y / g)
-        }
+        for (let y of q2) {}
     }
     return s

[Survived] ArithmeticOperator
solutions-descriptive/33.js:16:29
     for (let x of q1) {
         for (let y of q2) {
             const g = gcd(x, y)
-            s += (x / g) * (y / g)
+            s += (x / g) * (y * g)
         }
     }

[Survived] ArithmeticOperator
solutions-descriptive/33.js:16:19
     for (let x of q1) {
         for (let y of q2) {
             const g = gcd(x, y)
-            s += (x / g) * (y / g)
+            s += (x * g) * (y / g)
         }
     }

[Survived] BlockStatement
solutions-descriptive/33.js:22:32
     return s
 }
 
-function divide(q, l, r, L, R) {
-    if (l <= L && r >= R) {
-        q.push(R - L)
-        return
-    }
-    const m = (L + R) / 2
-    if (l < m) divide(q, l, r, L, m)
-    if (r > m) divide(q, l, r, m, R)
-}
+function divide(q, l, r, L, R) {}
 
 function gcd(a, b) {

[Survived] LogicalOperator
solutions-descriptive/33.js:23:9
 }
 
 function divide(q, l, r, L, R) {
-    if (l <= L && r >= R) {
+    if (l <= L || r >= R) {
         q.push(R - L)
         return

[Survived] BlockStatement
solutions-descriptive/33.js:23:27
 }
 
 function divide(q, l, r, L, R) {
-    if (l <= L && r >= R) {
-        q.push(R - L)
-        return
-    }
+    if (l <= L && r >= R) {}
     const m = (L + R) / 2
     if (l < m) divide(q, l, r, L, m)

[Survived] ArithmeticOperator
solutions-descriptive/33.js:24:16
 
 function divide(q, l, r, L, R) {
     if (l <= L && r >= R) {
-        q.push(R - L)
+        q.push(R + L)
         return
     }

[Survived] ArithmeticOperator
solutions-descriptive/33.js:27:15
         q.push(R - L)
         return
     }
-    const m = (L + R) / 2
+    const m = (L + R) * 2
     if (l < m) divide(q, l, r, L, m)
     if (r > m) divide(q, l, r, m, R)

[Survived] ArithmeticOperator
solutions-descriptive/33.js:27:16
         q.push(R - L)
         return
     }
-    const m = (L + R) / 2
+    const m = (L - R) / 2
     if (l < m) divide(q, l, r, L, m)
     if (r > m) divide(q, l, r, m, R)

[Survived] ConditionalExpression
solutions-descriptive/33.js:28:9
         return
     }
     const m = (L + R) / 2
-    if (l < m) divide(q, l, r, L, m)
+    if (false) divide(q, l, r, L, m)
     if (r > m) divide(q, l, r, m, R)
 }

[Survived] EqualityOperator
solutions-descriptive/33.js:28:9
         return
     }
     const m = (L + R) / 2
-    if (l < m) divide(q, l, r, L, m)
+    if (l <= m) divide(q, l, r, L, m)
     if (r > m) divide(q, l, r, m, R)
 }

[Survived] ConditionalExpression
solutions-descriptive/33.js:29:9
     }
     const m = (L + R) / 2
     if (l < m) divide(q, l, r, L, m)
-    if (r > m) divide(q, l, r, m, R)
+    if (false) divide(q, l, r, m, R)
 }
 

[Survived] EqualityOperator
solutions-descriptive/33.js:29:9
     }
     const m = (L + R) / 2
     if (l < m) divide(q, l, r, L, m)
-    if (r > m) divide(q, l, r, m, R)
+    if (r <= m) divide(q, l, r, m, R)
 }
 

[Survived] BlockStatement
solutions-descriptive/33.js:32:20
     if (r > m) divide(q, l, r, m, R)
 }
 
-function gcd(a, b) {
-    if (a === 0) return b
-    if (b === 0) return a
-    while (a) {
-        const r = b % a
-        b = a
-        a = r
-    }
-    return b
-}
+function gcd(a, b) {}
 
 // function testing_test() {

[Survived] EqualityOperator
solutions-descriptive/33.js:33:9
 }
 
 function gcd(a, b) {
-    if (a === 0) return b
+    if (a !== 0) return b
     if (b === 0) return a
     while (a) {

[Survived] ConditionalExpression
solutions-descriptive/33.js:33:9
 }
 
 function gcd(a, b) {
-    if (a === 0) return b
+    if (false) return b
     if (b === 0) return a
     while (a) {

[Survived] ConditionalExpression
solutions-descriptive/33.js:34:9
 
 function gcd(a, b) {
     if (a === 0) return b
-    if (b === 0) return a
+    if (false) return a
     while (a) {
         const r = b % a

[Survived] ConditionalExpression
solutions-descriptive/33.js:34:9
 
 function gcd(a, b) {
     if (a === 0) return b
-    if (b === 0) return a
+    if (true) return a
     while (a) {
         const r = b % a

[Survived] ConditionalExpression
solutions-descriptive/33.js:35:12
 function gcd(a, b) {
     if (a === 0) return b
     if (b === 0) return a
-    while (a) {
+    while (false) {
         const r = b % a
         b = a

[Survived] BlockStatement
solutions-descriptive/33.js:35:15
 function gcd(a, b) {
     if (a === 0) return b
     if (b === 0) return a
-    while (a) {
-        const r = b % a
-        b = a
-        a = r
-    }
+    while (a) {}
     return b
 }

[Survived] ArithmeticOperator
solutions-descriptive/33.js:36:19
     if (a === 0) return b
     if (b === 0) return a
     while (a) {
-        const r = b % a
+        const r = b * a
         b = a
         a = r

[Survived] ArrayDeclaration
solutions-descriptive/33.js:66:12
 
 // Mock Kattio for testing
 const Kattio = {
-    input: [],
+    input: ["Stryker was here"],
     index: 0,
     setInput(arr) {

[Survived] BlockStatement
solutions-descriptive/33.js:68:19
 const Kattio = {
     input: [],
     index: 0,
-    setInput(arr) {
-        this.input = arr;
-        this.index = 0;
-    },
+    setInput(arr) {},
     nextNumber() {
         return this.input[this.index++];

[Survived] BlockStatement
solutions-descriptive/33.js:72:18
         this.input = arr;
         this.index = 0;
     },
-    nextNumber() {
-        return this.input[this.index++];
-    },
+    nextNumber() {},
 };
 

[Survived] UpdateOperator
solutions-descriptive/33.js:73:27
         this.index = 0;
     },
     nextNumber() {
-        return this.input[this.index++];
+        return this.input[this.index--];
     },
 };
