[Survived] ConditionalExpression
solutions-descriptive/34.js:9:13
 
     for (let i = 0; i < setX.length; i++) {
         totalX += setX[i];
-        if (setX[i] > peakX) peakX = setX[i];
+        if (true) peakX = setX[i];
     }
 

[Survived] EqualityOperator
solutions-descriptive/34.js:17:9
         if (setY[j] > peakY) peakY = setY[j];
     }
 
-    if (totalX < totalY) return "-1";
+    if (totalX <= totalY) return "-1";
 
     let diffVal = totalX - totalY;

[Survived] ConditionalExpression
solutions-descriptive/34.js:23:9
     setX.sort((a, b) => a - b);
     setY.sort((a, b) => a - b);
 
-    if (diffVal === 0) {
+    if (false) {
         return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
     }

[Survived] BlockStatement
solutions-descriptive/34.js:23:24
     setX.sort((a, b) => a - b);
     setY.sort((a, b) => a - b);
 
-    if (diffVal === 0) {
-        return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
-    }
+    if (diffVal === 0) {}
 
     let factors = [];

[Survived] ArithmeticOperator
solutions-descriptive/34.js:24:69
     setY.sort((a, b) => a - b);
 
     if (diffVal === 0) {
-        return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
+        return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX - 1 : "-1") : "-1";
     }
 

[Survived] ArithmeticOperator
solutions-descriptive/34.js:28:23
     }
 
     let factors = [];
-    for (let fac = 1; fac * fac <= diffVal; fac++) {
+    for (let fac = 1; fac / fac <= diffVal; fac++) {
         if (diffVal % fac === 0) {
             factors.push(fac);

[Survived] ConditionalExpression
solutions-descriptive/34.js:29:13
 
     let factors = [];
     for (let fac = 1; fac * fac <= diffVal; fac++) {
-        if (diffVal % fac === 0) {
+        if (true) {
             factors.push(fac);
             if (fac * fac !== diffVal) factors.push(diffVal / fac);

[Survived] ConditionalExpression
solutions-descriptive/34.js:31:17
     for (let fac = 1; fac * fac <= diffVal; fac++) {
         if (diffVal % fac === 0) {
             factors.push(fac);
-            if (fac * fac !== diffVal) factors.push(diffVal / fac);
+            if (true) factors.push(diffVal / fac);
         }
     }

[Survived] EqualityOperator
solutions-descriptive/34.js:38:68
     factors.sort((a, b) => a - b);
 
     for (let candidateFactor of factors) {
-        if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
+        if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor >= 1000000000) continue;
 
         let remainders = [];

[Survived] BooleanLiteral
solutions-descriptive/34.js:56:45
 }
 
 function arraysMatch(arr1, arr2) {
-    if (arr1.length !== arr2.length) return false;
+    if (arr1.length !== arr2.length) return true;
     for (let i = 0; i < arr1.length; i++) {
         if (arr1[i] !== arr2[i]) return false;

[Survived] ConditionalExpression
solutions-descriptive/34.js:56:9
 }
 
 function arraysMatch(arr1, arr2) {
-    if (arr1.length !== arr2.length) return false;
+    if (false) return false;
     for (let i = 0; i < arr1.length; i++) {
         if (arr1[i] !== arr2[i]) return false;

[Survived] UpdateOperator
solutions-descriptive/34.js:57:38
 
 function arraysMatch(arr1, arr2) {
     if (arr1.length !== arr2.length) return false;
-    for (let i = 0; i < arr1.length; i++) {
+    for (let i = 0; i < arr1.length; i--) {
         if (arr1[i] !== arr2[i]) return false;
     }
