[Survived] ArithmeticOperator
solutions-descriptive/36.js:13:13
 }
 
 function mul(a, b) {
-    let r = (a >> 20) * (b >> 20) * MOD_CUT +
+    let r = (a >> 20) * (b >> 20) / MOD_CUT +
         (a & 0xfff00000) * (b & 0xfffff) +
         (a & 0xfffff) * b;

[Survived] ConditionalExpression
solutions-descriptive/36.js:38:26
 
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
-        const isBorder = x === 1 || x === n || y === 1 || y === m;
+        const isBorder = true;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);

[Survived] ConditionalExpression
solutions-descriptive/36.js:39:51
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
-        const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
+        const isCorner = (x === 1 && y === 1) || (false) ||
             (x === n && y === 1) || (x === n && y === m);
         if (isBorder && !isCorner) {

[Survived] ConditionalExpression
solutions-descriptive/36.js:40:14
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
-            (x === n && y === 1) || (x === n && y === m);
+            (false) || (x === n && y === m);
         if (isBorder && !isCorner) {
             count++;
