[Survived] ArithmeticOperator
solutions-descriptive/38.js:1:11
-const N = 2e6 + 5;
+const N = 2e6 - 5;
 const offset = 1e6;
 const sum = new Array(N).fill(0);

[Survived] BlockStatement
solutions-descriptive/38.js:5:20
 const offset = 1e6;
 const sum = new Array(N).fill(0);
 
-function lowbit(x) {
-    return x & -x;
-}
+function lowbit(x) {}
 
 function add(x) {

[Survived] UnaryOperator
solutions-descriptive/38.js:6:16
 const sum = new Array(N).fill(0);
 
 function lowbit(x) {
-    return x & -x;
+    return x & +x;
 }
 

[Survived] BlockStatement
solutions-descriptive/38.js:9:17
     return x & -x;
 }
 
-function add(x) {
-    while (x < N) {
-        sum[x]++;
-        x += lowbit(x);
-    }
-}
+function add(x) {}
 
 function ask(x) {

[Survived] EqualityOperator
solutions-descriptive/38.js:10:12
 }
 
 function add(x) {
-    while (x < N) {
+    while (x <= N) {
         sum[x]++;
         x += lowbit(x);

[Survived] BlockStatement
solutions-descriptive/38.js:10:19
 }
 
 function add(x) {
-    while (x < N) {
-        sum[x]++;
-        x += lowbit(x);
-    }
+    while (x < N) {}
 }
 

[Survived] UpdateOperator
solutions-descriptive/38.js:11:9
 
 function add(x) {
     while (x < N) {
-        sum[x]++;
+        sum[x]--;
         x += lowbit(x);
     }

[Survived] AssignmentOperator
solutions-descriptive/38.js:12:9
 function add(x) {
     while (x < N) {
         sum[x]++;
-        x += lowbit(x);
+        x -= lowbit(x);
     }
 }

[Survived] BlockStatement
solutions-descriptive/38.js:16:17
     }
 }
 
-function ask(x) {
-    let answer = 0;
-    while (x > 0) {
-        answer += sum[x];
-        x -= lowbit(x);
-    }
-    return answer;
-}
+function ask(x) {}
 
 export function solve(s) {

[Survived] EqualityOperator
solutions-descriptive/38.js:18:12
 
 function ask(x) {
     let answer = 0;
-    while (x > 0) {
+    while (x <= 0) {
         answer += sum[x];
         x -= lowbit(x);

[Survived] BlockStatement
solutions-descriptive/38.js:18:19
 
 function ask(x) {
     let answer = 0;
-    while (x > 0) {
-        answer += sum[x];
-        x -= lowbit(x);
-    }
+    while (x > 0) {}
     return answer;
 }

[Survived] AssignmentOperator
solutions-descriptive/38.js:19:9
 function ask(x) {
     let answer = 0;
     while (x > 0) {
-        answer += sum[x];
+        answer -= sum[x];
         x -= lowbit(x);
     }

[Survived] AssignmentOperator
solutions-descriptive/38.js:20:9
     let answer = 0;
     while (x > 0) {
         answer += sum[x];
-        x -= lowbit(x);
+        x += lowbit(x);
     }
     return answer;

[Survived] BlockStatement
solutions-descriptive/38.js:29:32
     const n = s.length;
     const a = [];
 
-    for (const character of s) {
-        if (character === '0') {
-            a.push(1);
-        } else {
-            a.push(-3);
-        }
-    }
+    for (const character of s) {}
 
     let answer = 0;

[Survived] BlockStatement
solutions-descriptive/38.js:30:32
     const a = [];
 
     for (const character of s) {
-        if (character === '0') {
-            a.push(1);
-        } else {
+        if (character === '0') {} else {
             a.push(-3);
         }

[Survived] EqualityOperator
solutions-descriptive/38.js:30:13
     const a = [];
 
     for (const character of s) {
-        if (character === '0') {
+        if (character !== '0') {
             a.push(1);
         } else {

[Survived] BlockStatement
solutions-descriptive/38.js:32:16
     for (const character of s) {
         if (character === '0') {
             a.push(1);
-        } else {
-            a.push(-3);
-        }
+        } else {}
     }
 

[Survived] UnaryOperator
solutions-descriptive/38.js:33:20
         if (character === '0') {
             a.push(1);
         } else {
-            a.push(-3);
+            a.push(+3);
         }
     }

[Survived] ArithmeticOperator
solutions-descriptive/38.js:39:9
 
     let answer = 0;
     let pre_sum = 0;
-    add(pre_sum + offset);
+    add(pre_sum - offset);
 
     const count = new Map();

[Survived] AssignmentOperator
solutions-descriptive/38.js:45:9
     count.set(0, 1);
 
     for (let i = 0; i < n; i++) {
-        pre_sum += a[i];
+        pre_sum -= a[i];
         answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
         count.set(pre_sum, (count.get(pre_sum) || 0) + 1);

[Survived] ArithmeticOperator
solutions-descriptive/38.js:46:30
 
     for (let i = 0; i < n; i++) {
         pre_sum += a[i];
-        answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
+        answer += (count.get(pre_sum - 1) || 0) + ask(pre_sum - 2 + offset);
         count.set(pre_sum, (count.get(pre_sum) || 0) + 1);
         add(pre_sum + offset);

[Survived] ArithmeticOperator
solutions-descriptive/38.js:46:55
 
     for (let i = 0; i < n; i++) {
         pre_sum += a[i];
-        answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
+        answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 - offset);
         count.set(pre_sum, (count.get(pre_sum) || 0) + 1);
         add(pre_sum + offset);

[Survived] ConditionalExpression
solutions-descriptive/38.js:47:29
     for (let i = 0; i < n; i++) {
         pre_sum += a[i];
         answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
-        count.set(pre_sum, (count.get(pre_sum) || 0) + 1);
+        count.set(pre_sum, (true) + 1);
         add(pre_sum + offset);
     }

[Survived] LogicalOperator
solutions-descriptive/38.js:47:29
     for (let i = 0; i < n; i++) {
         pre_sum += a[i];
         answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
-        count.set(pre_sum, (count.get(pre_sum) || 0) + 1);
+        count.set(pre_sum, (count.get(pre_sum) && 0) + 1);
         add(pre_sum + offset);
     }

[Survived] ArithmeticOperator
solutions-descriptive/38.js:48:13
         pre_sum += a[i];
         answer += (count.get(pre_sum + 1) || 0) + ask(pre_sum - 2 + offset);
         count.set(pre_sum, (count.get(pre_sum) || 0) + 1);
-        add(pre_sum + offset);
+        add(pre_sum - offset);
     }
 
