[Killed] LogicalOperator
solutions-descriptive/39.js:14:13
         }
 
 
-        if (array[i] !== 0 || i === firstZeroIndex) {
+        if (array[i] !== 0 && i === firstZeroIndex) {
             seen.add(array[i]);
             while (seen.has(mex)) {
killedBy: all different consecutive numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3
