[Survived] UpdateOperator
solutions-descriptive/4.js:8:65
     let currentScore;
 
 
-    for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
+    for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength--) {
         for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
             const end = start + subarrayLength - 1;

[Survived] ArithmeticOperator
solutions-descriptive/4.js:15:32
 
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
-                currentScore = array[start] * array[end] * array[splitPoint] +
-                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
+                currentScore = array[start] * array[end] * array[splitPoint] - (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);

[Survived] ArithmeticOperator
solutions-descriptive/4.js:16:35
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
-                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
+                    (start + 1 <= splitPoint + 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);

[Survived] ConditionalExpression
solutions-descriptive/4.js:17:22
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
-                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
+                    (false ? dpTable[splitPoint + 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 

[Survived] ConditionalExpression
solutions-descriptive/4.js:21:62
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint + 1][end] : 0);
+                currentScore = dpTable[start][splitPoint] + (true ? dpTable[splitPoint + 1][end] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 

[Survived] ArithmeticOperator
solutions-descriptive/4.js:25:32
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
+                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) - dpTable[splitPoint][end];
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
             }
