[Survived] UpdateOperator
solutions-descriptive/40.js:4:36
 export function solve(nodeCount, pattern) {
     const positionGroups = {};
     let maxLabel = 0;
-    for (let i = 0; i < nodeCount; i++) {
+    for (let i = 0; i < nodeCount; i--) {
         const value = pattern[i];
         if (!positionGroups[value]) positionGroups[value] = [];

[Survived] ConditionalExpression
solutions-descriptive/40.js:23:30
         while (used[rightIndex]) rightIndex--;
 
         const group = positionGroups[label];
-        const startsAtLeft = group[0] === leftIndex;
+        const startsAtLeft = false;
         const endsAtRight = group[group.length - 1] === rightIndex;
 

[Survived] ArithmeticOperator
solutions-descriptive/40.js:26:13
         const startsAtLeft = group[0] === leftIndex;
         const endsAtRight = group[group.length - 1] === rightIndex;
 
-        if (label % 2 === 1) {
+        if (label * 2 === 1) {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {

[Survived] ConditionalExpression
solutions-descriptive/40.js:27:17
         const endsAtRight = group[group.length - 1] === rightIndex;
 
         if (label % 2 === 1) {
-            if (startsAtLeft && endsAtRight) {
+            if (false) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {

[Survived] UpdateOperator
solutions-descriptive/40.js:28:59
 
         if (label % 2 === 1) {
             if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
+                for (let mid = group[0]; mid < nodeCount; mid--) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);

[Survived] ConditionalExpression
solutions-descriptive/40.js:43:17
                 rightPos -= group.length;
             }
         } else {
-            if (startsAtLeft && endsAtRight) {
+            if (true) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {

[Survived] EqualityOperator
solutions-descriptive/40.js:44:42
             }
         } else {
             if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
+                for (let mid = group[0]; mid <= nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, leftPos, 1, mid);

[Survived] EqualityOperator
solutions-descriptive/40.js:45:25
         } else {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
+                    if (pattern[mid] <= 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, leftPos, 1, mid);
                         leftPos += group.length;

[Survived] UpdateOperator
solutions-descriptive/40.js:68:41
 }
 
 function fillLinear(used, result, indices, startValue, step) {
-    for (let k = 0; k < indices.length; k++) {
+    for (let k = 0; k < indices.length; k--) {
         result[indices[k]] = startValue;
         used[indices[k]] = true;

[Survived] EqualityOperator
solutions-descriptive/40.js:68:21
 }
 
 function fillLinear(used, result, indices, startValue, step) {
-    for (let k = 0; k < indices.length; k++) {
+    for (let k = 0; k <= indices.length; k++) {
         result[indices[k]] = startValue;
         used[indices[k]] = true;

[Survived] EqualityOperator
solutions-descriptive/40.js:78:12
 function fillSymmetric(used, result, indices, startValue, step, midIndex) {
     let i = 0,
         j = indices.length - 1;
-    while (indices[i] < midIndex) {
+    while (indices[i] <= midIndex) {
         used[indices[i]] = true;
         result[indices[i++]] = startValue;

[Survived] BlockStatement
solutions-descriptive/40.js:83:35
         result[indices[i++]] = startValue;
         startValue += step;
     }
-    while (indices[j] > midIndex) {
-        used[indices[j]] = true;
-        result[indices[j--]] = startValue;
-        startValue += step;
-    }
+    while (indices[j] > midIndex) {}
 }
 
