[Survived] EqualityOperator
solutions-descriptive/41.js:88:21
     }
 
     const prefixTriangleSum = Array(arraySize + 2).fill(0n);
-    for (let i = 1; i <= arraySize; i++) {
+    for (let i = 1; i < arraySize; i++) {
         prefixTriangleSum[i] = prefixTriangleSum[i - 1] + BigInt(triangleWeightedSum[i]);
     }

[Survived] BlockStatement
solutions-descriptive/41.js:111:29
     return output;
 
     function binarySearch(low, high, condition) {
-        while (low <= high) {
-            const mid = Math.floor((low + high) / 2);
-            if (condition(mid)) {
-                low = mid + 1;
-            } else {
-                high = mid - 1;
-            }
-        }
+        while (low <= high) {}
         return high;
     }

[Survived] BlockStatement
solutions-descriptive/41.js:113:33
     function binarySearch(low, high, condition) {
         while (low <= high) {
             const mid = Math.floor((low + high) / 2);
-            if (condition(mid)) {
-                low = mid + 1;
-            } else {
+            if (condition(mid)) {} else {
                 high = mid - 1;
             }
