[Killed] AssignmentOperator
solutions-descriptive/42.js:6:5
 
 function powmod(a, b) {
     let res = 1n;
-    a %= M;
+    a *= M;
     while (b > 0n) {
         if (b & 1n) res = (res * a) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/42.js:7:12
 function powmod(a, b) {
     let res = 1n;
     a %= M;
-    while (b > 0n) {
+    while (false) {
         if (b & 1n) res = (res * a) % M;
         a = (a * a) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 270027

[Timeout] EqualityOperator
solutions-descriptive/42.js:7:12
 function powmod(a, b) {
     let res = 1n;
     a %= M;
-    while (b > 0n) {
+    while (b <= 0n) {
         if (b & 1n) res = (res * a) % M;
         a = (a * a) % M;

[Killed] ConditionalExpression
solutions-descriptive/42.js:8:13
     let res = 1n;
     a %= M;
     while (b > 0n) {
-        if (b & 1n) res = (res * a) % M;
+        if (false) res = (res * a) % M;
         a = (a * a) % M;
         b >>= 1n;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 270027

[Killed] ArithmeticOperator
solutions-descriptive/42.js:8:28
     let res = 1n;
     a %= M;
     while (b > 0n) {
-        if (b & 1n) res = (res * a) % M;
+        if (b & 1n) res = (res / a) % M;
         a = (a * a) % M;
         b >>= 1n;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/42.js:9:14
     a %= M;
     while (b > 0n) {
         if (b & 1n) res = (res * a) % M;
-        a = (a * a) % M;
+        a = (a / a) % M;
         b >>= 1n;
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 600000102

[Timeout] AssignmentOperator
solutions-descriptive/42.js:10:9
     while (b > 0n) {
         if (b & 1n) res = (res * a) % M;
         a = (a * a) % M;
-        b >>= 1n;
+        b <<= 1n;
     }
     return res;

[Killed] ArithmeticOperator
solutions-descriptive/42.js:15:31
     return res;
 }
 
-let inv10000 = powmod(10000n, M - 2n);
+let inv10000 = powmod(10000n, M + 2n);
 let inv2 = powmod(2n, M - 2n);
 let inv8 = powmod(8n, M - 2n);
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 785000042

[Killed] ArithmeticOperator
solutions-descriptive/42.js:16:23
 }
 
 let inv10000 = powmod(10000n, M - 2n);
-let inv2 = powmod(2n, M - 2n);
+let inv2 = powmod(2n, M + 2n);
 let inv8 = powmod(8n, M - 2n);
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 364

[Killed] ArithmeticOperator
solutions-descriptive/42.js:17:23
 
 let inv10000 = powmod(10000n, M - 2n);
 let inv2 = powmod(2n, M - 2n);
-let inv8 = powmod(8n, M - 2n);
+let inv8 = powmod(8n, M + 2n);
 
 let inv_pows = new BigInt64Array(MAX);
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 114709

[Killed] EqualityOperator
solutions-descriptive/42.js:21:17
 
 let inv_pows = new BigInt64Array(MAX);
 inv_pows[0] = 1n;
-for (let i = 1; i < MAX; i++) {
+for (let i = 1; i >= MAX; i++) {
     inv_pows[i] = (inv_pows[i - 1] * inv10000) % M;
 }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000028

[Killed] BlockStatement
solutions-descriptive/42.js:21:31
 
 let inv_pows = new BigInt64Array(MAX);
 inv_pows[0] = 1n;
-for (let i = 1; i < MAX; i++) {
-    inv_pows[i] = (inv_pows[i - 1] * inv10000) % M;
-}
+for (let i = 1; i < MAX; i++) {}
 
 let pairs = [];
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000028

[Killed] ArithmeticOperator
solutions-descriptive/42.js:22:20
 let inv_pows = new BigInt64Array(MAX);
 inv_pows[0] = 1n;
 for (let i = 1; i < MAX; i++) {
-    inv_pows[i] = (inv_pows[i - 1] * inv10000) % M;
+    inv_pows[i] = (inv_pows[i - 1] / inv10000) % M;
 }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000028

[Killed] ArithmeticOperator
solutions-descriptive/42.js:22:19
 let inv_pows = new BigInt64Array(MAX);
 inv_pows[0] = 1n;
 for (let i = 1; i < MAX; i++) {
-    inv_pows[i] = (inv_pows[i - 1] * inv10000) % M;
+    inv_pows[i] = inv_pows[i - 1] * inv10000 * M;
 }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000028

[Survived] EqualityOperator
solutions-descriptive/42.js:26:17
 }
 
 let pairs = [];
-for (let j = 0; j < 10; j++) {
+for (let j = 0; j <= 10; j++) {
     for (let l = j + 1; l < 10; l++) {
         pairs.push([j, l]);

[Timeout] UpdateOperator
solutions-descriptive/42.js:26:25
 }
 
 let pairs = [];
-for (let j = 0; j < 10; j++) {
+for (let j = 0; j < 10; j--) {
     for (let l = j + 1; l < 10; l++) {
         pairs.push([j, l]);

[Killed] EqualityOperator
solutions-descriptive/42.js:27:25
 
 let pairs = [];
 for (let j = 0; j < 10; j++) {
-    for (let l = j + 1; l < 10; l++) {
+    for (let l = j + 1; l <= 10; l++) {
         pairs.push([j, l]);
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
solutions-descriptive/42.js:27:18
 
 let pairs = [];
 for (let j = 0; j < 10; j++) {
-    for (let l = j + 1; l < 10; l++) {
+    for (let l = j - 1; l < 10; l++) {
         pairs.push([j, l]);
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/42.js:34:30
 
 let pow2_2j = new BigInt64Array(10);
 pow2_2j.fill(1n);
-for (let j = 0; j < 10; j++) {
-    pow2_2j[j] = powmod(2n, BigInt(2 * j));
-}
+for (let j = 0; j < 10; j++) {}
 
 let pow2_jl = new BigInt64Array(45);
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 31

[Killed] EqualityOperator
solutions-descriptive/42.js:34:17
 
 let pow2_2j = new BigInt64Array(10);
 pow2_2j.fill(1n);
-for (let j = 0; j < 10; j++) {
+for (let j = 0; j >= 10; j++) {
     pow2_2j[j] = powmod(2n, BigInt(2 * j));
 }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 31

[Killed] ConditionalExpression
solutions-descriptive/42.js:40:17
 
 let pow2_jl = new BigInt64Array(45);
 pow2_jl.fill(1n);
-for (let i = 0; i < 45; i++) {
+for (let i = 0; false; i++) {
     pow2_jl[i] = powmod(2n, BigInt(pairs[i][0] + pairs[i][1]));
 }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 27

[Killed] EqualityOperator
solutions-descriptive/42.js:40:17
 
 let pow2_jl = new BigInt64Array(45);
 pow2_jl.fill(1n);
-for (let i = 0; i < 45; i++) {
+for (let i = 0; i >= 45; i++) {
     pow2_jl[i] = powmod(2n, BigInt(pairs[i][0] + pairs[i][1]));
 }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 27

[Killed] ArithmeticOperator
solutions-descriptive/42.js:41:36
 let pow2_jl = new BigInt64Array(45);
 pow2_jl.fill(1n);
 for (let i = 0; i < 45; i++) {
-    pow2_jl[i] = powmod(2n, BigInt(pairs[i][0] + pairs[i][1]));
+    pow2_jl[i] = powmod(2n, BigInt(pairs[i][0] - pairs[i][1]));
 }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 27

[Killed] ArithmeticOperator
solutions-descriptive/42.js:62:29
 
     for (let i = 0; i < n; i++) {
         let ai = a[i], pi = p[i];
-        let val = (10000n - 2n * BigInt(pi) + M) % M;
+        let val = (10000n - 2n / BigInt(pi) + M) % M;
 
         for (let j = 0; j < 10; j++) {
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/42.js:62:19
 
     for (let i = 0; i < n; i++) {
         let ai = a[i], pi = p[i];
-        let val = (10000n - 2n * BigInt(pi) + M) % M;
+        let val = (10000n - 2n * BigInt(pi) + M) * M;
 
         for (let j = 0; j < 10; j++) {
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000028

[Killed] ConditionalExpression
solutions-descriptive/42.js:64:25
         let ai = a[i], pi = p[i];
         let val = (10000n - 2n * BigInt(pi) + M) % M;
 
-        for (let j = 0; j < 10; j++) {
+        for (let j = 0; false; j++) {
             if ((ai >> j) & 1) {
                 Pj[j] = (Pj[j] * val) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] EqualityOperator
solutions-descriptive/42.js:64:25
         let ai = a[i], pi = p[i];
         let val = (10000n - 2n * BigInt(pi) + M) % M;
 
-        for (let j = 0; j < 10; j++) {
+        for (let j = 0; j >= 10; j++) {
             if ((ai >> j) & 1) {
                 Pj[j] = (Pj[j] * val) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] ConditionalExpression
solutions-descriptive/42.js:65:17
         let val = (10000n - 2n * BigInt(pi) + M) % M;
 
         for (let j = 0; j < 10; j++) {
-            if ((ai >> j) & 1) {
+            if (true) {
                 Pj[j] = (Pj[j] * val) % M;
                 kj[j]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 349553

[Killed] BlockStatement
solutions-descriptive/42.js:65:32
         let val = (10000n - 2n * BigInt(pi) + M) % M;
 
         for (let j = 0; j < 10; j++) {
-            if ((ai >> j) & 1) {
-                Pj[j] = (Pj[j] * val) % M;
-                kj[j]++;
-            }
+            if ((ai >> j) & 1) {}
         }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] ArithmeticOperator
solutions-descriptive/42.js:66:25
 
         for (let j = 0; j < 10; j++) {
             if ((ai >> j) & 1) {
-                Pj[j] = (Pj[j] * val) % M;
+                Pj[j] = Pj[j] * val * M;
                 kj[j]++;
             }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000042

[Killed] ArithmeticOperator
solutions-descriptive/42.js:66:26
 
         for (let j = 0; j < 10; j++) {
             if ((ai >> j) & 1) {
-                Pj[j] = (Pj[j] * val) % M;
+                Pj[j] = (Pj[j] / val) % M;
                 kj[j]++;
             }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500000042

[Killed] UpdateOperator
solutions-descriptive/42.js:67:17
         for (let j = 0; j < 10; j++) {
             if ((ai >> j) & 1) {
                 Pj[j] = (Pj[j] * val) % M;
-                kj[j]++;
+                kj[j]--;
             }
         }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/42.js:71:44
             }
         }
 
-        for (let idx = 0; idx < sz; idx++) {
-            let j = pairs[idx][0], l = pairs[idx][1];
-            let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
-
-            if (sj && !sl) {
-                PA[idx] = (PA[idx] * val) % M;
-                kA[idx]++;
-            }
-            if (sl && !sj) {
-                PB[idx] = (PB[idx] * val) % M;
-                kB[idx]++;
-            }
-            if (sj && sl) {
-                PC[idx] = (PC[idx] * val) % M;
-                kC[idx]++;
-            }
-        }
+        for (let idx = 0; idx < sz; idx++) {}
     }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Killed] EqualityOperator
solutions-descriptive/42.js:71:27
             }
         }
 
-        for (let idx = 0; idx < sz; idx++) {
+        for (let idx = 0; idx <= sz; idx++) {
             let j = pairs[idx][0], l = pairs[idx][1];
             let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BooleanLiteral
solutions-descriptive/42.js:75:23
             let j = pairs[idx][0], l = pairs[idx][1];
             let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
 
-            if (sj && !sl) {
+            if (sj && sl) {
                 PA[idx] = (PA[idx] * val) % M;
                 kA[idx]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Killed] ConditionalExpression
solutions-descriptive/42.js:75:17
             let j = pairs[idx][0], l = pairs[idx][1];
             let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
 
-            if (sj && !sl) {
+            if (true) {
                 PA[idx] = (PA[idx] * val) % M;
                 kA[idx]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Survived] ArithmeticOperator
solutions-descriptive/42.js:76:27
             let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
 
             if (sj && !sl) {
-                PA[idx] = (PA[idx] * val) % M;
+                PA[idx] = PA[idx] * val * M;
                 kA[idx]++;
             }

[Survived] ArithmeticOperator
solutions-descriptive/42.js:76:28
             let sj = (ai >> j) & 1, sl = (ai >> l) & 1;
 
             if (sj && !sl) {
-                PA[idx] = (PA[idx] * val) % M;
+                PA[idx] = (PA[idx] / val) % M;
                 kA[idx]++;
             }

[Killed] UpdateOperator
solutions-descriptive/42.js:77:17
 
             if (sj && !sl) {
                 PA[idx] = (PA[idx] * val) % M;
-                kA[idx]++;
+                kA[idx]--;
             }
             if (sl && !sj) {
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
solutions-descriptive/42.js:79:17
                 PA[idx] = (PA[idx] * val) % M;
                 kA[idx]++;
             }
-            if (sl && !sj) {
+            if (sl || !sj) {
                 PB[idx] = (PB[idx] * val) % M;
                 kB[idx]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Killed] ConditionalExpression
solutions-descriptive/42.js:79:17
                 PA[idx] = (PA[idx] * val) % M;
                 kA[idx]++;
             }
-            if (sl && !sj) {
+            if (true) {
                 PB[idx] = (PB[idx] * val) % M;
                 kB[idx]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 14245

[Survived] ArithmeticOperator
solutions-descriptive/42.js:80:28
                 kA[idx]++;
             }
             if (sl && !sj) {
-                PB[idx] = (PB[idx] * val) % M;
+                PB[idx] = (PB[idx] / val) % M;
                 kB[idx]++;
             }

[Survived] ArithmeticOperator
solutions-descriptive/42.js:80:27
                 kA[idx]++;
             }
             if (sl && !sj) {
-                PB[idx] = (PB[idx] * val) % M;
+                PB[idx] = PB[idx] * val * M;
                 kB[idx]++;
             }

[Killed] UpdateOperator
solutions-descriptive/42.js:81:17
             }
             if (sl && !sj) {
                 PB[idx] = (PB[idx] * val) % M;
-                kB[idx]++;
+                kB[idx]--;
             }
             if (sj && sl) {
killedBy: tricky case: n = 2, same a, one p = 10000, one p = 0 (never inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/42.js:83:27
                 PB[idx] = (PB[idx] * val) % M;
                 kB[idx]++;
             }
-            if (sj && sl) {
-                PC[idx] = (PC[idx] * val) % M;
-                kC[idx]++;
-            }
+            if (sj && sl) {}
         }
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Killed] ConditionalExpression
solutions-descriptive/42.js:83:17
                 PB[idx] = (PB[idx] * val) % M;
                 kB[idx]++;
             }
-            if (sj && sl) {
+            if (true) {
                 PC[idx] = (PC[idx] * val) % M;
                 kC[idx]++;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 682801

[Killed] ArithmeticOperator
solutions-descriptive/42.js:84:27
                 kB[idx]++;
             }
             if (sj && sl) {
-                PC[idx] = (PC[idx] * val) % M;
+                PC[idx] = PC[idx] * val * M;
                 kC[idx]++;
             }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 35

[Killed] ArithmeticOperator
solutions-descriptive/42.js:84:28
                 kB[idx]++;
             }
             if (sj && sl) {
-                PC[idx] = (PC[idx] * val) % M;
+                PC[idx] = (PC[idx] / val) % M;
                 kC[idx]++;
             }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 35

[Killed] UpdateOperator
solutions-descriptive/42.js:85:17
             }
             if (sj && sl) {
                 PC[idx] = (PC[idx] * val) % M;
-                kC[idx]++;
+                kC[idx]--;
             }
         }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/42.js:90:34
         }
     }
 
-    for (let j = 0; j < 10; j++) {
-        if (kj[j] > 0) {
-            Pj[j] = (Pj[j] * inv_pows[kj[j]]) % M;
-        }
-    }
+    for (let j = 0; j < 10; j++) {}
 
     for (let idx = 0; idx < sz; idx++) {
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500105042

[Killed] EqualityOperator
solutions-descriptive/42.js:91:13
     }
 
     for (let j = 0; j < 10; j++) {
-        if (kj[j] > 0) {
+        if (kj[j] <= 0) {
             Pj[j] = (Pj[j] * inv_pows[kj[j]]) % M;
         }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500105042

[Killed] BlockStatement
solutions-descriptive/42.js:91:24
     }
 
     for (let j = 0; j < 10; j++) {
-        if (kj[j] > 0) {
-            Pj[j] = (Pj[j] * inv_pows[kj[j]]) % M;
-        }
+        if (kj[j] > 0) {}
     }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 500105042

[Killed] ArithmeticOperator
solutions-descriptive/42.js:92:22
 
     for (let j = 0; j < 10; j++) {
         if (kj[j] > 0) {
-            Pj[j] = (Pj[j] * inv_pows[kj[j]]) % M;
+            Pj[j] = (Pj[j] / inv_pows[kj[j]]) % M;
         }
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 7

[Killed] ArithmeticOperator
solutions-descriptive/42.js:92:21
 
     for (let j = 0; j < 10; j++) {
         if (kj[j] > 0) {
-            Pj[j] = (Pj[j] * inv_pows[kj[j]]) % M;
+            Pj[j] = Pj[j] * inv_pows[kj[j]] * M;
         }
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: -684067217

[Killed] EqualityOperator
solutions-descriptive/42.js:96:23
         }
     }
 
-    for (let idx = 0; idx < sz; idx++) {
+    for (let idx = 0; idx >= sz; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 140035

[Killed] ConditionalExpression
solutions-descriptive/42.js:96:23
         }
     }
 
-    for (let idx = 0; idx < sz; idx++) {
+    for (let idx = 0; false; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 140035

[Survived] EqualityOperator
solutions-descriptive/42.js:97:13
     }
 
     for (let idx = 0; idx < sz; idx++) {
-        if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
+        if (kA[idx] <= 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
         if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;

[Survived] ConditionalExpression
solutions-descriptive/42.js:97:13
     }
 
     for (let idx = 0; idx < sz; idx++) {
-        if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
+        if (false) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
         if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;

[Survived] EqualityOperator
solutions-descriptive/42.js:98:13
 
     for (let idx = 0; idx < sz; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
-        if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
+        if (kB[idx] >= 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
         if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;
     }

[Survived] ArithmeticOperator
solutions-descriptive/42.js:98:36
 
     for (let idx = 0; idx < sz; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
-        if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
+        if (kB[idx] > 0) PB[idx] = PB[idx] * inv_pows[kB[idx]] * M;
         if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;
     }

[Killed] ArithmeticOperator
solutions-descriptive/42.js:99:37
     for (let idx = 0; idx < sz; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
-        if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;
+        if (kC[idx] > 0) PC[idx] = (PC[idx] / inv_pows[kC[idx]]) % M;
     }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 1000000000

[Killed] EqualityOperator
solutions-descriptive/42.js:99:13
     for (let idx = 0; idx < sz; idx++) {
         if (kA[idx] > 0) PA[idx] = (PA[idx] * inv_pows[kA[idx]]) % M;
         if (kB[idx] > 0) PB[idx] = (PB[idx] * inv_pows[kB[idx]]) % M;
-        if (kC[idx] > 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;
+        if (kC[idx] <= 0) PC[idx] = (PC[idx] * inv_pows[kC[idx]]) % M;
     }
 
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 140035

[Killed] UpdateOperator
solutions-descriptive/42.js:103:29
     }
 
     let Ebj = new BigInt64Array(10);
-    for (let j = 0; j < 10; j++) {
+    for (let j = 0; j < 10; j--) {
         Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] EqualityOperator
solutions-descriptive/42.js:103:21
     }
 
     let Ebj = new BigInt64Array(10);
-    for (let j = 0; j < 10; j++) {
+    for (let j = 0; j >= 10; j++) {
         Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
     }
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] ArithmeticOperator
solutions-descriptive/42.js:104:19
 
     let Ebj = new BigInt64Array(10);
     for (let j = 0; j < 10; j++) {
-        Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
+        Ebj[j] = ((1n + M - Pj[j]) * M * inv2) % M;
     }
     let Ebl = new BigInt64Array(45);
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] ArithmeticOperator
solutions-descriptive/42.js:104:19
 
     let Ebj = new BigInt64Array(10);
     for (let j = 0; j < 10; j++) {
-        Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
+        Ebj[j] = ((1n + M - Pj[j]) % M / inv2) % M;
     }
     let Ebl = new BigInt64Array(45);
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 28

[Killed] UpdateOperator
solutions-descriptive/42.js:107:33
         Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
     }
     let Ebl = new BigInt64Array(45);
-    for (let idx = 0; idx < sz; idx++) {
+    for (let idx = 0; idx < sz; idx--) {
         let term1 = (1n + PC[idx]) % M;
         term1 = (term1 * (1n + M - PA[idx])) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] EqualityOperator
solutions-descriptive/42.js:107:23
         Ebj[j] = ((1n + M - Pj[j]) % M * inv2) % M;
     }
     let Ebl = new BigInt64Array(45);
-    for (let idx = 0; idx < sz; idx++) {
+    for (let idx = 0; idx >= sz; idx++) {
         let term1 = (1n + PC[idx]) % M;
         term1 = (term1 * (1n + M - PA[idx])) % M;
killedBy: edge case: n = 1, p = 10000 (always inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 49
Received: 21

[Survived] ArithmeticOperator
solutions-descriptive/42.js:108:21
     }
     let Ebl = new BigInt64Array(45);
     for (let idx = 0; idx < sz; idx++) {
-        let term1 = (1n + PC[idx]) % M;
+        let term1 = (1n + PC[idx]) * M;
         term1 = (term1 * (1n + M - PA[idx])) % M;
         term1 = (term1 * (1n + M - PB[idx])) % M;

[Survived] ArithmeticOperator
solutions-descriptive/42.js:108:22
     }
     let Ebl = new BigInt64Array(45);
     for (let idx = 0; idx < sz; idx++) {
-        let term1 = (1n + PC[idx]) % M;
+        let term1 = (1n - PC[idx]) % M;
         term1 = (term1 * (1n + M - PA[idx])) % M;
         term1 = (term1 * (1n + M - PB[idx])) % M;

[Killed] ArithmeticOperator
solutions-descriptive/42.js:109:27
     let Ebl = new BigInt64Array(45);
     for (let idx = 0; idx < sz; idx++) {
         let term1 = (1n + PC[idx]) % M;
-        term1 = (term1 * (1n + M - PA[idx])) % M;
+        term1 = (term1 * (1n + M + PA[idx])) % M;
         term1 = (term1 * (1n + M - PB[idx])) % M;
         let term2 = (1n + M - PC[idx]) % M;
killedBy: tricky case: n = 2, same a, one p = 10000, one p = 0 (never inserted)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 41

[Survived] ArithmeticOperator
solutions-descriptive/42.js:109:18
     let Ebl = new BigInt64Array(45);
     for (let idx = 0; idx < sz; idx++) {
         let term1 = (1n + PC[idx]) % M;
-        term1 = (term1 * (1n + M - PA[idx])) % M;
+        term1 = (term1 / (1n + M - PA[idx])) % M;
         term1 = (term1 * (1n + M - PB[idx])) % M;
         let term2 = (1n + M - PC[idx]) % M;
