[Survived] EqualityOperator
solutions-descriptive/44.js:14:43
             primes[primeCount++] = num;
             factor[num] = num;
         }
-        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
+        for (let j = 0; j < primeCount && num * primes[j] <= MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
             if (num % primes[j] === 0) {

[Timeout] BlockStatement
solutions-descriptive/44.js:14:76
             primes[primeCount++] = num;
             factor[num] = num;
         }
-        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
-            isComposite[num * primes[j]] = 1;
-            if (num % primes[j] === 0) {
-                factor[num * primes[j]] = factor[num];
-                break;
-            }
-            factor[num * primes[j]] = primes[j];
-        }
+        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {}
     }
 }

[Timeout] ArithmeticOperator
solutions-descriptive/44.js:16:17
         }
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
-            if (num % primes[j] === 0) {
+            if (num * primes[j] === 0) {
                 factor[num * primes[j]] = factor[num];
                 break;

[Survived] ConditionalExpression
solutions-descriptive/44.js:28:13
 function computeSGValues() {
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
-        if (i & 1) {
+        if (true) {
             if (!isComposite[i]) {
                 sgValues[i] = ++maxSG;

[Survived] BlockStatement
solutions-descriptive/44.js:29:34
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
         if (i & 1) {
-            if (!isComposite[i]) {
-                sgValues[i] = ++maxSG;
-            } else {
+            if (!isComposite[i]) {} else {
                 sgValues[i] = sgValues[factor[i]];
             }

[Survived] BooleanLiteral
solutions-descriptive/44.js:29:17
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
         if (i & 1) {
-            if (!isComposite[i]) {
+            if (isComposite[i]) {
                 sgValues[i] = ++maxSG;
             } else {
