[Killed] BlockStatement
solutions-descriptive/48.js:2:29
 // ✅ Solve ONE test case
-export function solve(n, a) {
-    let l = 1, r = 1;
-
-    for (let i = 1; i <= n - 1; i++) {
-        let tFlag = 0;
-        if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
-
-        if (a[l + (n - i) - 1] >= n - i + 1) {
-            // do nothing
-        } else {
-            l++;
-        }
-
-        r += tFlag;
-        if (l > r) break;
-    }
-
-    return Math.max(0, r - l + 1);
-}
+export function solve(n, a) {}
 
 // ✅ Testing function (independent)
killedBy: minimal/lower-bound case, n=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] UpdateOperator
solutions-descriptive/48.js:5:33
 export function solve(n, a) {
     let l = 1, r = 1;
 
-    for (let i = 1; i <= n - 1; i++) {
+    for (let i = 1; i <= n - 1; i--) {
         let tFlag = 0;
         if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 0

[Killed] EqualityOperator
solutions-descriptive/48.js:5:21
 export function solve(n, a) {
     let l = 1, r = 1;
 
-    for (let i = 1; i <= n - 1; i++) {
+    for (let i = 1; i < n - 1; i++) {
         let tFlag = 0;
         if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 199999

[Killed] ConditionalExpression
solutions-descriptive/48.js:7:13
 
     for (let i = 1; i <= n - 1; i++) {
         let tFlag = 0;
-        if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
+        if (true) tFlag = 1; // adjust for 0-based JS arrays
 
         if (a[l + (n - i) - 1] >= n - i + 1) {
killedBy: tricky/corner case: impossible in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 3

[Killed] ArithmeticOperator
solutions-descriptive/48.js:7:15
 
     for (let i = 1; i <= n - 1; i++) {
         let tFlag = 0;
-        if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
+        if (a[r + 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
 
         if (a[l + (n - i) - 1] >= n - i + 1) {
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 199999

[Killed] ArithmeticOperator
solutions-descriptive/48.js:9:20
         let tFlag = 0;
         if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
 
-        if (a[l + (n - i) - 1] >= n - i + 1) {
+        if (a[l + (n + i) - 1] >= n - i + 1) {
             // do nothing
         } else {
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 1

[Killed] EqualityOperator
solutions-descriptive/48.js:9:13
         let tFlag = 0;
         if (a[r - 1] >= n - i + 1) tFlag = 1; // adjust for 0-based JS arrays
 
-        if (a[l + (n - i) - 1] >= n - i + 1) {
+        if (a[l + (n - i) - 1] < n - i + 1) {
             // do nothing
         } else {
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 1

[Killed] BlockStatement
solutions-descriptive/48.js:11:16
 
         if (a[l + (n - i) - 1] >= n - i + 1) {
             // do nothing
-        } else {
-            l++;
-        }
+        } else {}
 
         r += tFlag;
killedBy: tricky/corner case: impossible in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 3

[Killed] UpdateOperator
solutions-descriptive/48.js:12:13
         if (a[l + (n - i) - 1] >= n - i + 1) {
             // do nothing
         } else {
-            l++;
+            l--;
         }
 
killedBy: tricky/corner case: impossible in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] AssignmentOperator
solutions-descriptive/48.js:15:9
             l++;
         }
 
-        r += tFlag;
+        r -= tFlag;
         if (l > r) break;
     }
killedBy: upper-bound/large input, increasing deadlines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200000
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/48.js:16:13
         }
 
         r += tFlag;
-        if (l > r) break;
+        if (false) break;
     }
 
killedBy: tricky/corner case: impossible in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
solutions-descriptive/48.js:16:13
         }
 
         r += tFlag;
-        if (l > r) break;
+        if (l >= r) break;
     }
 
killedBy: tricky/corner case: impossible in the middle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] MethodExpression
solutions-descriptive/48.js:19:12
         if (l > r) break;
     }
 
-    return Math.max(0, r - l + 1);
+    return Math.min(0, r - l + 1);
 }
 
killedBy: minimal/lower-bound case, n=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/48.js:19:24
         if (l > r) break;
     }
 
-    return Math.max(0, r - l + 1);
+    return Math.max(0, r - l - 1);
 }
 
killedBy: minimal/lower-bound case, n=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] BlockStatement
solutions-descriptive/48.js:23:25
 }
 
 // ✅ Testing function (independent)
-function testing_test() {
-    const cases = [
-        { n: 6, a: [6, 3, 3, 3, 5, 5], expected: 3 },
-        { n: 6, a: [5, 6, 4, 1, 4, 5], expected: 0 },
-        { n: 9, a: [8, 6, 4, 2, 1, 3, 5, 7, 9], expected: 1 }
-    ];
-
-    for (let i = 0; i < cases.length; i++) {
-        const { n, a, expected } = cases[i];
-        const output = solve(n, a);
-        const ok = output === expected;
-        console.log(
-            `Test #${i + 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`
-        );
-    }
-}
+function testing_test() {}
 
 // Run tests

[Survived] ArrayDeclaration
solutions-descriptive/48.js:25:20
 // ✅ Testing function (independent)
 function testing_test() {
     const cases = [
-        { n: 6, a: [6, 3, 3, 3, 5, 5], expected: 3 },
+        { n: 6, a: [], expected: 3 },
         { n: 6, a: [5, 6, 4, 1, 4, 5], expected: 0 },
         { n: 9, a: [8, 6, 4, 2, 1, 3, 5, 7, 9], expected: 1 }

[Survived] ConditionalExpression
solutions-descriptive/48.js:30:21
         { n: 9, a: [8, 6, 4, 2, 1, 3, 5, 7, 9], expected: 1 }
     ];
 
-    for (let i = 0; i < cases.length; i++) {
+    for (let i = 0; false; i++) {
         const { n, a, expected } = cases[i];
         const output = solve(n, a);

[Survived] BlockStatement
solutions-descriptive/48.js:30:44
         { n: 9, a: [8, 6, 4, 2, 1, 3, 5, 7, 9], expected: 1 }
     ];
 
-    for (let i = 0; i < cases.length; i++) {
-        const { n, a, expected } = cases[i];
-        const output = solve(n, a);
-        const ok = output === expected;
-        console.log(
-            `Test #${i + 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`
-        );
-    }
+    for (let i = 0; i < cases.length; i++) {}
 }
 

[Survived] EqualityOperator
solutions-descriptive/48.js:33:20
     for (let i = 0; i < cases.length; i++) {
         const { n, a, expected } = cases[i];
         const output = solve(n, a);
-        const ok = output === expected;
+        const ok = output !== expected;
         console.log(
             `Test #${i + 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`

[Survived] ConditionalExpression
solutions-descriptive/48.js:33:20
     for (let i = 0; i < cases.length; i++) {
         const { n, a, expected } = cases[i];
         const output = solve(n, a);
-        const ok = output === expected;
+        const ok = true;
         console.log(
             `Test #${i + 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`

[Survived] ArithmeticOperator
solutions-descriptive/48.js:35:22
         const output = solve(n, a);
         const ok = output === expected;
         console.log(
-            `Test #${i + 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`
+            `Test #${i - 1}: output=${output}, expected=${expected}, ${ok ? "PASSED ✅" : "FAILED ❌"}`
         );
     }
