[Survived] BlockStatement
solutions-descriptive/49.js:2:19
 class Queue {
-    constructor() {
-        this.map = {};
-        this.first = 0;
-        this.last = -1;
-    }
+    constructor() {}
     push(...args) {
         let i = 0;

[Survived] UnaryOperator
solutions-descriptive/49.js:5:21
     constructor() {
         this.map = {};
         this.first = 0;
-        this.last = -1;
+        this.last = +1;
     }
     push(...args) {

[Survived] BlockStatement
solutions-descriptive/49.js:7:19
         this.first = 0;
         this.last = -1;
     }
-    push(...args) {
-        let i = 0;
-        if (!this.length) {
-            this.first = this.last = 0;
-            this.map[this.first] = args[i++];
-        }
-        for (; i < args.length; i++) {
-            this.map[++this.last] = args[i];
-        }
-    }
+    push(...args) {}
     unshift(...args) {
         let i = 0;

[Survived] BlockStatement
solutions-descriptive/49.js:9:27
     }
     push(...args) {
         let i = 0;
-        if (!this.length) {
-            this.first = this.last = 0;
-            this.map[this.first] = args[i++];
-        }
+        if (!this.length) {}
         for (; i < args.length; i++) {
             this.map[++this.last] = args[i];

[Survived] BooleanLiteral
solutions-descriptive/49.js:9:13
     }
     push(...args) {
         let i = 0;
-        if (!this.length) {
+        if (this.length) {
             this.first = this.last = 0;
             this.map[this.first] = args[i++];

[Survived] UpdateOperator
solutions-descriptive/49.js:11:41
         let i = 0;
         if (!this.length) {
             this.first = this.last = 0;
-            this.map[this.first] = args[i++];
+            this.map[this.first] = args[i--];
         }
         for (; i < args.length; i++) {

[Survived] EqualityOperator
solutions-descriptive/49.js:13:16
             this.first = this.last = 0;
             this.map[this.first] = args[i++];
         }
-        for (; i < args.length; i++) {
+        for (; i >= args.length; i++) {
             this.map[++this.last] = args[i];
         }

[Survived] ConditionalExpression
solutions-descriptive/49.js:13:16
             this.first = this.last = 0;
             this.map[this.first] = args[i++];
         }
-        for (; i < args.length; i++) {
+        for (; false; i++) {
             this.map[++this.last] = args[i];
         }

[Survived] UpdateOperator
solutions-descriptive/49.js:14:22
             this.map[this.first] = args[i++];
         }
         for (; i < args.length; i++) {
-            this.map[++this.last] = args[i];
+            this.map[--this.last] = args[i];
         }
     }

[Survived] BlockStatement
solutions-descriptive/49.js:17:22
             this.map[++this.last] = args[i];
         }
     }
-    unshift(...args) {
-        let i = 0;
-        if (!this.length) {
-            this.first = this.last = 0;
-            this.map[this.first] = args[i++];
-        }
-        for (; i < args.length; i++) {
-            this.map[--this.first] = args[i];
-        }
-    }
+    unshift(...args) {}
     pop() {
         const r = this.map[this.last];

[Survived] UpdateOperator
solutions-descriptive/49.js:23:33
             this.first = this.last = 0;
             this.map[this.first] = args[i++];
         }
-        for (; i < args.length; i++) {
+        for (; i < args.length; i--) {
             this.map[--this.first] = args[i];
         }

[Survived] UpdateOperator
solutions-descriptive/49.js:24:22
             this.map[this.first] = args[i++];
         }
         for (; i < args.length; i++) {
-            this.map[--this.first] = args[i];
+            this.map[++this.first] = args[i];
         }
     }

[Survived] BlockStatement
solutions-descriptive/49.js:27:11
             this.map[--this.first] = args[i];
         }
     }
-    pop() {
-        const r = this.map[this.last];
-        delete this.map[this.last];
-        this.last--;
-        return r;
-    }
+    pop() {}
     shift() {
         const r = this.map[this.first];

[Survived] UpdateOperator
solutions-descriptive/49.js:30:9
     pop() {
         const r = this.map[this.last];
         delete this.map[this.last];
-        this.last--;
+        this.last++;
         return r;
     }

[Survived] BlockStatement
solutions-descriptive/49.js:33:13
         this.last--;
         return r;
     }
-    shift() {
-        const r = this.map[this.first];
-        delete this.map[this.first];
-        this.first++;
-        return r;
-    }
+    shift() {}
     get length() {
         if (this.first > this.last) return 0;

[Survived] UpdateOperator
solutions-descriptive/49.js:36:9
     shift() {
         const r = this.map[this.first];
         delete this.map[this.first];
-        this.first++;
+        this.first--;
         return r;
     }

[Survived] BlockStatement
solutions-descriptive/49.js:39:18
         this.first++;
         return r;
     }
-    get length() {
-        if (this.first > this.last) return 0;
-        return this.last - this.first + 1;
-    }
+    get length() {}
     get(x) {
         return this.map[this.first + x];

[Survived] EqualityOperator
solutions-descriptive/49.js:40:13
         return r;
     }
     get length() {
-        if (this.first > this.last) return 0;
+        if (this.first >= this.last) return 0;
         return this.last - this.first + 1;
     }

[Survived] ConditionalExpression
solutions-descriptive/49.js:40:13
         return r;
     }
     get length() {
-        if (this.first > this.last) return 0;
+        if (false) return 0;
         return this.last - this.first + 1;
     }

[Survived] ArithmeticOperator
solutions-descriptive/49.js:41:16
     }
     get length() {
         if (this.first > this.last) return 0;
-        return this.last - this.first + 1;
+        return this.last + this.first + 1;
     }
     get(x) {

[Survived] ArithmeticOperator
solutions-descriptive/49.js:41:16
     }
     get length() {
         if (this.first > this.last) return 0;
-        return this.last - this.first + 1;
+        return this.last - this.first - 1;
     }
     get(x) {

[Survived] BlockStatement
solutions-descriptive/49.js:43:12
         if (this.first > this.last) return 0;
         return this.last - this.first + 1;
     }
-    get(x) {
-        return this.map[this.first + x];
-    }
+    get(x) {}
     getLast() {
         return this.map[this.last];

[Survived] ArithmeticOperator
solutions-descriptive/49.js:44:25
         return this.last - this.first + 1;
     }
     get(x) {
-        return this.map[this.first + x];
+        return this.map[this.first - x];
     }
     getLast() {

[Survived] BlockStatement
solutions-descriptive/49.js:46:15
     get(x) {
         return this.map[this.first + x];
     }
-    getLast() {
-        return this.map[this.last];
-    }
+    getLast() {}
     forEach(fn) {
         for (let i = this.first; i <= this.last; i++) {

[Survived] BlockStatement
solutions-descriptive/49.js:49:17
     getLast() {
         return this.map[this.last];
     }
-    forEach(fn) {
-        for (let i = this.first; i <= this.last; i++) {
-            const r = fn(this.map[i], i - this.first);
-            if (r === false) break;
-        }
-    }
+    forEach(fn) {}
 }
 

[Survived] EqualityOperator
solutions-descriptive/49.js:50:34
         return this.map[this.last];
     }
     forEach(fn) {
-        for (let i = this.first; i <= this.last; i++) {
+        for (let i = this.first; i < this.last; i++) {
             const r = fn(this.map[i], i - this.first);
             if (r === false) break;

[Survived] ConditionalExpression
solutions-descriptive/49.js:50:34
         return this.map[this.last];
     }
     forEach(fn) {
-        for (let i = this.first; i <= this.last; i++) {
+        for (let i = this.first; false; i++) {
             const r = fn(this.map[i], i - this.first);
             if (r === false) break;

[Survived] ArithmeticOperator
solutions-descriptive/49.js:51:39
     }
     forEach(fn) {
         for (let i = this.first; i <= this.last; i++) {
-            const r = fn(this.map[i], i - this.first);
+            const r = fn(this.map[i], i + this.first);
             if (r === false) break;
         }

[Survived] EqualityOperator
solutions-descriptive/49.js:52:17
     forEach(fn) {
         for (let i = this.first; i <= this.last; i++) {
             const r = fn(this.map[i], i - this.first);
-            if (r === false) break;
+            if (r !== false) break;
         }
     }

[Survived] ConditionalExpression
solutions-descriptive/49.js:52:17
     forEach(fn) {
         for (let i = this.first; i <= this.last; i++) {
             const r = fn(this.map[i], i - this.first);
-            if (r === false) break;
+            if (false) break;
         }
     }

[Survived] MethodExpression
solutions-descriptive/49.js:58:19
 }
 
 export function solve(input) {
-    const lines = input.trim().split('\n');
+    const lines = input.split('\n');
     let idx = 0;
     const results = [];

[Survived] StringLiteral
solutions-descriptive/49.js:58:38
 }
 
 export function solve(input) {
-    const lines = input.trim().split('\n');
+    const lines = input.trim().split("");
     let idx = 0;
     const results = [];

[Survived] EqualityOperator
solutions-descriptive/49.js:62:12
     let idx = 0;
     const results = [];
 
-    while (idx < lines.length) {
+    while (idx >= lines.length) {
         const [n, m] = lines[idx++].split(' ').map(Number);
         const adj = {};

[Survived] ConditionalExpression
solutions-descriptive/49.js:62:12
     let idx = 0;
     const results = [];
 
-    while (idx < lines.length) {
+    while (false) {
         const [n, m] = lines[idx++].split(' ').map(Number);
         const adj = {};

[Survived] UpdateOperator
solutions-descriptive/49.js:63:30
     const results = [];
 
     while (idx < lines.length) {
-        const [n, m] = lines[idx++].split(' ').map(Number);
+        const [n, m] = lines[idx--].split(' ').map(Number);
         const adj = {};
 

[Survived] EqualityOperator
solutions-descriptive/49.js:66:25
         const [n, m] = lines[idx++].split(' ').map(Number);
         const adj = {};
 
-        for (let i = 0; i < m; i++) {
+        for (let i = 0; i <= m; i++) {
             const [a, b] = lines[idx++].split(' ').map(Number);
             adj[a] = adj[a] || [];

[Survived] UpdateOperator
solutions-descriptive/49.js:66:32
         const [n, m] = lines[idx++].split(' ').map(Number);
         const adj = {};
 
-        for (let i = 0; i < m; i++) {
+        for (let i = 0; i < m; i--) {
             const [a, b] = lines[idx++].split(' ').map(Number);
             adj[a] = adj[a] || [];

[Survived] UpdateOperator
solutions-descriptive/49.js:67:34
         const adj = {};
 
         for (let i = 0; i < m; i++) {
-            const [a, b] = lines[idx++].split(' ').map(Number);
+            const [a, b] = lines[idx--].split(' ').map(Number);
             adj[a] = adj[a] || [];
             adj[b] = adj[b] || [];

[Survived] LogicalOperator
solutions-descriptive/49.js:68:22
 
         for (let i = 0; i < m; i++) {
             const [a, b] = lines[idx++].split(' ').map(Number);
-            adj[a] = adj[a] || [];
+            adj[a] = adj[a] && [];
             adj[b] = adj[b] || [];
             adj[a].push(b);

[Survived] ConditionalExpression
solutions-descriptive/49.js:68:22
 
         for (let i = 0; i < m; i++) {
             const [a, b] = lines[idx++].split(' ').map(Number);
-            adj[a] = adj[a] || [];
+            adj[a] = true;
             adj[b] = adj[b] || [];
             adj[a].push(b);

[Survived] ConditionalExpression
solutions-descriptive/49.js:69:22
         for (let i = 0; i < m; i++) {
             const [a, b] = lines[idx++].split(' ').map(Number);
             adj[a] = adj[a] || [];
-            adj[b] = adj[b] || [];
+            adj[b] = false;
             adj[a].push(b);
             adj[b].push(a);

[Survived] LogicalOperator
solutions-descriptive/49.js:69:22
         for (let i = 0; i < m; i++) {
             const [a, b] = lines[idx++].split(' ').map(Number);
             adj[a] = adj[a] || [];
-            adj[b] = adj[b] || [];
+            adj[b] = adj[b] && [];
             adj[a].push(b);
             adj[b].push(a);

[Survived] ArithmeticOperator
solutions-descriptive/49.js:74:28
             adj[b].push(a);
         }
 
-        const dfsn = Array(n + 1);
+        const dfsn = Array(n - 1);
         const low = Array(n + 1);
         const fa = Array(n + 1);

[Survived] ArithmeticOperator
solutions-descriptive/49.js:75:27
         }
 
         const dfsn = Array(n + 1);
-        const low = Array(n + 1);
+        const low = Array(n - 1);
         const fa = Array(n + 1);
         let cnt = 0;

[Survived] ArrayDeclaration
solutions-descriptive/49.js:75:21
         }
 
         const dfsn = Array(n + 1);
-        const low = Array(n + 1);
+        const low = Array();
         const fa = Array(n + 1);
         let cnt = 0;

[Survived] ArithmeticOperator
solutions-descriptive/49.js:76:26
 
         const dfsn = Array(n + 1);
         const low = Array(n + 1);
-        const fa = Array(n + 1);
+        const fa = Array(n - 1);
         let cnt = 0;
         const sz = Array(n + 1).fill(1);

[Survived] ArithmeticOperator
solutions-descriptive/49.js:78:26
         const low = Array(n + 1);
         const fa = Array(n + 1);
         let cnt = 0;
-        const sz = Array(n + 1).fill(1);
+        const sz = Array(n - 1).fill(1);
         dfs2(1);
         let total = (n * (n - 1)) / 2;

[Survived] ArrayDeclaration
solutions-descriptive/49.js:78:20
         const low = Array(n + 1);
         const fa = Array(n + 1);
         let cnt = 0;
-        const sz = Array(n + 1).fill(1);
+        const sz = Array().fill(1);
         dfs2(1);
         let total = (n * (n - 1)) / 2;

[Survived] ArithmeticOperator
solutions-descriptive/49.js:80:27
         let cnt = 0;
         const sz = Array(n + 1).fill(1);
         dfs2(1);
-        let total = (n * (n - 1)) / 2;
+        let total = (n * (n + 1)) / 2;
         dfs(1);
         results.push(total);

[Survived] ArithmeticOperator
solutions-descriptive/49.js:80:21
         let cnt = 0;
         const sz = Array(n + 1).fill(1);
         dfs2(1);
-        let total = (n * (n - 1)) / 2;
+        let total = n * (n - 1) * 2;
         dfs(1);
         results.push(total);

[Survived] BlockStatement
solutions-descriptive/49.js:84:26
         dfs(1);
         results.push(total);
 
-        function dfs2(r) {
-            const visited = Array(n + 1);
-            const stack = new Queue();
-            stack.push([r, 0, -1]);
-            while (stack.length) {
-                const [u, i, p] = stack.getLast();
-                visited[u] = 1;
-
-                const nb = adj[u] || [];
-                if (i < nb.length) {
-                    stack.getLast()[1]++;
-                    const v = nb[i];
-                    if (!visited[v]) {
-                        stack.push([v, 0, u]);
-                    }
-                } else {
-                    stack.pop();
-                    if (p > 0) {
-                        sz[p] += sz[u];
-                    }
-                }
-            }
-        }
+        function dfs2(r) {}
 
         function dfs(r) {

[Survived] ArithmeticOperator
solutions-descriptive/49.js:85:35
         results.push(total);
 
         function dfs2(r) {
-            const visited = Array(n + 1);
+            const visited = Array(n - 1);
             const stack = new Queue();
             stack.push([r, 0, -1]);

[Survived] UnaryOperator
solutions-descriptive/49.js:87:31
         function dfs2(r) {
             const visited = Array(n + 1);
             const stack = new Queue();
-            stack.push([r, 0, -1]);
+            stack.push([r, 0, +1]);
             while (stack.length) {
                 const [u, i, p] = stack.getLast();

[Survived] BlockStatement
solutions-descriptive/49.js:88:34
             const visited = Array(n + 1);
             const stack = new Queue();
             stack.push([r, 0, -1]);
-            while (stack.length) {
-                const [u, i, p] = stack.getLast();
-                visited[u] = 1;
-
-                const nb = adj[u] || [];
-                if (i < nb.length) {
-                    stack.getLast()[1]++;
-                    const v = nb[i];
-                    if (!visited[v]) {
-                        stack.push([v, 0, u]);
-                    }
-                } else {
-                    stack.pop();
-                    if (p > 0) {
-                        sz[p] += sz[u];
-                    }
-                }
-            }
+            while (stack.length) {}
         }
 

[Survived] ConditionalExpression
solutions-descriptive/49.js:88:20
             const visited = Array(n + 1);
             const stack = new Queue();
             stack.push([r, 0, -1]);
-            while (stack.length) {
+            while (false) {
                 const [u, i, p] = stack.getLast();
                 visited[u] = 1;

[Survived] LogicalOperator
solutions-descriptive/49.js:92:28
                 const [u, i, p] = stack.getLast();
                 visited[u] = 1;
 
-                const nb = adj[u] || [];
+                const nb = adj[u] && [];
                 if (i < nb.length) {
                     stack.getLast()[1]++;

[Survived] ConditionalExpression
solutions-descriptive/49.js:92:28
                 const [u, i, p] = stack.getLast();
                 visited[u] = 1;
 
-                const nb = adj[u] || [];
+                const nb = true;
                 if (i < nb.length) {
                     stack.getLast()[1]++;

[Survived] BlockStatement
solutions-descriptive/49.js:93:36
                 visited[u] = 1;
 
                 const nb = adj[u] || [];
-                if (i < nb.length) {
-                    stack.getLast()[1]++;
-                    const v = nb[i];
-                    if (!visited[v]) {
-                        stack.push([v, 0, u]);
-                    }
-                } else {
+                if (i < nb.length) {} else {
                     stack.pop();
                     if (p > 0) {

[Survived] ConditionalExpression
solutions-descriptive/49.js:93:21
                 visited[u] = 1;
 
                 const nb = adj[u] || [];
-                if (i < nb.length) {
+                if (false) {
                     stack.getLast()[1]++;
                     const v = nb[i];

[Survived] UpdateOperator
solutions-descriptive/49.js:94:21
 
                 const nb = adj[u] || [];
                 if (i < nb.length) {
-                    stack.getLast()[1]++;
+                    stack.getLast()[1]--;
                     const v = nb[i];
                     if (!visited[v]) {

[Survived] BlockStatement
solutions-descriptive/49.js:96:38
                 if (i < nb.length) {
                     stack.getLast()[1]++;
                     const v = nb[i];
-                    if (!visited[v]) {
-                        stack.push([v, 0, u]);
-                    }
+                    if (!visited[v]) {}
                 } else {
                     stack.pop();

[Survived] BooleanLiteral
solutions-descriptive/49.js:96:25
                 if (i < nb.length) {
                     stack.getLast()[1]++;
                     const v = nb[i];
-                    if (!visited[v]) {
+                    if (visited[v]) {
                         stack.push([v, 0, u]);
                     }

[Survived] BlockStatement
solutions-descriptive/49.js:99:24
                     if (!visited[v]) {
                         stack.push([v, 0, u]);
                     }
-                } else {
-                    stack.pop();
-                    if (p > 0) {
-                        sz[p] += sz[u];
-                    }
-                }
+                } else {}
             }
         }

[Survived] ConditionalExpression
solutions-descriptive/49.js:101:25
                     }
                 } else {
                     stack.pop();
-                    if (p > 0) {
+                    if (false) {
                         sz[p] += sz[u];
                     }

[Survived] EqualityOperator
solutions-descriptive/49.js:101:25
                     }
                 } else {
                     stack.pop();
-                    if (p > 0) {
+                    if (p >= 0) {
                         sz[p] += sz[u];
                     }

[Survived] AssignmentOperator
solutions-descriptive/49.js:102:25
                 } else {
                     stack.pop();
                     if (p > 0) {
-                        sz[p] += sz[u];
+                        sz[p] -= sz[u];
                     }
                 }

[Survived] ConditionalExpression
solutions-descriptive/49.js:112:20
             const stack = new Queue();
             stack.push([r, 0, -1]);
             let max = 0;
-            while (stack.length) {
+            while (false) {
                 const [u, i, p] = stack.getLast();
                 const nb = adj[u] || [];

[Survived] BlockStatement
solutions-descriptive/49.js:112:34
             const stack = new Queue();
             stack.push([r, 0, -1]);
             let max = 0;
-            while (stack.length) {
-                const [u, i, p] = stack.getLast();
-                const nb = adj[u] || [];
-                if (!i) {
-                    low[u] = dfsn[u] = ++cnt;
-                }
-                if (i < nb.length) {
-                    stack.getLast()[1]++;
-                    const v = nb[i];
-                    if (!dfsn[v]) {
-                        fa[v] = u;
-                        stack.push([v, 0, u]);
-                    } else if (fa[u] !== v) {
-                        low[u] = Math.min(low[u], dfsn[v]);
-                    }
-                } else {
-                    stack.pop();
-                    if (p > 0) {
-                        low[p] = Math.min(low[p], low[u]);
-                        if (low[u] > dfsn[p]) {
-                            max = Math.max(max, sz[u] * (n - sz[u]));
-                        }
-                    }
-                }
-            }
+            while (stack.length) {}
             total -= max;
         }

[Survived] LogicalOperator
solutions-descriptive/49.js:114:28
             let max = 0;
             while (stack.length) {
                 const [u, i, p] = stack.getLast();
-                const nb = adj[u] || [];
+                const nb = adj[u] && [];
                 if (!i) {
                     low[u] = dfsn[u] = ++cnt;

[Survived] ConditionalExpression
solutions-descriptive/49.js:114:28
             let max = 0;
             while (stack.length) {
                 const [u, i, p] = stack.getLast();
-                const nb = adj[u] || [];
+                const nb = true;
                 if (!i) {
                     low[u] = dfsn[u] = ++cnt;

[Survived] ConditionalExpression
solutions-descriptive/49.js:115:21
             while (stack.length) {
                 const [u, i, p] = stack.getLast();
                 const nb = adj[u] || [];
-                if (!i) {
+                if (false) {
                     low[u] = dfsn[u] = ++cnt;
                 }

[Survived] BlockStatement
solutions-descriptive/49.js:115:25
             while (stack.length) {
                 const [u, i, p] = stack.getLast();
                 const nb = adj[u] || [];
-                if (!i) {
-                    low[u] = dfsn[u] = ++cnt;
-                }
+                if (!i) {}
                 if (i < nb.length) {
                     stack.getLast()[1]++;

[Survived] UpdateOperator
solutions-descriptive/49.js:116:40
                 const [u, i, p] = stack.getLast();
                 const nb = adj[u] || [];
                 if (!i) {
-                    low[u] = dfsn[u] = ++cnt;
+                    low[u] = dfsn[u] = --cnt;
                 }
                 if (i < nb.length) {

[Survived] BlockStatement
solutions-descriptive/49.js:118:36
                 if (!i) {
                     low[u] = dfsn[u] = ++cnt;
                 }
-                if (i < nb.length) {
-                    stack.getLast()[1]++;
-                    const v = nb[i];
-                    if (!dfsn[v]) {
-                        fa[v] = u;
-                        stack.push([v, 0, u]);
-                    } else if (fa[u] !== v) {
-                        low[u] = Math.min(low[u], dfsn[v]);
-                    }
-                } else {
+                if (i < nb.length) {} else {
                     stack.pop();
                     if (p > 0) {

[Survived] EqualityOperator
solutions-descriptive/49.js:118:21
                 if (!i) {
                     low[u] = dfsn[u] = ++cnt;
                 }
-                if (i < nb.length) {
+                if (i <= nb.length) {
                     stack.getLast()[1]++;
                     const v = nb[i];

[Survived] ConditionalExpression
solutions-descriptive/49.js:121:25
                 if (i < nb.length) {
                     stack.getLast()[1]++;
                     const v = nb[i];
-                    if (!dfsn[v]) {
+                    if (true) {
                         fa[v] = u;
                         stack.push([v, 0, u]);

[Survived] BooleanLiteral
solutions-descriptive/49.js:121:25
                 if (i < nb.length) {
                     stack.getLast()[1]++;
                     const v = nb[i];
-                    if (!dfsn[v]) {
+                    if (dfsn[v]) {
                         fa[v] = u;
                         stack.push([v, 0, u]);

[Survived] ConditionalExpression
solutions-descriptive/49.js:124:32
                     if (!dfsn[v]) {
                         fa[v] = u;
                         stack.push([v, 0, u]);
-                    } else if (fa[u] !== v) {
+                    } else if (false) {
                         low[u] = Math.min(low[u], dfsn[v]);
                     }

[Survived] BlockStatement
solutions-descriptive/49.js:124:45
                     if (!dfsn[v]) {
                         fa[v] = u;
                         stack.push([v, 0, u]);
-                    } else if (fa[u] !== v) {
-                        low[u] = Math.min(low[u], dfsn[v]);
-                    }
+                    } else if (fa[u] !== v) {}
                 } else {
                     stack.pop();

[Survived] MethodExpression
solutions-descriptive/49.js:125:34
                         fa[v] = u;
                         stack.push([v, 0, u]);
                     } else if (fa[u] !== v) {
-                        low[u] = Math.min(low[u], dfsn[v]);
+                        low[u] = Math.max(low[u], dfsn[v]);
                     }
                 } else {

[Survived] BlockStatement
solutions-descriptive/49.js:127:24
                     } else if (fa[u] !== v) {
                         low[u] = Math.min(low[u], dfsn[v]);
                     }
-                } else {
-                    stack.pop();
-                    if (p > 0) {
-                        low[p] = Math.min(low[p], low[u]);
-                        if (low[u] > dfsn[p]) {
-                            max = Math.max(max, sz[u] * (n - sz[u]));
-                        }
-                    }
-                }
+                } else {}
             }
             total -= max;

[Survived] ConditionalExpression
solutions-descriptive/49.js:129:25
                     }
                 } else {
                     stack.pop();
-                    if (p > 0) {
+                    if (true) {
                         low[p] = Math.min(low[p], low[u]);
                         if (low[u] > dfsn[p]) {

[Survived] MethodExpression
solutions-descriptive/49.js:130:34
                 } else {
                     stack.pop();
                     if (p > 0) {
-                        low[p] = Math.min(low[p], low[u]);
+                        low[p] = Math.max(low[p], low[u]);
                         if (low[u] > dfsn[p]) {
                             max = Math.max(max, sz[u] * (n - sz[u]));

[Survived] EqualityOperator
solutions-descriptive/49.js:131:29
                     stack.pop();
                     if (p > 0) {
                         low[p] = Math.min(low[p], low[u]);
-                        if (low[u] > dfsn[p]) {
+                        if (low[u] <= dfsn[p]) {
                             max = Math.max(max, sz[u] * (n - sz[u]));
                         }

[Survived] ConditionalExpression
solutions-descriptive/49.js:131:29
                     stack.pop();
                     if (p > 0) {
                         low[p] = Math.min(low[p], low[u]);
-                        if (low[u] > dfsn[p]) {
+                        if (true) {
                             max = Math.max(max, sz[u] * (n - sz[u]));
                         }

[Survived] MethodExpression
solutions-descriptive/49.js:132:35
                     if (p > 0) {
                         low[p] = Math.min(low[p], low[u]);
                         if (low[u] > dfsn[p]) {
-                            max = Math.max(max, sz[u] * (n - sz[u]));
+                            max = Math.min(max, sz[u] * (n - sz[u]));
                         }
                     }

[Survived] ArithmeticOperator
solutions-descriptive/49.js:132:49
                     if (p > 0) {
                         low[p] = Math.min(low[p], low[u]);
                         if (low[u] > dfsn[p]) {
-                            max = Math.max(max, sz[u] * (n - sz[u]));
+                            max = Math.max(max, sz[u] / (n - sz[u]));
                         }
                     }

[Survived] AssignmentOperator
solutions-descriptive/49.js:137:13
                     }
                 }
             }
-            total -= max;
+            total += max;
         }
     }
