[Survived] EqualityOperator
solutions-descriptive/7.js:14:43
     let nDepth = Array(maxDepth + 1).fill(0);
     let subtreeSize = Array(n).fill(1);
 
-    for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
+    for (let i = tree.bfsTour.length - 1; i > 0; i--) {
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;

[Survived] ConditionalExpression
solutions-descriptive/7.js:17:13
     for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;
-        if (!tree.isRoot(u)) {
+        if (true) {
             subtreeSize[tree.parent[u]] += subtreeSize[u];
         }

[Survived] UpdateOperator
solutions-descriptive/7.js:23:36
     }
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
-    for (let d = 0; d <= maxDepth; d++) {
+    for (let d = 0; d <= maxDepth; d--) {
         nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
     }

[Survived] EqualityOperator
solutions-descriptive/7.js:33:21
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
 
-    for (let d = 0; d <= maxDepth; d++) {
+    for (let d = 0; d < maxDepth; d++) {
         ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
     }

[Survived] UpdateOperator
solutions-descriptive/7.js:68:58
 
     adjItr(node) {
         let res = [];
-        for (let i = this.s[node]; i < this.s[node + 1]; i++) {
+        for (let i = this.s[node]; i < this.s[node + 1]; i--) {
             res.push(this.g[i]);
         }

[Survived] EqualityOperator
solutions-descriptive/7.js:76:25
 
     build(root) {
         for (let i of this.edges) this.s[i + 2]++;
-        for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
+        for (let i = 0; i <= this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
         for (let i = 0; i < this.edges.length; i++) {

[Survived] EqualityOperator
solutions-descriptive/7.js:78:25
         for (let i of this.edges) this.s[i + 2]++;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
-        for (let i = 0; i < this.edges.length; i++) {
+        for (let i = 0; i <= this.edges.length; i++) {
             let j = this.edges[i] + 1;
             this.g[this.s[j]] = this.edges[i ^ 1];

[Survived] ConditionalExpression
solutions-descriptive/7.js:91:21
 
         for (let v of this.bfsTour) {
             for (let u of this.adjItr(v)) {
-                if (u !== this.parent[v]) {
+                if (true) {
                     this.parent[u] = v;
                     this.nodeDepth[u] = this.nodeDepth[v] + 1;

[Survived] ConditionalExpression
solutions-descriptive/7.js:103:16
     }
 
     isRoot(u) {
-        return u === this.root;
+        return false;
     }
 
