[Survived] EqualityOperator
solutions-descriptive/8.js:9:21
     let diffB = [];
 
 
-    for (let i = 0; i < Math.floor(n / 2); i++) {
+    for (let i = 0; i >= Math.floor(n / 2); i++) {
         diffA.push(arrayA[n - 1 - i] - arrayA[i]);
     }

[Survived] UpdateOperator
solutions-descriptive/8.js:14:44
     }
 
 
-    for (let i = 0; i < Math.floor(m / 2); i++) {
+    for (let i = 0; i < Math.floor(m / 2); i--) {
         diffB.push(arrayB[m - 1 - i] - arrayB[i]);
     }

[Survived] EqualityOperator
solutions-descriptive/8.js:14:21
     }
 
 
-    for (let i = 0; i < Math.floor(m / 2); i++) {
+    for (let i = 0; i <= Math.floor(m / 2); i++) {
         diffB.push(arrayB[m - 1 - i] - arrayB[i]);
     }

[Survived] ArithmeticOperator
solutions-descriptive/8.js:34:22
             totalDifference -= diffA[indexA];
         }
 
-        if (indexB > m - teamSize) {
+        if (indexB > m + teamSize) {
             totalDifference += diffA[indexA];
             indexA++;

[Survived] ConditionalExpression
solutions-descriptive/8.js:41:13
             totalDifference -= diffB[indexB];
         }
 
-        if (indexA === n - teamSize) {
+        if (false) {
             totalDifference += diffB[indexB];
             indexB++;
