[Killed] EqualityOperator
solutions-descriptive/1.js:38:36
 
 
             if (allDivisors[i] <= maxFactorRatio) {
-                minOperations[i] = allDivisors[i] === 1 ? 0 : 1;
+                minOperations[i] = allDivisors[i] !== 1 ? 0 : 1;
             }
 
killedBy: solve x == y with any k, expect 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2
