[Killed] EqualityOperator
solutions-descriptive/10.js:4:9
 'use strict';
 
 export function solve(n, l, r, edges) {
-    if (n === 1) return l[0];
+    if (n !== 1) return l[0];
 
     const deg = new Uint32Array(n);
killedBy: single node, li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:4:9
 'use strict';
 
 export function solve(n, l, r, edges) {
-    if (n === 1) return l[0];
+    if (false) return l[0];
 
     const deg = new Uint32Array(n);
killedBy: single node, li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: NaN

[Killed] BlockStatement
solutions-descriptive/10.js:9:33
     const deg = new Uint32Array(n);
     const mix = new Uint32Array(n);
 
-    for (const [u, v] of edges) {
-        const ui = u - 1;
-        const vi = v - 1;
-        deg[ui]++;
-        deg[vi]++;
-        mix[ui] ^= vi;
-        mix[vi] ^= ui;
-    }
+    for (const [u, v] of edges) {}
 
     const h = [];
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/10.js:10:20
     const mix = new Uint32Array(n);
 
     for (const [u, v] of edges) {
-        const ui = u - 1;
+        const ui = u + 1;
         const vi = v - 1;
         deg[ui]++;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/10.js:11:20
 
     for (const [u, v] of edges) {
         const ui = u - 1;
-        const vi = v - 1;
+        const vi = v + 1;
         deg[ui]++;
         deg[vi]++;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] UpdateOperator
solutions-descriptive/10.js:12:9
     for (const [u, v] of edges) {
         const ui = u - 1;
         const vi = v - 1;
-        deg[ui]++;
+        deg[ui]--;
         deg[vi]++;
         mix[ui] ^= vi;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] UpdateOperator
solutions-descriptive/10.js:13:9
         const ui = u - 1;
         const vi = v - 1;
         deg[ui]++;
-        deg[vi]++;
+        deg[vi]--;
         mix[ui] ^= vi;
         mix[vi] ^= ui;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/10.js:20:21
 
     const h = [];
     let hSize = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; i >= n; i++) {
         if (deg[i] === 1) {
             h[hSize++] = i;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:20:21
 
     const h = [];
     let hSize = 0;
-    for (let i = 0; i < n; i++) {
+    for (let i = 0; false; i++) {
         if (deg[i] === 1) {
             h[hSize++] = i;
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:21:13
     const h = [];
     let hSize = 0;
     for (let i = 0; i < n; i++) {
-        if (deg[i] === 1) {
+        if (false) {
             h[hSize++] = i;
         }
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] BlockStatement
solutions-descriptive/10.js:21:27
     const h = [];
     let hSize = 0;
     for (let i = 0; i < n; i++) {
-        if (deg[i] === 1) {
-            h[hSize++] = i;
-        }
+        if (deg[i] === 1) {}
     }
 
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] UpdateOperator
solutions-descriptive/10.js:22:15
     let hSize = 0;
     for (let i = 0; i < n; i++) {
         if (deg[i] === 1) {
-            h[hSize++] = i;
+            h[hSize--] = i;
         }
     }
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/10.js:29:21
     let ans = 0;
     let hPos = 0;
 
-    for (let i = 0; i < n - 1; i++) {
+    for (let i = 0; i <= n - 1; i++) {
         const u = h[hPos++];
         const v = mix[u];
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:29:21
     let ans = 0;
     let hPos = 0;
 
-    for (let i = 0; i < n - 1; i++) {
+    for (let i = 0; false; i++) {
         const u = h[hPos++];
         const v = mix[u];
killedBy: tiny chain
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] UpdateOperator
solutions-descriptive/10.js:30:21
     let hPos = 0;
 
     for (let i = 0; i < n - 1; i++) {
-        const u = h[hPos++];
+        const u = h[hPos--];
         const v = mix[u];
 
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:33:13
         const u = h[hPos++];
         const v = mix[u];
 
-        if (l[u] > r[v]) {
+        if (true) {
             ans += l[u] - r[v];
             l[v] = r[v];
killedBy: tiny chain
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -2

[Killed] BlockStatement
solutions-descriptive/10.js:33:26
         const u = h[hPos++];
         const v = mix[u];
 
-        if (l[u] > r[v]) {
-            ans += l[u] - r[v];
-            l[v] = r[v];
-        } else if (l[u] > l[v]) {
+        if (l[u] > r[v]) {} else if (l[u] > l[v]) {
             l[v] = l[u];
         }
killedBy: constraints needing addition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 9

[Killed] AssignmentOperator
solutions-descriptive/10.js:34:13
         const v = mix[u];
 
         if (l[u] > r[v]) {
-            ans += l[u] - r[v];
+            ans -= l[u] - r[v];
             l[v] = r[v];
         } else if (l[u] > l[v]) {
killedBy: constraints needing addition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 8

[Killed] ArithmeticOperator
solutions-descriptive/10.js:34:20
         const v = mix[u];
 
         if (l[u] > r[v]) {
-            ans += l[u] - r[v];
+            ans += l[u] + r[v];
             l[v] = r[v];
         } else if (l[u] > l[v]) {
killedBy: constraints needing addition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 28

[Killed] ConditionalExpression
solutions-descriptive/10.js:36:20
         if (l[u] > r[v]) {
             ans += l[u] - r[v];
             l[v] = r[v];
-        } else if (l[u] > l[v]) {
+        } else if (false) {
             l[v] = l[u];
         }
killedBy: two node, must increase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 1

[Killed] EqualityOperator
solutions-descriptive/10.js:36:20
         if (l[u] > r[v]) {
             ans += l[u] - r[v];
             l[v] = r[v];
-        } else if (l[u] > l[v]) {
+        } else if (l[u] <= l[v]) {
             l[v] = l[u];
         }
killedBy: two node, must increase
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 1

[Killed] UpdateOperator
solutions-descriptive/10.js:41:9
         }
 
         mix[v] ^= u;
-        deg[v]--;
+        deg[v]++;
         if (deg[v] === 1) {
             h[hSize++] = v;
killedBy: tiny chain
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/10.js:42:13
 
         mix[v] ^= u;
         deg[v]--;
-        if (deg[v] === 1) {
+        if (deg[v] !== 1) {
             h[hSize++] = v;
         }
killedBy: longer chain forced up
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/10.js:42:13
 
         mix[v] ^= u;
         deg[v]--;
-        if (deg[v] === 1) {
+        if (false) {
             h[hSize++] = v;
         }
killedBy: tiny chain
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: NaN

[Killed] UpdateOperator
solutions-descriptive/10.js:43:15
         mix[v] ^= u;
         deg[v]--;
         if (deg[v] === 1) {
-            h[hSize++] = v;
+            h[hSize--] = v;
         }
     }
killedBy: longer chain forced up
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: NaN

[Killed] ArithmeticOperator
solutions-descriptive/10.js:47:12
         }
     }
 
-    return ans + l[h[hPos]];
+    return ans - l[h[hPos]];
 }
 
killedBy: two node, same li=ri
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -3
