[Killed] ArithmeticOperator
solutions-descriptive/13.js:6:38
     const maxLength = 100001;
     const prefixSum = new Int32Array(maxLength);
     const transformed = new Int32Array(maxLength);
-    const frequency = new Int32Array(3 * maxLength); // offset applied during usage
+    const frequency = new Int32Array(3 / maxLength); // offset applied during usage
 
     for (const array of testCases) {
killedBy: single element arrays
statusReason: TypeError: Cannot convert undefined to a BigInt

[Killed] ArithmeticOperator
solutions-descriptive/13.js:10:30
 
     for (const array of testCases) {
         const length = array.length;
-        let totalSubarrays = BigInt(length) * BigInt(length + 1) / 2n;
+        let totalSubarrays = BigInt(length) * BigInt(length + 1) * 2n;
 
         for (let threshold = 1; threshold <= 10; threshold++) {
killedBy: single element arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   4,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:10:54
 
     for (const array of testCases) {
         const length = array.length;
-        let totalSubarrays = BigInt(length) * BigInt(length + 1) / 2n;
+        let totalSubarrays = BigInt(length) * BigInt(length - 1) / 2n;
 
         for (let threshold = 1; threshold <= 10; threshold++) {
killedBy: single element arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   0,

[Killed] ConditionalExpression
solutions-descriptive/13.js:12:33
         const length = array.length;
         let totalSubarrays = BigInt(length) * BigInt(length + 1) / 2n;
 
-        for (let threshold = 1; threshold <= 10; threshold++) {
+        for (let threshold = 1; false; threshold++) {
             let resetPointer = 0;
             prefixSum[0] = 0;
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] BlockStatement
solutions-descriptive/13.js:12:63
         const length = array.length;
         let totalSubarrays = BigInt(length) * BigInt(length + 1) / 2n;
 
-        for (let threshold = 1; threshold <= 10; threshold++) {
-            let resetPointer = 0;
-            prefixSum[0] = 0;
-
-            for (let i = 1; i <= length; i++) {
-                transformed[i] = array[i - 1] < threshold ? -1 : 1;
-                prefixSum[i] = transformed[i] + prefixSum[i - 1];
-            }
-
-            for (let i = 1; i <= length; i++) {
-                if (array[i - 1] === threshold) {
-                    while (resetPointer < i) {
-                        frequency[prefixSum[resetPointer] + 114514]++;
-                        resetPointer++;
-                    }
-                }
-                totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
-            }
-
-            for (let i = 0; i <= length; i++) {
-                frequency[prefixSum[i] + 114514] = 0;
-            }
-        }
+        for (let threshold = 1; threshold <= 10; threshold++) {}
 
         result.push(Number(totalSubarrays));
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] EqualityOperator
solutions-descriptive/13.js:16:29
             let resetPointer = 0;
             prefixSum[0] = 0;
 
-            for (let i = 1; i <= length; i++) {
+            for (let i = 1; i > length; i++) {
                 transformed[i] = array[i - 1] < threshold ? -1 : 1;
                 prefixSum[i] = transformed[i] + prefixSum[i - 1];
killedBy: single element arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   0,

[Killed] BlockStatement
solutions-descriptive/13.js:16:47
             let resetPointer = 0;
             prefixSum[0] = 0;
 
-            for (let i = 1; i <= length; i++) {
-                transformed[i] = array[i - 1] < threshold ? -1 : 1;
-                prefixSum[i] = transformed[i] + prefixSum[i - 1];
-            }
+            for (let i = 1; i <= length; i++) {}
 
             for (let i = 1; i <= length; i++) {
killedBy: single element arrays
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   0,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:17:40
             prefixSum[0] = 0;
 
             for (let i = 1; i <= length; i++) {
-                transformed[i] = array[i - 1] < threshold ? -1 : 1;
+                transformed[i] = array[i + 1] < threshold ? -1 : 1;
                 prefixSum[i] = transformed[i] + prefixSum[i - 1];
             }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] ConditionalExpression
solutions-descriptive/13.js:17:34
             prefixSum[0] = 0;
 
             for (let i = 1; i <= length; i++) {
-                transformed[i] = array[i - 1] < threshold ? -1 : 1;
+                transformed[i] = false ? -1 : 1;
                 prefixSum[i] = transformed[i] + prefixSum[i - 1];
             }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:18:59
 
             for (let i = 1; i <= length; i++) {
                 transformed[i] = array[i - 1] < threshold ? -1 : 1;
-                prefixSum[i] = transformed[i] + prefixSum[i - 1];
+                prefixSum[i] = transformed[i] + prefixSum[i + 1];
             }
 
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:18:32
 
             for (let i = 1; i <= length; i++) {
                 transformed[i] = array[i - 1] < threshold ? -1 : 1;
-                prefixSum[i] = transformed[i] + prefixSum[i - 1];
+                prefixSum[i] = transformed[i] - prefixSum[i - 1];
             }
 
killedBy: two element arrays with equal numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   3,
+   2,

[Killed] ConditionalExpression
solutions-descriptive/13.js:21:29
                 prefixSum[i] = transformed[i] + prefixSum[i - 1];
             }
 
-            for (let i = 1; i <= length; i++) {
+            for (let i = 1; false; i++) {
                 if (array[i - 1] === threshold) {
                     while (resetPointer < i) {
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] UpdateOperator
solutions-descriptive/13.js:21:42
                 prefixSum[i] = transformed[i] + prefixSum[i - 1];
             }
 
-            for (let i = 1; i <= length; i++) {
+            for (let i = 1; i <= length; i--) {
                 if (array[i - 1] === threshold) {
                     while (resetPointer < i) {
killedBy: single element arrays
statusReason: TypeError: Cannot convert undefined to a BigInt

[Killed] ConditionalExpression
solutions-descriptive/13.js:22:21
             }
 
             for (let i = 1; i <= length; i++) {
-                if (array[i - 1] === threshold) {
+                if (true) {
                     while (resetPointer < i) {
                         frequency[prefixSum[resetPointer] + 114514]++;
killedBy: small length arrays, odd and even
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   4,
+   3,

[Killed] BlockStatement
solutions-descriptive/13.js:22:49
             }
 
             for (let i = 1; i <= length; i++) {
-                if (array[i - 1] === threshold) {
-                    while (resetPointer < i) {
-                        frequency[prefixSum[resetPointer] + 114514]++;
-                        resetPointer++;
-                    }
-                }
+                if (array[i - 1] === threshold) {}
                 totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
             }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] ConditionalExpression
solutions-descriptive/13.js:23:28
 
             for (let i = 1; i <= length; i++) {
                 if (array[i - 1] === threshold) {
-                    while (resetPointer < i) {
+                    while (false) {
                         frequency[prefixSum[resetPointer] + 114514]++;
                         resetPointer++;
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] EqualityOperator
solutions-descriptive/13.js:23:28
 
             for (let i = 1; i <= length; i++) {
                 if (array[i - 1] === threshold) {
-                    while (resetPointer < i) {
+                    while (resetPointer >= i) {
                         frequency[prefixSum[resetPointer] + 114514]++;
                         resetPointer++;
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:24:35
             for (let i = 1; i <= length; i++) {
                 if (array[i - 1] === threshold) {
                     while (resetPointer < i) {
-                        frequency[prefixSum[resetPointer] + 114514]++;
+                        frequency[prefixSum[resetPointer] - 114514]++;
                         resetPointer++;
                     }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   3,

[Killed] UpdateOperator
solutions-descriptive/13.js:24:25
             for (let i = 1; i <= length; i++) {
                 if (array[i - 1] === threshold) {
                     while (resetPointer < i) {
-                        frequency[prefixSum[resetPointer] + 114514]++;
+                        frequency[prefixSum[resetPointer] + 114514]--;
                         resetPointer++;
                     }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   4,

[Timeout] UpdateOperator
solutions-descriptive/13.js:25:25
                 if (array[i - 1] === threshold) {
                     while (resetPointer < i) {
                         frequency[prefixSum[resetPointer] + 114514]++;
-                        resetPointer++;
+                        resetPointer--;
                     }
                 }

[Killed] AssignmentOperator
solutions-descriptive/13.js:28:17
                         resetPointer++;
                     }
                 }
-                totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
+                totalSubarrays += BigInt(frequency[prefixSum[i] + 114514]);
             }
 
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   4,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:28:52
                         resetPointer++;
                     }
                 }
-                totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
+                totalSubarrays -= BigInt(frequency[prefixSum[i] - 114514]);
             }
 
killedBy: single element arrays
statusReason: TypeError: Cannot convert undefined to a BigInt

[Killed] ConditionalExpression
solutions-descriptive/13.js:31:29
                 totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
             }
 
-            for (let i = 0; i <= length; i++) {
+            for (let i = 0; false; i++) {
                 frequency[prefixSum[i] + 114514] = 0;
             }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   -7,

[Killed] EqualityOperator
solutions-descriptive/13.js:31:29
                 totalSubarrays -= BigInt(frequency[prefixSum[i] + 114514]);
             }
 
-            for (let i = 0; i <= length; i++) {
+            for (let i = 0; i > length; i++) {
                 frequency[prefixSum[i] + 114514] = 0;
             }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   -7,

[Killed] ArithmeticOperator
solutions-descriptive/13.js:32:27
             }
 
             for (let i = 0; i <= length; i++) {
-                frequency[prefixSum[i] + 114514] = 0;
+                frequency[prefixSum[i] - 114514] = 0;
             }
         }
killedBy: two element arrays with different numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   -7,
