[Killed] AssignmentOperator
solutions-descriptive/14.js:49:5
 
 
 export function solve(stopCount, stepSize, totalLength, stopPositions) {
-    stepSize *= 2;
+    stepSize /= 2;
     totalLength *= 2;
     stopPositions = stopPositions.map(position => position * 2);
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 8.5

[Killed] AssignmentOperator
solutions-descriptive/14.js:50:5
 
 export function solve(stopCount, stepSize, totalLength, stopPositions) {
     stepSize *= 2;
-    totalLength *= 2;
+    totalLength /= 2;
     stopPositions = stopPositions.map(position => position * 2);
 
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/14.js:51:51
 export function solve(stopCount, stepSize, totalLength, stopPositions) {
     stepSize *= 2;
     totalLength *= 2;
-    stopPositions = stopPositions.map(position => position * 2);
+    stopPositions = stopPositions.map(position => position / 2);
 
     let currentTime = 0;
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3.5

[Killed] ArrowFunction
solutions-descriptive/14.js:51:39
 export function solve(stopCount, stepSize, totalLength, stopPositions) {
     stepSize *= 2;
     totalLength *= 2;
-    stopPositions = stopPositions.map(position => position * 2);
+    stopPositions = stopPositions.map(() => undefined);
 
     let currentTime = 0;
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/14.js:56:21
     let currentTime = 0;
     let currentPosition = 0;
 
-    for (let i = 0; i < stopCount; i++) {
+    for (let i = 0; i <= stopCount; i++) {
         if (currentPosition < stopPositions[i] - currentTime) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/14.js:56:21
     let currentTime = 0;
     let currentPosition = 0;
 
-    for (let i = 0; i < stopCount; i++) {
+    for (let i = 0; i >= stopCount; i++) {
         if (currentPosition < stopPositions[i] - currentTime) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 10

[Killed] ConditionalExpression
solutions-descriptive/14.js:57:13
     let currentPosition = 0;
 
     for (let i = 0; i < stopCount; i++) {
-        if (currentPosition < stopPositions[i] - currentTime) {
+        if (false) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
 
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/14.js:57:13
     let currentPosition = 0;
 
     for (let i = 0; i < stopCount; i++) {
-        if (currentPosition < stopPositions[i] - currentTime) {
+        if (true) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
 
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 3

[Killed] ArithmeticOperator
solutions-descriptive/14.js:58:33
 
     for (let i = 0; i < stopCount; i++) {
         if (currentPosition < stopPositions[i] - currentTime) {
-            let requiredSteps = stopPositions[i] - currentTime - currentPosition;
+            let requiredSteps = stopPositions[i] - currentTime + currentPosition;
 
             if (i > 0) {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 9

[Killed] ArithmeticOperator
solutions-descriptive/14.js:58:33
 
     for (let i = 0; i < stopCount; i++) {
         if (currentPosition < stopPositions[i] - currentTime) {
-            let requiredSteps = stopPositions[i] - currentTime - currentPosition;
+            let requiredSteps = stopPositions[i] + currentTime - currentPosition;
 
             if (i > 0) {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 9

[Killed] ConditionalExpression
solutions-descriptive/14.js:60:17
         if (currentPosition < stopPositions[i] - currentTime) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
 
-            if (i > 0) {
+            if (true) {
                 requiredSteps = Math.floor(requiredSteps / 2);
             }
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] BlockStatement
solutions-descriptive/14.js:60:24
         if (currentPosition < stopPositions[i] - currentTime) {
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
 
-            if (i > 0) {
-                requiredSteps = Math.floor(requiredSteps / 2);
-            }
+            if (i > 0) {}
 
             currentTime += requiredSteps;
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 6

[Killed] ArithmeticOperator
solutions-descriptive/14.js:61:44
             let requiredSteps = stopPositions[i] - currentTime - currentPosition;
 
             if (i > 0) {
-                requiredSteps = Math.floor(requiredSteps / 2);
+                requiredSteps = Math.floor(requiredSteps * 2);
             }
 
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 8

[Killed] AssignmentOperator
solutions-descriptive/14.js:64:13
                 requiredSteps = Math.floor(requiredSteps / 2);
             }
 
-            currentTime += requiredSteps;
+            currentTime -= requiredSteps;
 
             if (i > 0) {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -12

[Killed] EqualityOperator
solutions-descriptive/14.js:66:17
 
             currentTime += requiredSteps;
 
-            if (i > 0) {
+            if (i >= 0) {
                 currentPosition += requiredSteps + stepSize;
             } else {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] EqualityOperator
solutions-descriptive/14.js:66:17
 
             currentTime += requiredSteps;
 
-            if (i > 0) {
+            if (i <= 0) {
                 currentPosition += requiredSteps + stepSize;
             } else {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] ArithmeticOperator
solutions-descriptive/14.js:67:36
             currentTime += requiredSteps;
 
             if (i > 0) {
-                currentPosition += requiredSteps + stepSize;
+                currentPosition += requiredSteps - stepSize;
             } else {
                 currentPosition = stepSize;
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 18

[Killed] AssignmentOperator
solutions-descriptive/14.js:67:17
             currentTime += requiredSteps;
 
             if (i > 0) {
-                currentPosition += requiredSteps + stepSize;
+                currentPosition -= requiredSteps + stepSize;
             } else {
                 currentPosition = stepSize;
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 26

[Killed] BlockStatement
solutions-descriptive/14.js:68:20
 
             if (i > 0) {
                 currentPosition += requiredSteps + stepSize;
-            } else {
-                currentPosition = stepSize;
-            }
+            } else {}
 
         } else {
killedBy: Multiple scarecrows, k=2, l=5, a=[2,5,5]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 7

[Killed] BlockStatement
solutions-descriptive/14.js:72:16
                 currentPosition = stepSize;
             }
 
-        } else {
-            currentPosition = Math.max(
-                currentPosition,
-                Math.min(currentPosition, stopPositions[i] + currentTime) + stepSize
-            );
-        }
+        } else {}
     }
 
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 10

[Killed] MethodExpression
solutions-descriptive/14.js:73:31
             }
 
         } else {
-            currentPosition = Math.max(
-                currentPosition,
-                Math.min(currentPosition, stopPositions[i] + currentTime) + stepSize
-            );
+            currentPosition = Math.min(currentPosition, Math.min(currentPosition, stopPositions[i] + currentTime) + stepSize);
         }
     }
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 10

[Killed] MethodExpression
solutions-descriptive/14.js:75:17
         } else {
             currentPosition = Math.max(
                 currentPosition,
-                Math.min(currentPosition, stopPositions[i] + currentTime) + stepSize
+                Math.max(currentPosition, stopPositions[i] + currentTime) + stepSize
             );
         }
killedBy: Two scarecrows both at 0, k=1, l=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/14.js:75:17
         } else {
             currentPosition = Math.max(
                 currentPosition,
-                Math.min(currentPosition, stopPositions[i] + currentTime) + stepSize
+                Math.min(currentPosition, stopPositions[i] + currentTime) - stepSize
             );
         }
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 10

[Killed] ArithmeticOperator
solutions-descriptive/14.js:80:12
         }
     }
 
-    return currentTime + Math.max(totalLength - currentPosition, 0);
+    return currentTime - Math.max(totalLength - currentPosition, 0);
 }
 
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: -4

[Killed] MethodExpression
solutions-descriptive/14.js:80:26
         }
     }
 
-    return currentTime + Math.max(totalLength - currentPosition, 0);
+    return currentTime + Math.min(totalLength - currentPosition, 0);
 }
 
killedBy: Single scarecrow at 0, k=3, l=5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0
