[Survived] ArithmeticOperator
solutions-descriptive/15.js:2:24
 export function solve(arraySize, currentPosition, queryCount, selectedIndices) {
-    let leftBoundary = arraySize + 1;
+    let leftBoundary = arraySize - 1;
     let rightBoundary = 0;
     let leftMid = currentPosition;

[Survived] BooleanLiteral
solutions-descriptive/15.js:6:29
     let rightBoundary = 0;
     let leftMid = currentPosition;
     let rightMid = currentPosition;
-    let hasMiddleSelected = false;
+    let hasMiddleSelected = true;
     let middleSkipped = false;
 

[Killed] BooleanLiteral
solutions-descriptive/15.js:7:25
     let leftMid = currentPosition;
     let rightMid = currentPosition;
     let hasMiddleSelected = false;
-    let middleSkipped = false;
+    let middleSkipped = true;
 
     const result = Array(queryCount);
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "0 0"

[Killed] EqualityOperator
solutions-descriptive/15.js:11:21
 
     const result = Array(queryCount);
 
-    for (let i = 0; i < queryCount; i++) {
+    for (let i = 0; i >= queryCount; i++) {
         const selectedIndex = selectedIndices[i];
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: " "

[Killed] EqualityOperator
solutions-descriptive/15.js:11:21
 
     const result = Array(queryCount);
 
-    for (let i = 0; i < queryCount; i++) {
+    for (let i = 0; i <= queryCount; i++) {
         const selectedIndex = selectedIndices[i];
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "2 2 2"

[Survived] BlockStatement
solutions-descriptive/15.js:14:32
     for (let i = 0; i < queryCount; i++) {
         const selectedIndex = selectedIndices[i];
 
-        if (hasMiddleSelected) {
-            if (selectedIndex < leftBoundary) leftBoundary--;
-            if (selectedIndex > rightBoundary) rightBoundary++;
-        }
+        if (hasMiddleSelected) {}
 
         if (!middleSkipped) {

[Survived] ConditionalExpression
solutions-descriptive/15.js:14:13
     for (let i = 0; i < queryCount; i++) {
         const selectedIndex = selectedIndices[i];
 
-        if (hasMiddleSelected) {
+        if (true) {
             if (selectedIndex < leftBoundary) leftBoundary--;
             if (selectedIndex > rightBoundary) rightBoundary++;

[Survived] ConditionalExpression
solutions-descriptive/15.js:15:17
         const selectedIndex = selectedIndices[i];
 
         if (hasMiddleSelected) {
-            if (selectedIndex < leftBoundary) leftBoundary--;
+            if (true) leftBoundary--;
             if (selectedIndex > rightBoundary) rightBoundary++;
         }

[Survived] EqualityOperator
solutions-descriptive/15.js:15:17
         const selectedIndex = selectedIndices[i];
 
         if (hasMiddleSelected) {
-            if (selectedIndex < leftBoundary) leftBoundary--;
+            if (selectedIndex <= leftBoundary) leftBoundary--;
             if (selectedIndex > rightBoundary) rightBoundary++;
         }

[Survived] EqualityOperator
solutions-descriptive/15.js:16:17
 
         if (hasMiddleSelected) {
             if (selectedIndex < leftBoundary) leftBoundary--;
-            if (selectedIndex > rightBoundary) rightBoundary++;
+            if (selectedIndex >= rightBoundary) rightBoundary++;
         }
 

[Survived] ConditionalExpression
solutions-descriptive/15.js:16:17
 
         if (hasMiddleSelected) {
             if (selectedIndex < leftBoundary) leftBoundary--;
-            if (selectedIndex > rightBoundary) rightBoundary++;
+            if (true) rightBoundary++;
         }
 

[Killed] ConditionalExpression
solutions-descriptive/15.js:19:13
             if (selectedIndex > rightBoundary) rightBoundary++;
         }
 
-        if (!middleSkipped) {
+        if (false) {
             if (selectedIndex < leftMid) {
                 leftMid--;
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "1 1"

[Killed] BlockStatement
solutions-descriptive/15.js:19:29
             if (selectedIndex > rightBoundary) rightBoundary++;
         }
 
-        if (!middleSkipped) {
-            if (selectedIndex < leftMid) {
-                leftMid--;
-            } else if (selectedIndex > rightMid) {
-                rightMid++;
-            } else {
-                if (leftMid === rightMid) {
-                    middleSkipped = true;
-                }
-                hasMiddleSelected = true;
-                leftBoundary = Math.min(leftBoundary, arraySize);
-                rightBoundary = Math.max(rightBoundary, 1);
-            }
-        }
+        if (!middleSkipped) {}
 
         let visibleElements = 0;
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "1 1"

[Killed] EqualityOperator
solutions-descriptive/15.js:20:17
         }
 
         if (!middleSkipped) {
-            if (selectedIndex < leftMid) {
+            if (selectedIndex >= leftMid) {
                 leftMid--;
             } else if (selectedIndex > rightMid) {
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "1 1"

[Killed] ConditionalExpression
solutions-descriptive/15.js:20:17
         }
 
         if (!middleSkipped) {
-            if (selectedIndex < leftMid) {
+            if (true) {
                 leftMid--;
             } else if (selectedIndex > rightMid) {
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "1 1"

[Survived] UpdateOperator
solutions-descriptive/15.js:21:17
 
         if (!middleSkipped) {
             if (selectedIndex < leftMid) {
-                leftMid--;
+                leftMid++;
             } else if (selectedIndex > rightMid) {
                 rightMid++;

[Killed] BlockStatement
solutions-descriptive/15.js:22:50
         if (!middleSkipped) {
             if (selectedIndex < leftMid) {
                 leftMid--;
-            } else if (selectedIndex > rightMid) {
-                rightMid++;
-            } else {
+            } else if (selectedIndex > rightMid) {} else {
                 if (leftMid === rightMid) {
                     middleSkipped = true;
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "1 2"

[Survived] EqualityOperator
solutions-descriptive/15.js:22:24
         if (!middleSkipped) {
             if (selectedIndex < leftMid) {
                 leftMid--;
-            } else if (selectedIndex > rightMid) {
+            } else if (selectedIndex <= rightMid) {
                 rightMid++;
             } else {

[Killed] UpdateOperator
solutions-descriptive/15.js:23:17
             if (selectedIndex < leftMid) {
                 leftMid--;
             } else if (selectedIndex > rightMid) {
-                rightMid++;
+                rightMid--;
             } else {
                 if (leftMid === rightMid) {
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "0 -1"

[Survived] BlockStatement
solutions-descriptive/15.js:24:20
                 leftMid--;
             } else if (selectedIndex > rightMid) {
                 rightMid++;
-            } else {
-                if (leftMid === rightMid) {
-                    middleSkipped = true;
-                }
-                hasMiddleSelected = true;
-                leftBoundary = Math.min(leftBoundary, arraySize);
-                rightBoundary = Math.max(rightBoundary, 1);
-            }
+            } else {}
         }
 

[Survived] BlockStatement
solutions-descriptive/15.js:25:43
             } else if (selectedIndex > rightMid) {
                 rightMid++;
             } else {
-                if (leftMid === rightMid) {
-                    middleSkipped = true;
-                }
+                if (leftMid === rightMid) {}
                 hasMiddleSelected = true;
                 leftBoundary = Math.min(leftBoundary, arraySize);

[Survived] ConditionalExpression
solutions-descriptive/15.js:25:21
             } else if (selectedIndex > rightMid) {
                 rightMid++;
             } else {
-                if (leftMid === rightMid) {
+                if (true) {
                     middleSkipped = true;
                 }

[Survived] BooleanLiteral
solutions-descriptive/15.js:26:37
                 rightMid++;
             } else {
                 if (leftMid === rightMid) {
-                    middleSkipped = true;
+                    middleSkipped = false;
                 }
                 hasMiddleSelected = true;

[Survived] BooleanLiteral
solutions-descriptive/15.js:28:37
                 if (leftMid === rightMid) {
                     middleSkipped = true;
                 }
-                hasMiddleSelected = true;
+                hasMiddleSelected = false;
                 leftBoundary = Math.min(leftBoundary, arraySize);
                 rightBoundary = Math.max(rightBoundary, 1);

[Survived] MethodExpression
solutions-descriptive/15.js:29:32
                     middleSkipped = true;
                 }
                 hasMiddleSelected = true;
-                leftBoundary = Math.min(leftBoundary, arraySize);
+                leftBoundary = Math.max(leftBoundary, arraySize);
                 rightBoundary = Math.max(rightBoundary, 1);
             }

[Survived] MethodExpression
solutions-descriptive/15.js:30:33
                 }
                 hasMiddleSelected = true;
                 leftBoundary = Math.min(leftBoundary, arraySize);
-                rightBoundary = Math.max(rightBoundary, 1);
+                rightBoundary = Math.min(rightBoundary, 1);
             }
         }

[Killed] ConditionalExpression
solutions-descriptive/15.js:36:13
 
         let visibleElements = 0;
 
-        if (middleSkipped) {
+        if (true) {
             visibleElements += countRange(1, rightBoundary);
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "0 2"

[Survived] ConditionalExpression
solutions-descriptive/15.js:36:13
 
         let visibleElements = 0;
 
-        if (middleSkipped) {
+        if (false) {
             visibleElements += countRange(1, rightBoundary);
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);

[Survived] AssignmentOperator
solutions-descriptive/15.js:37:13
         let visibleElements = 0;
 
         if (middleSkipped) {
-            visibleElements += countRange(1, rightBoundary);
+            visibleElements -= countRange(1, rightBoundary);
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
         } else {

[Survived] ArithmeticOperator
solutions-descriptive/15.js:38:66
 
         if (middleSkipped) {
             visibleElements += countRange(1, rightBoundary);
-            visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
+            visibleElements += countRange(Math.max(leftBoundary, rightBoundary - 1), arraySize);
         } else {
             visibleElements += countRange(leftMid, rightMid);

[Survived] MethodExpression
solutions-descriptive/15.js:38:43
 
         if (middleSkipped) {
             visibleElements += countRange(1, rightBoundary);
-            visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
+            visibleElements += countRange(Math.min(leftBoundary, rightBoundary + 1), arraySize);
         } else {
             visibleElements += countRange(leftMid, rightMid);

[Killed] BlockStatement
solutions-descriptive/15.js:39:16
         if (middleSkipped) {
             visibleElements += countRange(1, rightBoundary);
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
-        } else {
-            visibleElements += countRange(leftMid, rightMid);
-            visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
-            visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
-        }
+        } else {}
 
         result[i] = visibleElements;
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "0 0"

[Killed] AssignmentOperator
solutions-descriptive/15.js:40:13
             visibleElements += countRange(1, rightBoundary);
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
         } else {
-            visibleElements += countRange(leftMid, rightMid);
+            visibleElements -= countRange(leftMid, rightMid);
             visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
             visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "-2 -2"

[Killed] ArithmeticOperator
solutions-descriptive/15.js:41:70
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
         } else {
             visibleElements += countRange(leftMid, rightMid);
-            visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
+            visibleElements += countRange(1, Math.min(rightBoundary, leftMid + 1));
             visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
         }
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "2 3"

[Killed] MethodExpression
solutions-descriptive/15.js:41:46
             visibleElements += countRange(Math.max(leftBoundary, rightBoundary + 1), arraySize);
         } else {
             visibleElements += countRange(leftMid, rightMid);
-            visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
+            visibleElements += countRange(1, Math.max(rightBoundary, leftMid - 1));
             visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
         }
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "2 3"

[Killed] MethodExpression
solutions-descriptive/15.js:42:43
         } else {
             visibleElements += countRange(leftMid, rightMid);
             visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
-            visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
+            visibleElements += countRange(Math.min(leftBoundary, rightMid + 1), arraySize);
         }
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "2 3"

[Killed] ArithmeticOperator
solutions-descriptive/15.js:42:66
         } else {
             visibleElements += countRange(leftMid, rightMid);
             visibleElements += countRange(1, Math.min(rightBoundary, leftMid - 1));
-            visibleElements += countRange(Math.max(leftBoundary, rightMid + 1), arraySize);
+            visibleElements += countRange(Math.max(leftBoundary, rightMid - 1), arraySize);
         }
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "2 3"

[Killed] StringLiteral
solutions-descriptive/15.js:48:24
         result[i] = visibleElements;
     }
 
-    return result.join(' ');
+    return result.join("");
 }
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "22"

[Killed] BlockStatement
solutions-descriptive/15.js:51:33
     return result.join(' ');
 }
 
-function countRange(start, end) {
-    return end - start + 1;
-}
+function countRange(start, end) {}
 
 // function testing_test() {
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "NaN NaN"

[Killed] ArithmeticOperator
solutions-descriptive/15.js:52:12
 }
 
 function countRange(start, end) {
-    return end - start + 1;
+    return end + start + 1;
 }
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "12 12"

[Killed] ArithmeticOperator
solutions-descriptive/15.js:52:12
 }
 
 function countRange(start, end) {
-    return end - start + 1;
+    return end - start - 1;
 }
 
killedBy: minimal size deck
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2 2"
Received: "-4 -4"
