[Killed] BlockStatement
solutions-descriptive/16.js:2:28
 // -------------------- Helper --------------------
-function minPicks(v, need) {
-    let count = 0, sum = 0;
-    for (let x of v) {
-        if (sum >= need) break;
-        sum += x;
-        count++;
-    }
-    return (sum >= need) ? count : 1000000000;
-}
+function minPicks(v, need) {}
 
 // -------------------- Core Logic --------------------
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] BlockStatement
solutions-descriptive/16.js:4:22
 // -------------------- Helper --------------------
 function minPicks(v, need) {
     let count = 0, sum = 0;
-    for (let x of v) {
-        if (sum >= need) break;
-        sum += x;
-        count++;
-    }
+    for (let x of v) {}
     return (sum >= need) ? count : 1000000000;
 }
killedBy: only singletons allowed: s="ABAB", big a and b, ab=0, ba=0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:5:13
 function minPicks(v, need) {
     let count = 0, sum = 0;
     for (let x of v) {
-        if (sum >= need) break;
+        if (sum < need) break;
         sum += x;
         count++;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:5:13
 function minPicks(v, need) {
     let count = 0, sum = 0;
     for (let x of v) {
-        if (sum >= need) break;
+        if (sum > need) break;
         sum += x;
         count++;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] AssignmentOperator
solutions-descriptive/16.js:6:9
     let count = 0, sum = 0;
     for (let x of v) {
         if (sum >= need) break;
-        sum += x;
+        sum -= x;
         count++;
     }
killedBy: only singletons allowed: s="ABAB", big a and b, ab=0, ba=0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] UpdateOperator
solutions-descriptive/16.js:7:9
     for (let x of v) {
         if (sum >= need) break;
         sum += x;
-        count++;
+        count--;
     }
     return (sum >= need) ? count : 1000000000;

[Killed] ConditionalExpression
solutions-descriptive/16.js:9:13
         sum += x;
         count++;
     }
-    return (sum >= need) ? count : 1000000000;
+    return (false) ? count : 1000000000;
 }
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:9:13
         sum += x;
         count++;
     }
-    return (sum >= need) ? count : 1000000000;
+    return (sum < need) ? count : 1000000000;
 }
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:14:19
 
 // -------------------- Core Logic --------------------
 function canTransform(s, a, b, ab, ba) {
-    let totalA = (s.match(/A/g) || []).length;
+    let totalA = (false).length;
     let totalB = (s.match(/B/g) || []).length;
     let m = Math.max(totalA - a, totalB - b, 0);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:14:19
 
 // -------------------- Core Logic --------------------
 function canTransform(s, a, b, ab, ba) {
-    let totalA = (s.match(/A/g) || []).length;
+    let totalA = (true).length;
     let totalB = (s.match(/B/g) || []).length;
     let m = Math.max(totalA - a, totalB - b, 0);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:15:19
 // -------------------- Core Logic --------------------
 function canTransform(s, a, b, ab, ba) {
     let totalA = (s.match(/A/g) || []).length;
-    let totalB = (s.match(/B/g) || []).length;
+    let totalB = (false).length;
     let m = Math.max(totalA - a, totalB - b, 0);
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:15:19
 // -------------------- Core Logic --------------------
 function canTransform(s, a, b, ab, ba) {
     let totalA = (s.match(/A/g) || []).length;
-    let totalB = (s.match(/B/g) || []).length;
+    let totalB = (true).length;
     let m = Math.max(totalA - a, totalB - b, 0);
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ArithmeticOperator
solutions-descriptive/16.js:16:34
 function canTransform(s, a, b, ab, ba) {
     let totalA = (s.match(/A/g) || []).length;
     let totalB = (s.match(/B/g) || []).length;
-    let m = Math.max(totalA - a, totalB - b, 0);
+    let m = Math.max(totalA - a, totalB + b, 0);
 
     let totalPairs = 0;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ArithmeticOperator
solutions-descriptive/16.js:16:22
 function canTransform(s, a, b, ab, ba) {
     let totalA = (s.match(/A/g) || []).length;
     let totalB = (s.match(/B/g) || []).length;
-    let m = Math.max(totalA - a, totalB - b, 0);
+    let m = Math.max(totalA + a, totalB - b, 0);
 
     let totalPairs = 0;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:24:12
 
     const n = s.length;
     let i = 0;
-    while (i < n) {
+    while (i >= n) {
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:24:12
 
     const n = s.length;
     let i = 0;
-    while (i < n) {
+    while (false) {
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ArithmeticOperator
solutions-descriptive/16.js:26:31
     let i = 0;
     while (i < n) {
         let j = i;
-        while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
+        while (j + 1 < n && s[j - 1] !== s[j]) { j++; }
         let len = j - i + 1;
         if (len >= 2) {
killedBy: needs to use full ab and ba: s="ABBAAB", a=0, b=0, ab=2, ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:26:16
     let i = 0;
     while (i < n) {
         let j = i;
-        while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
+        while (j + 1 >= n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
         if (len >= 2) {
killedBy: needs to use full ab and ba: s="ABBAAB", a=0, b=0, ab=2, ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ArithmeticOperator
solutions-descriptive/16.js:27:19
     while (i < n) {
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
-        let len = j - i + 1;
+        let len = j - i - 1;
         if (len >= 2) {
             let p = Math.floor(len / 2);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/16.js:27:19
     while (i < n) {
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
-        let len = j - i + 1;
+        let len = j + i + 1;
         if (len >= 2) {
             let p = Math.floor(len / 2);

[Killed] EqualityOperator
solutions-descriptive/16.js:28:13
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
-        if (len >= 2) {
+        if (len > 2) {
             let p = Math.floor(len / 2);
             totalPairs += p;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:28:13
         let j = i;
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
-        if (len >= 2) {
+        if (false) {
             let p = Math.floor(len / 2);
             totalPairs += p;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/16.js:29:32
         while (j + 1 < n && s[j + 1] !== s[j]) { j++; }
         let len = j - i + 1;
         if (len >= 2) {
-            let p = Math.floor(len / 2);
+            let p = Math.floor(len * 2);
             totalPairs += p;
             if (len % 2 === 1) {

[Killed] AssignmentOperator
solutions-descriptive/16.js:30:13
         let len = j - i + 1;
         if (len >= 2) {
             let p = Math.floor(len / 2);
-            totalPairs += p;
+            totalPairs -= p;
             if (len % 2 === 1) {
                 addOdd += p;
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] BlockStatement
solutions-descriptive/16.js:31:32
         if (len >= 2) {
             let p = Math.floor(len / 2);
             totalPairs += p;
-            if (len % 2 === 1) {
-                addOdd += p;
-            } else {
+            if (len % 2 === 1) {} else {
                 if (s[i] === 'A') evenA.push(p);
                 else evenB.push(p);

[Survived] ArithmeticOperator
solutions-descriptive/16.js:31:17
         if (len >= 2) {
             let p = Math.floor(len / 2);
             totalPairs += p;
-            if (len % 2 === 1) {
+            if (len * 2 === 1) {
                 addOdd += p;
             } else {

[Survived] AssignmentOperator
solutions-descriptive/16.js:32:17
             let p = Math.floor(len / 2);
             totalPairs += p;
             if (len % 2 === 1) {
-                addOdd += p;
+                addOdd -= p;
             } else {
                 if (s[i] === 'A') evenA.push(p);

[Survived] BlockStatement
solutions-descriptive/16.js:33:20
             totalPairs += p;
             if (len % 2 === 1) {
                 addOdd += p;
-            } else {
-                if (s[i] === 'A') evenA.push(p);
-                else evenB.push(p);
-            }
+            } else {}
         }
         i = j + 1;

[Killed] EqualityOperator
solutions-descriptive/16.js:34:21
             if (len % 2 === 1) {
                 addOdd += p;
             } else {
-                if (s[i] === 'A') evenA.push(p);
+                if (s[i] !== 'A') evenA.push(p);
                 else evenB.push(p);
             }
killedBy: needs to use full ab and ba: s="ABBAAB", a=0, b=0, ab=2, ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] ConditionalExpression
solutions-descriptive/16.js:34:21
             if (len % 2 === 1) {
                 addOdd += p;
             } else {
-                if (s[i] === 'A') evenA.push(p);
+                if (true) evenA.push(p);
                 else evenB.push(p);
             }
killedBy: needs to use full ab and ba: s="ABBAAB", a=0, b=0, ab=2, ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Timeout] ArithmeticOperator
solutions-descriptive/16.js:38:13
                 else evenB.push(p);
             }
         }
-        i = j + 1;
+        i = j - 1;
     }
 

[Killed] EqualityOperator
solutions-descriptive/16.js:41:27
         i = j + 1;
     }
 
-    if (totalPairs < m || m > ab + ba) {
+    if (totalPairs < m || m <= ab + ba) {
         return "NO";
     }
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:41:27
         i = j + 1;
     }
 
-    if (totalPairs < m || m > ab + ba) {
+    if (totalPairs < m || m >= ab + ba) {
         return "NO";
     }
killedBy: single character string: s = "A", a=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] StringLiteral
solutions-descriptive/16.js:42:16
     }
 
     if (totalPairs < m || m > ab + ba) {
-        return "NO";
+        return "";
     }
 
killedBy: single character string: s = "A", all counts 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NO"
Received: ""

[Survived] ArithmeticOperator
solutions-descriptive/16.js:45:25
         return "NO";
     }
 
-    let availableDrop = totalPairs - m;
+    let availableDrop = totalPairs + m;
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
     let needA = Math.max(sumA - ab, 0);

[Killed] ArrowFunction
solutions-descriptive/16.js:46:29
     }
 
     let availableDrop = totalPairs - m;
-    let sumA = evenA.reduce((acc, val) => acc + val, 0);
+    let sumA = evenA.reduce(() => undefined, 0);
     let needA = Math.max(sumA - ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/16.js:46:43
     }
 
     let availableDrop = totalPairs - m;
-    let sumA = evenA.reduce((acc, val) => acc + val, 0);
+    let sumA = evenA.reduce((acc, val) => acc - val, 0);
     let needA = Math.max(sumA - ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);

[Killed] ArithmeticOperator
solutions-descriptive/16.js:47:26
 
     let availableDrop = totalPairs - m;
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
-    let needA = Math.max(sumA - ab, 0);
+    let needA = Math.max(sumA + ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
     let needB = Math.max(sumB - ba, 0);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] MethodExpression
solutions-descriptive/16.js:47:17
 
     let availableDrop = totalPairs - m;
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
-    let needA = Math.max(sumA - ab, 0);
+    let needA = Math.min(sumA - ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
     let needB = Math.max(sumB - ba, 0);

[Killed] ArrowFunction
solutions-descriptive/16.js:48:29
     let availableDrop = totalPairs - m;
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
     let needA = Math.max(sumA - ab, 0);
-    let sumB = evenB.reduce((acc, val) => acc + val, 0);
+    let sumB = evenB.reduce(() => undefined, 0);
     let needB = Math.max(sumB - ba, 0);
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] ArithmeticOperator
solutions-descriptive/16.js:48:43
     let availableDrop = totalPairs - m;
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
     let needA = Math.max(sumA - ab, 0);
-    let sumB = evenB.reduce((acc, val) => acc + val, 0);
+    let sumB = evenB.reduce((acc, val) => acc - val, 0);
     let needB = Math.max(sumB - ba, 0);
 

[Killed] ArithmeticOperator
solutions-descriptive/16.js:49:26
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
     let needA = Math.max(sumA - ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
-    let needB = Math.max(sumB - ba, 0);
+    let needB = Math.max(sumB + ba, 0);
 
     evenA.sort((x, y) => y - x);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] MethodExpression
solutions-descriptive/16.js:49:17
     let sumA = evenA.reduce((acc, val) => acc + val, 0);
     let needA = Math.max(sumA - ab, 0);
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
-    let needB = Math.max(sumB - ba, 0);
+    let needB = Math.min(sumB - ba, 0);
 
     evenA.sort((x, y) => y - x);

[Survived] ArrowFunction
solutions-descriptive/16.js:51:16
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
     let needB = Math.max(sumB - ba, 0);
 
-    evenA.sort((x, y) => y - x);
+    evenA.sort(() => undefined);
     evenB.sort((x, y) => y - x);
 

[Survived] ArithmeticOperator
solutions-descriptive/16.js:51:26
     let sumB = evenB.reduce((acc, val) => acc + val, 0);
     let needB = Math.max(sumB - ba, 0);
 
-    evenA.sort((x, y) => y - x);
+    evenA.sort((x, y) => y + x);
     evenB.sort((x, y) => y - x);
 

[Survived] MethodExpression
solutions-descriptive/16.js:52:5
     let needB = Math.max(sumB - ba, 0);
 
     evenA.sort((x, y) => y - x);
-    evenB.sort((x, y) => y - x);
+    evenB;
 
     let dA = minPicks(evenA, needA);

[Survived] ArrowFunction
solutions-descriptive/16.js:52:16
     let needB = Math.max(sumB - ba, 0);
 
     evenA.sort((x, y) => y - x);
-    evenB.sort((x, y) => y - x);
+    evenB.sort(() => undefined);
 
     let dA = minPicks(evenA, needA);

[Killed] EqualityOperator
solutions-descriptive/16.js:57:12
     let dA = minPicks(evenA, needA);
     let dB = minPicks(evenB, needB);
 
-    return (dA + dB) <= availableDrop ? "YES" : "NO";
+    return dA + dB < availableDrop ? "YES" : "NO";
 }
 
killedBy: single character string: s = "A", a=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:57:12
     let dA = minPicks(evenA, needA);
     let dB = minPicks(evenB, needB);
 
-    return (dA + dB) <= availableDrop ? "YES" : "NO";
+    return dA + dB > availableDrop ? "YES" : "NO";
 }
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] BlockStatement
solutions-descriptive/16.js:61:30
 }
 
 // -------------------- Exported Solve --------------------
-export function solve(input) {
-    let lines = input.trim().split("\n");
-    let s = lines[0].trim();
-    let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);
-
-    // default to 0 if not provided
-    let [a, b, ab, ba] = [0, 0, 0, 0];
-    if (nums.length > 0) [a, b, ab, ba] = nums;
-
-    return canTransform(s, a, b, ab, ba);
-}
+export function solve(input) {}
 
 
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: undefined

[Survived] MethodExpression
solutions-descriptive/16.js:62:17
 
 // -------------------- Exported Solve --------------------
 export function solve(input) {
-    let lines = input.trim().split("\n");
+    let lines = input.split("\n");
     let s = lines[0].trim();
     let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);

[Killed] StringLiteral
solutions-descriptive/16.js:62:36
 
 // -------------------- Exported Solve --------------------
 export function solve(input) {
-    let lines = input.trim().split("\n");
+    let lines = input.trim().split("");
     let s = lines[0].trim();
     let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] MethodExpression
solutions-descriptive/16.js:63:13
 // -------------------- Exported Solve --------------------
 export function solve(input) {
     let lines = input.trim().split("\n");
-    let s = lines[0].trim();
+    let s = lines[0];
     let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);
 

[Killed] LogicalOperator
solutions-descriptive/16.js:64:17
 export function solve(input) {
     let lines = input.trim().split("\n");
     let s = lines[0].trim();
-    let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);
+    let nums = (lines[1] && "").trim().split(/\s+/).filter(Boolean).map(Number);
 
     // default to 0 if not provided
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] MethodExpression
solutions-descriptive/16.js:64:16
 export function solve(input) {
     let lines = input.trim().split("\n");
     let s = lines[0].trim();
-    let nums = (lines[1] || "").trim().split(/\s+/).filter(Boolean).map(Number);
+    let nums = (lines[1] || "").trim().split(/\s+/).map(Number);
 
     // default to 0 if not provided

[Killed] ConditionalExpression
solutions-descriptive/16.js:68:9
 
     // default to 0 if not provided
     let [a, b, ab, ba] = [0, 0, 0, 0];
-    if (nums.length > 0) [a, b, ab, ba] = nums;
+    if (false) [a, b, ab, ba] = nums;
 
     return canTransform(s, a, b, ab, ba);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Killed] EqualityOperator
solutions-descriptive/16.js:68:9
 
     // default to 0 if not provided
     let [a, b, ab, ba] = [0, 0, 0, 0];
-    if (nums.length > 0) [a, b, ab, ba] = nums;
+    if (nums.length <= 0) [a, b, ab, ba] = nums;
 
     return canTransform(s, a, b, ab, ba);
killedBy: example from description: s = "ABBA", a=1 b=1 ab=1 ba=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "YES"
Received: "NO"

[Survived] BlockStatement
solutions-descriptive/16.js:75:25
 
 
 // -------------------- Local Testing --------------------
-function testing_test() {
-    const testCases = [
-        { input: "A\n1 0 0 0", expected: "YES" },
-        { input: "A\n0 0 0 0", expected: "NO" },
-        { input: "B\n0 1 0 0", expected: "YES" },
-        { input: "B\n0 0 0 0", expected: "NO" },
-        { input: "ABA\n0 0 1 1", expected: "NO" },
-        { input: "ABBABAAB\n5 5 0 0", expected: "YES" },
-        { input: "ABABBAABBAAB\n1 1 2 3", expected: "YES" },
-        { input: "ABBBBAB\n0 3 2 0", expected: "YES" },
-        { input: "BAABBA\n1 3 2 0", expected: "NO" },
-    ];
-
-    for (let i = 0; i < testCases.length; i++) {
-        const { input, expected } = testCases[i];
-        const result = solve(input);
-        console.log(
-            `Test case ${i + 1}:`,
-            result === expected ? "PASSED" : `FAILED (Expected: ${expected}, Got: ${result})`
-        );
-    }
-}
+function testing_test() {}
 
     testing_test();

[Survived] ArrayDeclaration
solutions-descriptive/16.js:76:23
 
 // -------------------- Local Testing --------------------
 function testing_test() {
-    const testCases = [
-        { input: "A\n1 0 0 0", expected: "YES" },
-        { input: "A\n0 0 0 0", expected: "NO" },
-        { input: "B\n0 1 0 0", expected: "YES" },
-        { input: "B\n0 0 0 0", expected: "NO" },
-        { input: "ABA\n0 0 1 1", expected: "NO" },
-        { input: "ABBABAAB\n5 5 0 0", expected: "YES" },
-        { input: "ABABBAABBAAB\n1 1 2 3", expected: "YES" },
-        { input: "ABBBBAB\n0 3 2 0", expected: "YES" },
-        { input: "BAABBA\n1 3 2 0", expected: "NO" },
-    ];
+    const testCases = [];
 
     for (let i = 0; i < testCases.length; i++) {

[Survived] StringLiteral
solutions-descriptive/16.js:77:42
 // -------------------- Local Testing --------------------
 function testing_test() {
     const testCases = [
-        { input: "A\n1 0 0 0", expected: "YES" },
+        { input: "A\n1 0 0 0", expected: "" },
         { input: "A\n0 0 0 0", expected: "NO" },
         { input: "B\n0 1 0 0", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:77:18
 // -------------------- Local Testing --------------------
 function testing_test() {
     const testCases = [
-        { input: "A\n1 0 0 0", expected: "YES" },
+        { input: "", expected: "YES" },
         { input: "A\n0 0 0 0", expected: "NO" },
         { input: "B\n0 1 0 0", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:78:42
 function testing_test() {
     const testCases = [
         { input: "A\n1 0 0 0", expected: "YES" },
-        { input: "A\n0 0 0 0", expected: "NO" },
+        { input: "A\n0 0 0 0", expected: "" },
         { input: "B\n0 1 0 0", expected: "YES" },
         { input: "B\n0 0 0 0", expected: "NO" },

[Survived] StringLiteral
solutions-descriptive/16.js:80:42
         { input: "A\n1 0 0 0", expected: "YES" },
         { input: "A\n0 0 0 0", expected: "NO" },
         { input: "B\n0 1 0 0", expected: "YES" },
-        { input: "B\n0 0 0 0", expected: "NO" },
+        { input: "B\n0 0 0 0", expected: "" },
         { input: "ABA\n0 0 1 1", expected: "NO" },
         { input: "ABBABAAB\n5 5 0 0", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:80:18
         { input: "A\n1 0 0 0", expected: "YES" },
         { input: "A\n0 0 0 0", expected: "NO" },
         { input: "B\n0 1 0 0", expected: "YES" },
-        { input: "B\n0 0 0 0", expected: "NO" },
+        { input: "", expected: "NO" },
         { input: "ABA\n0 0 1 1", expected: "NO" },
         { input: "ABBABAAB\n5 5 0 0", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:81:44
         { input: "A\n0 0 0 0", expected: "NO" },
         { input: "B\n0 1 0 0", expected: "YES" },
         { input: "B\n0 0 0 0", expected: "NO" },
-        { input: "ABA\n0 0 1 1", expected: "NO" },
+        { input: "ABA\n0 0 1 1", expected: "" },
         { input: "ABBABAAB\n5 5 0 0", expected: "YES" },
         { input: "ABABBAABBAAB\n1 1 2 3", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:82:18
         { input: "B\n0 1 0 0", expected: "YES" },
         { input: "B\n0 0 0 0", expected: "NO" },
         { input: "ABA\n0 0 1 1", expected: "NO" },
-        { input: "ABBABAAB\n5 5 0 0", expected: "YES" },
+        { input: "", expected: "YES" },
         { input: "ABABBAABBAAB\n1 1 2 3", expected: "YES" },
         { input: "ABBBBAB\n0 3 2 0", expected: "YES" },

[Survived] StringLiteral
solutions-descriptive/16.js:85:18
         { input: "ABBABAAB\n5 5 0 0", expected: "YES" },
         { input: "ABABBAABBAAB\n1 1 2 3", expected: "YES" },
         { input: "ABBBBAB\n0 3 2 0", expected: "YES" },
-        { input: "BAABBA\n1 3 2 0", expected: "NO" },
+        { input: "", expected: "NO" },
     ];
 

[Survived] BlockStatement
solutions-descriptive/16.js:88:48
         { input: "BAABBA\n1 3 2 0", expected: "NO" },
     ];
 
-    for (let i = 0; i < testCases.length; i++) {
-        const { input, expected } = testCases[i];
-        const result = solve(input);
-        console.log(
-            `Test case ${i + 1}:`,
-            result === expected ? "PASSED" : `FAILED (Expected: ${expected}, Got: ${result})`
-        );
-    }
+    for (let i = 0; i < testCases.length; i++) {}
 }
 

[Survived] EqualityOperator
solutions-descriptive/16.js:88:21
         { input: "BAABBA\n1 3 2 0", expected: "NO" },
     ];
 
-    for (let i = 0; i < testCases.length; i++) {
+    for (let i = 0; i >= testCases.length; i++) {
         const { input, expected } = testCases[i];
         const result = solve(input);

[Survived] ArithmeticOperator
solutions-descriptive/16.js:92:26
         const { input, expected } = testCases[i];
         const result = solve(input);
         console.log(
-            `Test case ${i + 1}:`,
+            `Test case ${i - 1}:`,
             result === expected ? "PASSED" : `FAILED (Expected: ${expected}, Got: ${result})`
         );

[Survived] EqualityOperator
solutions-descriptive/16.js:93:13
         const result = solve(input);
         console.log(
             `Test case ${i + 1}:`,
-            result === expected ? "PASSED" : `FAILED (Expected: ${expected}, Got: ${result})`
+            result !== expected ? "PASSED" : `FAILED (Expected: ${expected}, Got: ${result})`
         );
     }
