[Killed] BlockStatement
solutions-descriptive/17.js:1:47
-export function solve(totalNodes, totalEdges) {
-    if (2 * totalNodes <= totalEdges) {
-        return 'NO';
-    }
-
-    const doubleNodes = totalNodes * 2;
-    const edgeAssignments = Array(doubleNodes)
-        .fill(0)
-        .map(() => Array(totalEdges));
-
-    for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
-        for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
-            edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
-        }
-    }
-
-    return 'YES\n' + edgeAssignments.map(row => {
-        return row.map(x => x + 1).join(' ');
-    }).join('\n');
-}
+export function solve(totalNodes, totalEdges) {}
 
 // function testing_test() {
killedBy: n=1, m=1
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
solutions-descriptive/17.js:2:9
 export function solve(totalNodes, totalEdges) {
-    if (2 * totalNodes <= totalEdges) {
+    if (2 * totalNodes < totalEdges) {
         return 'NO';
     }
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
solutions-descriptive/17.js:2:9
 export function solve(totalNodes, totalEdges) {
-    if (2 * totalNodes <= totalEdges) {
+    if (true) {
         return 'NO';
     }
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
solutions-descriptive/17.js:6:25
         return 'NO';
     }
 
-    const doubleNodes = totalNodes * 2;
+    const doubleNodes = totalNodes / 2;
     const edgeAssignments = Array(doubleNodes)
         .fill(0)
killedBy: n=1, m=1
statusReason: RangeError: Invalid array length

[Killed] ArrowFunction
solutions-descriptive/17.js:9:14
     const doubleNodes = totalNodes * 2;
     const edgeAssignments = Array(doubleNodes)
         .fill(0)
-        .map(() => Array(totalEdges));
+        .map(() => undefined);
 
     for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
killedBy: n=1, m=1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] UpdateOperator
solutions-descriptive/17.js:11:54
         .fill(0)
         .map(() => Array(totalEdges));
 
-    for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
+    for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex--) {
         for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
             edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
killedBy: n=1, m=1
statusReason: TypeError: Cannot set properties of undefined (setting '0')

[Killed] ConditionalExpression
solutions-descriptive/17.js:11:29
         .fill(0)
         .map(() => Array(totalEdges));
 
-    for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
+    for (let nodeIndex = 0; false; nodeIndex++) {
         for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
             edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
- 1

[Killed] ConditionalExpression
solutions-descriptive/17.js:12:33
         .map(() => Array(totalEdges));
 
     for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
-        for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
+        for (let edgeIndex = 0; false; edgeIndex++) {
             edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
         }
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
- 1

[Killed] EqualityOperator
solutions-descriptive/17.js:12:33
         .map(() => Array(totalEdges));
 
     for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
-        for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
+        for (let edgeIndex = 0; edgeIndex >= totalEdges; edgeIndex++) {
             edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
         }
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
- 1

[Killed] ArithmeticOperator
solutions-descriptive/17.js:13:53
 
     for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
         for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
-            edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
+            edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) * totalNodes;
         }
     }
killedBy: n=3, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
solutions-descriptive/17.js:13:65
 
     for (let nodeIndex = 0; nodeIndex < doubleNodes; nodeIndex++) {
         for (let edgeIndex = 0; edgeIndex < totalEdges; edgeIndex++) {
-            edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex + edgeIndex) / 2) % totalNodes;
+            edgeAssignments[nodeIndex][edgeIndex] = Math.floor((nodeIndex - edgeIndex) / 2) % totalNodes;
         }
     }
killedBy: n=3, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
solutions-descriptive/17.js:17:49
         }
     }
 
-    return 'YES\n' + edgeAssignments.map(row => {
-        return row.map(x => x + 1).join(' ');
-    }).join('\n');
+    return 'YES\n' + edgeAssignments.map(row => {}).join('\n');
 }
 
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
- 1

[Killed] StringLiteral
solutions-descriptive/17.js:17:12
         }
     }
 
-    return 'YES\n' + edgeAssignments.map(row => {
+    return "" + edgeAssignments.map(row => {
         return row.map(x => x + 1).join(' ');
     }).join('\n');
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
solutions-descriptive/17.js:18:29
     }
 
     return 'YES\n' + edgeAssignments.map(row => {
-        return row.map(x => x + 1).join(' ');
+        return row.map(x => x - 1).join(' ');
     }).join('\n');
 }
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
+ -1

[Killed] ArrowFunction
solutions-descriptive/17.js:18:24
     }
 
     return 'YES\n' + edgeAssignments.map(row => {
-        return row.map(x => x + 1).join(' ');
+        return row.map(() => undefined).join(' ');
     }).join('\n');
 }
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 2

  YES
- 1
- 1

[Killed] StringLiteral
solutions-descriptive/17.js:19:13
 
     return 'YES\n' + edgeAssignments.map(row => {
         return row.map(x => x + 1).join(' ');
-    }).join('\n');
+    }).join("");
 }
 
killedBy: n=1, m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

  YES
- 1
- 1
