[Killed] ArithmeticOperator
solutions-descriptive/18.js:2:22
 export function solve(targetRows, targetCols, sourceMatrix, targetMatrix) {
-    const MAX_ITER = Math.min(targetRows, targetCols) + 1;
+    const MAX_ITER = Math.min(targetRows, targetCols) - 1;
 
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
killedBy: n*m=1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Survived] MethodExpression
solutions-descriptive/18.js:2:22
 export function solve(targetRows, targetCols, sourceMatrix, targetMatrix) {
-    const MAX_ITER = Math.min(targetRows, targetCols) + 1;
+    const MAX_ITER = Math.max(targetRows, targetCols) + 1;
 
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {

[Killed] BlockStatement
solutions-descriptive/18.js:4:64
 export function solve(targetRows, targetCols, sourceMatrix, targetMatrix) {
     const MAX_ITER = Math.min(targetRows, targetCols) + 1;
 
-    for (let iteration = 0; iteration < MAX_ITER; iteration++) {
-        for (let row = 0; row < targetRows; row++) {
-            let mismatchMask = 0;
-            for (let col = 0; col < targetCols; col++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
-            }
-
-            const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
-            for (let col = 0; col < targetCols; col++) {
-                sourceMatrix[row][col] &= Number(clearMask);
-            }
-        }
-
-        for (let col = 0; col < targetCols; col++) {
-            let mismatchMask = 0;
-            for (let row = 0; row < targetRows; row++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
-            }
-
-            for (let row = 0; row < targetRows; row++) {
-                sourceMatrix[row][col] |= mismatchMask;
-            }
-        }
-    }
+    for (let iteration = 0; iteration < MAX_ITER; iteration++) {}
 
     for (let row = 0; row < targetRows; row++) {
killedBy: 2x2 possible with column OR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] ConditionalExpression
solutions-descriptive/18.js:4:29
 export function solve(targetRows, targetCols, sourceMatrix, targetMatrix) {
     const MAX_ITER = Math.min(targetRows, targetCols) + 1;
 
-    for (let iteration = 0; iteration < MAX_ITER; iteration++) {
+    for (let iteration = 0; false; iteration++) {
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;
killedBy: 2x2 possible with column OR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] BlockStatement
solutions-descriptive/18.js:5:52
     const MAX_ITER = Math.min(targetRows, targetCols) + 1;
 
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
-        for (let row = 0; row < targetRows; row++) {
-            let mismatchMask = 0;
-            for (let col = 0; col < targetCols; col++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
-            }
-
-            const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
-            for (let col = 0; col < targetCols; col++) {
-                sourceMatrix[row][col] &= Number(clearMask);
-            }
-        }
+        for (let row = 0; row < targetRows; row++) {}
 
         for (let col = 0; col < targetCols; col++) {
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] EqualityOperator
solutions-descriptive/18.js:5:27
     const MAX_ITER = Math.min(targetRows, targetCols) + 1;
 
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
-        for (let row = 0; row < targetRows; row++) {
+        for (let row = 0; row >= targetRows; row++) {
             let mismatchMask = 0;
             for (let col = 0; col < targetCols; col++) {
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] EqualityOperator
solutions-descriptive/18.js:7:31
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;
-            for (let col = 0; col < targetCols; col++) {
+            for (let col = 0; col >= targetCols; col++) {
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
             }
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] ConditionalExpression
solutions-descriptive/18.js:7:31
     for (let iteration = 0; iteration < MAX_ITER; iteration++) {
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;
-            for (let col = 0; col < targetCols; col++) {
+            for (let col = 0; false; col++) {
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
             }
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] AssignmentOperator
solutions-descriptive/18.js:8:17
         for (let row = 0; row < targetRows; row++) {
             let mismatchMask = 0;
             for (let col = 0; col < targetCols; col++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
+                mismatchMask &= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
             }
 
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] ArithmeticOperator
solutions-descriptive/18.js:11:32
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & sourceMatrix[row][col];
             }
 
-            const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
+            const clearMask = ((1n << 31n) + 1n) ^ BigInt(mismatchMask);
             for (let col = 0; col < targetCols; col++) {
                 sourceMatrix[row][col] &= Number(clearMask);
killedBy: 2x2 simple possible
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] EqualityOperator
solutions-descriptive/18.js:12:31
             }
 
             const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
-            for (let col = 0; col < targetCols; col++) {
+            for (let col = 0; col >= targetCols; col++) {
                 sourceMatrix[row][col] &= Number(clearMask);
             }
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] BlockStatement
solutions-descriptive/18.js:12:56
             }
 
             const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
-            for (let col = 0; col < targetCols; col++) {
-                sourceMatrix[row][col] &= Number(clearMask);
-            }
+            for (let col = 0; col < targetCols; col++) {}
         }
 
killedBy: 2x2 possible with row AND
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] AssignmentOperator
solutions-descriptive/18.js:13:17
 
             const clearMask = ((1n << 31n) - 1n) ^ BigInt(mismatchMask);
             for (let col = 0; col < targetCols; col++) {
-                sourceMatrix[row][col] &= Number(clearMask);
+                sourceMatrix[row][col] |= Number(clearMask);
             }
         }
killedBy: 1x1 same matrix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] BlockStatement
solutions-descriptive/18.js:17:52
             }
         }
 
-        for (let col = 0; col < targetCols; col++) {
-            let mismatchMask = 0;
-            for (let row = 0; row < targetRows; row++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
-            }
-
-            for (let row = 0; row < targetRows; row++) {
-                sourceMatrix[row][col] |= mismatchMask;
-            }
-        }
+        for (let col = 0; col < targetCols; col++) {}
     }
 
killedBy: 2x2 possible with column OR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] EqualityOperator
solutions-descriptive/18.js:17:27
             }
         }
 
-        for (let col = 0; col < targetCols; col++) {
+        for (let col = 0; col >= targetCols; col++) {
             let mismatchMask = 0;
             for (let row = 0; row < targetRows; row++) {
killedBy: 2x2 possible with column OR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] UpdateOperator
solutions-descriptive/18.js:19:49
 
         for (let col = 0; col < targetCols; col++) {
             let mismatchMask = 0;
-            for (let row = 0; row < targetRows; row++) {
+            for (let row = 0; row < targetRows; row--) {
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
             }
killedBy: 1x1 same matrix
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
solutions-descriptive/18.js:19:31
 
         for (let col = 0; col < targetCols; col++) {
             let mismatchMask = 0;
-            for (let row = 0; row < targetRows; row++) {
+            for (let row = 0; row <= targetRows; row++) {
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
             }
killedBy: 1x1 same matrix
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] AssignmentOperator
solutions-descriptive/18.js:20:17
         for (let col = 0; col < targetCols; col++) {
             let mismatchMask = 0;
             for (let row = 0; row < targetRows; row++) {
-                mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
+                mismatchMask &= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
             }
 
killedBy: 2x2 possible with column OR
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] UpdateOperator
solutions-descriptive/18.js:23:49
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
             }
 
-            for (let row = 0; row < targetRows; row++) {
+            for (let row = 0; row < targetRows; row--) {
                 sourceMatrix[row][col] |= mismatchMask;
             }
killedBy: 1x1 same matrix
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
solutions-descriptive/18.js:23:31
                 mismatchMask |= (sourceMatrix[row][col] ^ targetMatrix[row][col]) & targetMatrix[row][col];
             }
 
-            for (let row = 0; row < targetRows; row++) {
+            for (let row = 0; row <= targetRows; row++) {
                 sourceMatrix[row][col] |= mismatchMask;
             }
killedBy: 1x1 same matrix
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] AssignmentOperator
solutions-descriptive/18.js:24:17
             }
 
             for (let row = 0; row < targetRows; row++) {
-                sourceMatrix[row][col] |= mismatchMask;
+                sourceMatrix[row][col] &= mismatchMask;
             }
         }
killedBy: 1x1 same matrix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] BlockStatement
solutions-descriptive/18.js:29:48
         }
     }
 
-    for (let row = 0; row < targetRows; row++) {
-        for (let col = 0; col < targetCols; col++) {
-            if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
-                return "No\n";
-            }
-        }
-    }
+    for (let row = 0; row < targetRows; row++) {}
 
     return "Yes\n";
killedBy: 3x3 impossible (increase unknown bit)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- No
+ Yes
  ↵

[Killed] ConditionalExpression
solutions-descriptive/18.js:30:27
     }
 
     for (let row = 0; row < targetRows; row++) {
-        for (let col = 0; col < targetCols; col++) {
+        for (let col = 0; false; col++) {
             if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
                 return "No\n";
killedBy: 3x3 impossible (increase unknown bit)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- No
+ Yes
  ↵

[Killed] BlockStatement
solutions-descriptive/18.js:30:52
     }
 
     for (let row = 0; row < targetRows; row++) {
-        for (let col = 0; col < targetCols; col++) {
-            if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
-                return "No\n";
-            }
-        }
+        for (let col = 0; col < targetCols; col++) {}
     }
 
killedBy: 3x3 impossible (increase unknown bit)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- No
+ Yes
  ↵

[Killed] ConditionalExpression
solutions-descriptive/18.js:31:17
 
     for (let row = 0; row < targetRows; row++) {
         for (let col = 0; col < targetCols; col++) {
-            if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
+            if (false) {
                 return "No\n";
             }
killedBy: 3x3 impossible (increase unknown bit)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- No
+ Yes
  ↵

[Killed] EqualityOperator
solutions-descriptive/18.js:31:17
 
     for (let row = 0; row < targetRows; row++) {
         for (let col = 0; col < targetCols; col++) {
-            if (sourceMatrix[row][col] !== targetMatrix[row][col]) {
+            if (sourceMatrix[row][col] === targetMatrix[row][col]) {
                 return "No\n";
             }
killedBy: 1x1 same matrix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

- Yes
+ No
  ↵

[Killed] StringLiteral
solutions-descriptive/18.js:37:12
         }
     }
 
-    return "Yes\n";
+    return "";
 }
 
killedBy: 1x1 same matrix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Yes
"
Received: ""
