[Killed] BlockStatement
solutions-descriptive/19.js:2:29
 //solve -> solve
-export function solve(a, b) {
-    return b ? solve(b, a % b) : a;
-}
+export function solve(a, b) {}
 
 function calculateSumWithGCD(n, a, b) {
killedBy: GCD base: solve(10, 5) should be 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
solutions-descriptive/19.js:3:25
 //solve -> solve
 export function solve(a, b) {
-    return b ? solve(b, a % b) : a;
+    return b ? solve(b, a * b) : a;
 }
 
killedBy: GCD base: solve(10, 5) should be 5
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ArithmeticOperator
solutions-descriptive/19.js:7:34
 }
 
 function calculateSumWithGCD(n, a, b) {
-    let rowGCD = new Uint32Array(n + 5);
+    let rowGCD = new Uint32Array(n - 5);
     let colGCD = new Uint32Array(n + 5);
     let lastRowCoprimeIndex = 0,

[Survived] ArithmeticOperator
solutions-descriptive/19.js:8:34
 
 function calculateSumWithGCD(n, a, b) {
     let rowGCD = new Uint32Array(n + 5);
-    let colGCD = new Uint32Array(n + 5);
+    let colGCD = new Uint32Array(n - 5);
     let lastRowCoprimeIndex = 0,
         lastColCoprimeIndex = 0;

[Survived] EqualityOperator
solutions-descriptive/19.js:12:21
     let lastRowCoprimeIndex = 0,
         lastColCoprimeIndex = 0;
 
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i < n; i++) {
         rowGCD[i] = solve(i, a);
         if (rowGCD[i] === 1) lastRowCoprimeIndex = i;

[Survived] UpdateOperator
solutions-descriptive/19.js:12:29
     let lastRowCoprimeIndex = 0,
         lastColCoprimeIndex = 0;
 
-    for (let i = 1; i <= n; i++) {
+    for (let i = 1; i <= n; i--) {
         rowGCD[i] = solve(i, a);
         if (rowGCD[i] === 1) lastRowCoprimeIndex = i;

[Survived] EqualityOperator
solutions-descriptive/19.js:14:13
 
     for (let i = 1; i <= n; i++) {
         rowGCD[i] = solve(i, a);
-        if (rowGCD[i] === 1) lastRowCoprimeIndex = i;
+        if (rowGCD[i] !== 1) lastRowCoprimeIndex = i;
     }
 

[Survived] ConditionalExpression
solutions-descriptive/19.js:14:13
 
     for (let i = 1; i <= n; i++) {
         rowGCD[i] = solve(i, a);
-        if (rowGCD[i] === 1) lastRowCoprimeIndex = i;
+        if (true) lastRowCoprimeIndex = i;
     }
 

[Survived] EqualityOperator
solutions-descriptive/19.js:17:21
         if (rowGCD[i] === 1) lastRowCoprimeIndex = i;
     }
 
-    for (let j = 1; j <= n; j++) {
+    for (let j = 1; j > n; j++) {
         colGCD[j] = solve(j, b);
         if (colGCD[j] === 1) lastColCoprimeIndex = j;

[Survived] BlockStatement
solutions-descriptive/19.js:17:34
         if (rowGCD[i] === 1) lastRowCoprimeIndex = i;
     }
 
-    for (let j = 1; j <= n; j++) {
-        colGCD[j] = solve(j, b);
-        if (colGCD[j] === 1) lastColCoprimeIndex = j;
-    }
+    for (let j = 1; j <= n; j++) {}
 
     let totalSum = 0;

[Survived] EqualityOperator
solutions-descriptive/19.js:19:13
 
     for (let j = 1; j <= n; j++) {
         colGCD[j] = solve(j, b);
-        if (colGCD[j] === 1) lastColCoprimeIndex = j;
+        if (colGCD[j] !== 1) lastColCoprimeIndex = j;
     }
 

[Survived] ConditionalExpression
solutions-descriptive/19.js:19:13
 
     for (let j = 1; j <= n; j++) {
         colGCD[j] = solve(j, b);
-        if (colGCD[j] === 1) lastColCoprimeIndex = j;
+        if (true) lastColCoprimeIndex = j;
     }
 

[Survived] EqualityOperator
solutions-descriptive/19.js:23:21
     }
 
     let totalSum = 0;
-    for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
+    for (let i = 1; i < lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);

[Survived] EqualityOperator
solutions-descriptive/19.js:23:21
     }
 
     let totalSum = 0;
-    for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
+    for (let i = 1; i > lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);

[Survived] EqualityOperator
solutions-descriptive/19.js:24:21
 
     let totalSum = 0;
     for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
-    for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
+    for (let j = 1; j > lastColCoprimeIndex; j++) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
 

[Survived] UpdateOperator
solutions-descriptive/19.js:24:47
 
     let totalSum = 0;
     for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
-    for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
+    for (let j = 1; j <= lastColCoprimeIndex; j--) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
 

[Survived] AssignmentOperator
solutions-descriptive/19.js:25:5
     let totalSum = 0;
     for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
-    totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
+    totalSum -= lastRowCoprimeIndex + lastColCoprimeIndex - 2;
 
     let dp = Array(n - lastRowCoprimeIndex + 1)

[Survived] ArithmeticOperator
solutions-descriptive/19.js:25:18
     let totalSum = 0;
     for (let i = 1; i <= lastRowCoprimeIndex; i++) totalSum += rowGCD[i];
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
-    totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
+    totalSum += (lastRowCoprimeIndex - lastColCoprimeIndex - 2);
 
     let dp = Array(n - lastRowCoprimeIndex + 1)

[Survived] ArithmeticOperator
solutions-descriptive/19.js:27:20
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
 
-    let dp = Array(n - lastRowCoprimeIndex + 1)
+    let dp = Array(n + lastRowCoprimeIndex + 1)
         .fill()
         .map(() => new Uint32Array(n - lastColCoprimeIndex + 1).fill(1e9));

[Survived] ArithmeticOperator
solutions-descriptive/19.js:27:20
     for (let j = 1; j <= lastColCoprimeIndex; j++) totalSum += colGCD[j];
     totalSum += (lastRowCoprimeIndex + lastColCoprimeIndex - 2);
 
-    let dp = Array(n - lastRowCoprimeIndex + 1)
+    let dp = Array(n - lastRowCoprimeIndex - 1)
         .fill()
         .map(() => new Uint32Array(n - lastColCoprimeIndex + 1).fill(1e9));

[Survived] ArithmeticOperator
solutions-descriptive/19.js:29:36
 
     let dp = Array(n - lastRowCoprimeIndex + 1)
         .fill()
-        .map(() => new Uint32Array(n - lastColCoprimeIndex + 1).fill(1e9));
+        .map(() => new Uint32Array(n - lastColCoprimeIndex - 1).fill(1e9));
 
     dp[0][0] = 0;

[Survived] ArrowFunction
solutions-descriptive/19.js:29:14
 
     let dp = Array(n - lastRowCoprimeIndex + 1)
         .fill()
-        .map(() => new Uint32Array(n - lastColCoprimeIndex + 1).fill(1e9));
+        .map(() => undefined);
 
     dp[0][0] = 0;

[Survived] ConditionalExpression
solutions-descriptive/19.js:33:39
 
     dp[0][0] = 0;
 
-    for (let i = lastRowCoprimeIndex; i <= n; i++) {
+    for (let i = lastRowCoprimeIndex; false; i++) {
         for (let j = lastColCoprimeIndex; j <= n; j++) {
             if (i > lastRowCoprimeIndex) {

[Survived] BlockStatement
solutions-descriptive/19.js:33:52
 
     dp[0][0] = 0;
 
-    for (let i = lastRowCoprimeIndex; i <= n; i++) {
-        for (let j = lastColCoprimeIndex; j <= n; j++) {
-            if (i > lastRowCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
-                );
-            }
-            if (j > lastColCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
-                );
-            }
-        }
-    }
+    for (let i = lastRowCoprimeIndex; i <= n; i++) {}
 
     return totalSum + dp[n - lastRowCoprimeIndex][n - lastColCoprimeIndex];

[Survived] EqualityOperator
solutions-descriptive/19.js:34:43
     dp[0][0] = 0;
 
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
-        for (let j = lastColCoprimeIndex; j <= n; j++) {
+        for (let j = lastColCoprimeIndex; j > n; j++) {
             if (i > lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(

[Survived] BlockStatement
solutions-descriptive/19.js:34:56
     dp[0][0] = 0;
 
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
-        for (let j = lastColCoprimeIndex; j <= n; j++) {
-            if (i > lastRowCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
-                );
-            }
-            if (j > lastColCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
-                );
-            }
-        }
+        for (let j = lastColCoprimeIndex; j <= n; j++) {}
     }
 

[Survived] EqualityOperator
solutions-descriptive/19.js:35:17
 
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
         for (let j = lastColCoprimeIndex; j <= n; j++) {
-            if (i > lastRowCoprimeIndex) {
+            if (i >= lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],

[Survived] BlockStatement
solutions-descriptive/19.js:35:42
 
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
         for (let j = lastColCoprimeIndex; j <= n; j++) {
-            if (i > lastRowCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
-                );
-            }
+            if (i > lastRowCoprimeIndex) {}
             if (j > lastColCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(

[Survived] ArithmeticOperator
solutions-descriptive/19.js:36:45
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
         for (let j = lastColCoprimeIndex; j <= n; j++) {
             if (i > lastRowCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
+                dp[i - lastRowCoprimeIndex][j + lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]

[Survived] ArithmeticOperator
solutions-descriptive/19.js:36:20
     for (let i = lastRowCoprimeIndex; i <= n; i++) {
         for (let j = lastColCoprimeIndex; j <= n; j++) {
             if (i > lastRowCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
+                dp[i + lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]

[Survived] ArithmeticOperator
solutions-descriptive/19.js:37:49
         for (let j = lastColCoprimeIndex; j <= n; j++) {
             if (i > lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
+                    dp[i - lastRowCoprimeIndex][j + lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
                 );

[Survived] ArithmeticOperator
solutions-descriptive/19.js:37:24
         for (let j = lastColCoprimeIndex; j <= n; j++) {
             if (i > lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
+                    dp[i + lastRowCoprimeIndex][j - lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
                 );

[Survived] ArithmeticOperator
solutions-descriptive/19.js:38:53
             if (i > lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
+                    dp[i - lastRowCoprimeIndex - 1][j + lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
                 );
             }

[Survived] ArithmeticOperator
solutions-descriptive/19.js:38:21
             if (i > lastRowCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
+                    dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] - colGCD[j]
                 );
             }

[Survived] BlockStatement
solutions-descriptive/19.js:41:42
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
                 );
             }
-            if (j > lastColCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
-                );
-            }
+            if (j > lastColCoprimeIndex) {}
         }
     }

[Survived] EqualityOperator
solutions-descriptive/19.js:41:17
                     dp[i - lastRowCoprimeIndex - 1][j - lastColCoprimeIndex] + rowGCD[i] + colGCD[j]
                 );
             }
-            if (j > lastColCoprimeIndex) {
+            if (j >= lastColCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],

[Survived] ArithmeticOperator
solutions-descriptive/19.js:42:45
                 );
             }
             if (j > lastColCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
+                dp[i - lastRowCoprimeIndex][j + lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]

[Survived] ArithmeticOperator
solutions-descriptive/19.js:42:20
                 );
             }
             if (j > lastColCoprimeIndex) {
-                dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
+                dp[i + lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]

[Survived] ArithmeticOperator
solutions-descriptive/19.js:44:21
             if (j > lastColCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
+                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] - colGCD[j]
                 );
             }

[Survived] ArithmeticOperator
solutions-descriptive/19.js:44:24
             if (j > lastColCoprimeIndex) {
                 dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex] = Math.min(
                     dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex],
-                    dp[i - lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
+                    dp[i + lastRowCoprimeIndex][j - lastColCoprimeIndex - 1] + rowGCD[i] + colGCD[j]
                 );
             }

[Survived] ArithmeticOperator
solutions-descriptive/19.js:50:26
         }
     }
 
-    return totalSum + dp[n - lastRowCoprimeIndex][n - lastColCoprimeIndex];
+    return totalSum + dp[n + lastRowCoprimeIndex][n - lastColCoprimeIndex];
 }
 

[Survived] ArithmeticOperator
solutions-descriptive/19.js:50:12
         }
     }
 
-    return totalSum + dp[n - lastRowCoprimeIndex][n - lastColCoprimeIndex];
+    return totalSum - dp[n - lastRowCoprimeIndex][n - lastColCoprimeIndex];
 }
 
