[Timeout] UpdateOperator
solutions-descriptive/25.js:95:9
     while (left < right) {
         [array[left], array[right]] = [array[right], array[left]];
         left++;
-        right--;
+        right++;
     }
 
