[Killed] UpdateOperator
solutions-descriptive/27.js:5:36
     const xFrequency = new Map();
     const diagonalSumFrequency = new Map();
 
-    for (let i = 0; i < numPoints; i++) {
+    for (let i = 0; i < numPoints; i--) {
         const [x, y] = pointList[i];
 
killedBy: Single lightbulb on at (0,0)
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
solutions-descriptive/27.js:5:21
     const xFrequency = new Map();
     const diagonalSumFrequency = new Map();
 
-    for (let i = 0; i < numPoints; i++) {
+    for (let i = 0; false; i++) {
         const [x, y] = pointList[i];
 
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] LogicalOperator
solutions-descriptive/27.js:8:28
     for (let i = 0; i < numPoints; i++) {
         const [x, y] = pointList[i];
 
-        xFrequency.set(x, (xFrequency.get(x) || 0) + 1);
+        xFrequency.set(x, (xFrequency.get(x) && 0) + 1);
         diagonalSumFrequency.set(x + y, (diagonalSumFrequency.get(x + y) || 0) + 1);
     }
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
solutions-descriptive/27.js:8:28
     for (let i = 0; i < numPoints; i++) {
         const [x, y] = pointList[i];
 
-        xFrequency.set(x, (xFrequency.get(x) || 0) + 1);
+        xFrequency.set(x, (true) + 1);
         diagonalSumFrequency.set(x + y, (diagonalSumFrequency.get(x + y) || 0) + 1);
     }
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ArithmeticOperator
solutions-descriptive/27.js:9:34
         const [x, y] = pointList[i];
 
         xFrequency.set(x, (xFrequency.get(x) || 0) + 1);
-        diagonalSumFrequency.set(x + y, (diagonalSumFrequency.get(x + y) || 0) + 1);
+        diagonalSumFrequency.set(x - y, (diagonalSumFrequency.get(x + y) || 0) + 1);
     }
 
killedBy: Single lightbulb on at (100, -100)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    100,
-   -100,

[Killed] LogicalOperator
solutions-descriptive/27.js:9:42
         const [x, y] = pointList[i];
 
         xFrequency.set(x, (xFrequency.get(x) || 0) + 1);
-        diagonalSumFrequency.set(x + y, (diagonalSumFrequency.get(x + y) || 0) + 1);
+        diagonalSumFrequency.set(x + y, (diagonalSumFrequency.get(x + y) && 0) + 1);
     }
 
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   0,

[Killed] BlockStatement
solutions-descriptive/27.js:15:47
     let uniqueX, uniqueY;
 
     
-    for (const [xCoord, count] of xFrequency) {
-        if (count % 2 === 1) {
-            uniqueX = xCoord;
-            break;
-        }
-    }
+    for (const [xCoord, count] of xFrequency) {}
 
     
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ArithmeticOperator
solutions-descriptive/27.js:16:13
 
     
     for (const [xCoord, count] of xFrequency) {
-        if (count % 2 === 1) {
+        if (count * 2 === 1) {
             uniqueX = xCoord;
             break;
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] BlockStatement
solutions-descriptive/27.js:16:30
 
     
     for (const [xCoord, count] of xFrequency) {
-        if (count % 2 === 1) {
-            uniqueX = xCoord;
-            break;
-        }
+        if (count % 2 === 1) {}
     }
 
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] BlockStatement
solutions-descriptive/27.js:23:62
     }
 
     
-    for (const [diagonalSum, count] of diagonalSumFrequency) {
-        if (count % 2 === 1) {
-            uniqueY = diagonalSum - uniqueX;
-            break;
-        }
-    }
+    for (const [diagonalSum, count] of diagonalSumFrequency) {}
 
     return [uniqueX, uniqueY];
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   0,

[Killed] BlockStatement
solutions-descriptive/27.js:24:30
 
     
     for (const [diagonalSum, count] of diagonalSumFrequency) {
-        if (count % 2 === 1) {
-            uniqueY = diagonalSum - uniqueX;
-            break;
-        }
+        if (count % 2 === 1) {}
     }
 
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   0,

[Killed] EqualityOperator
solutions-descriptive/27.js:24:13
 
     
     for (const [diagonalSum, count] of diagonalSumFrequency) {
-        if (count % 2 === 1) {
+        if (count % 2 !== 1) {
             uniqueY = diagonalSum - uniqueX;
             break;
killedBy: Single lightbulb on at (0,0)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   0,

[Killed] ArithmeticOperator
solutions-descriptive/27.js:25:23
     
     for (const [diagonalSum, count] of diagonalSumFrequency) {
         if (count % 2 === 1) {
-            uniqueY = diagonalSum - uniqueX;
+            uniqueY = diagonalSum + uniqueX;
             break;
         }
killedBy: Single lightbulb on at (100, -100)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    100,
-   -100,
