[Killed] BlockStatement
solutions-descriptive/3.js:1:71
-export function solve(range1Start, range1End, range2Start, range2End) {
-    const segments1 = [],
-        segments2 = [];
-    computeSegments(segments1, range1Start, range1End, 0, 1 << 20);
-    computeSegments(segments2, range2Start, range2End, 0, 1 << 20);
-
-    let total = 0;
-    for (let len1 of segments1) {
-        for (let len2 of segments2) {
-            const commonGCD = gcd(len1, len2);
-            total += (len1 / commonGCD) * (len2 / commonGCD);
-        }
-    }
-    return total;
-}
+export function solve(range1Start, range1End, range2Start, range2End) {}
 
 function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Timeout] ArrayDeclaration
solutions-descriptive/3.js:2:23
 export function solve(range1Start, range1End, range2Start, range2End) {
-    const segments1 = [],
+    const segments1 = ["Stryker was here"],
         segments2 = [];
     computeSegments(segments1, range1Start, range1End, 0, 1 << 20);

[Killed] BlockStatement
solutions-descriptive/3.js:8:33
     computeSegments(segments2, range2Start, range2End, 0, 1 << 20);
 
     let total = 0;
-    for (let len1 of segments1) {
-        for (let len2 of segments2) {
-            const commonGCD = gcd(len1, len2);
-            total += (len1 / commonGCD) * (len2 / commonGCD);
-        }
-    }
+    for (let len1 of segments1) {}
     return total;
 }
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
solutions-descriptive/3.js:9:37
 
     let total = 0;
     for (let len1 of segments1) {
-        for (let len2 of segments2) {
-            const commonGCD = gcd(len1, len2);
-            total += (len1 / commonGCD) * (len2 / commonGCD);
-        }
+        for (let len2 of segments2) {}
     }
     return total;
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/3.js:11:44
     for (let len1 of segments1) {
         for (let len2 of segments2) {
             const commonGCD = gcd(len1, len2);
-            total += (len1 / commonGCD) * (len2 / commonGCD);
+            total += (len1 / commonGCD) * (len2 * commonGCD);
         }
     }
killedBy: full 2x2 region from origin
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Killed] ArithmeticOperator
solutions-descriptive/3.js:11:22
     for (let len1 of segments1) {
         for (let len2 of segments2) {
             const commonGCD = gcd(len1, len2);
-            total += (len1 / commonGCD) * (len2 / commonGCD);
+            total += len1 / commonGCD / (len2 / commonGCD);
         }
     }
killedBy: arbitrary large region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 374
Received: 126.546875

[Killed] BlockStatement
solutions-descriptive/3.js:17:87
     return total;
 }
 
-function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {
-    // If the segment [segmentStart, segmentEnd) is completely within [queryStart, queryEnd), use it
-    if (queryStart <= segmentStart && queryEnd >= segmentEnd) {
-        segmentList.push(segmentEnd - segmentStart);
-        return;
-    }
-
-    const mid = (segmentStart + segmentEnd) / 2;
-
-    // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
-    if (queryStart < mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
-    if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
-}
+function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {}
 
 function gcd(a, b) {
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
solutions-descriptive/3.js:19:9
 
 function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {
     // If the segment [segmentStart, segmentEnd) is completely within [queryStart, queryEnd), use it
-    if (queryStart <= segmentStart && queryEnd >= segmentEnd) {
+    if (queryStart <= segmentStart || queryEnd >= segmentEnd) {
         segmentList.push(segmentEnd - segmentStart);
         return;
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 524288

[Killed] EqualityOperator
solutions-descriptive/3.js:19:39
 
 function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {
     // If the segment [segmentStart, segmentEnd) is completely within [queryStart, queryEnd), use it
-    if (queryStart <= segmentStart && queryEnd >= segmentEnd) {
+    if (queryStart <= segmentStart && queryEnd > segmentEnd) {
         segmentList.push(segmentEnd - segmentStart);
         return;
killedBy: single unit square region
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
solutions-descriptive/3.js:20:26
 function computeSegments(segmentList, queryStart, queryEnd, segmentStart, segmentEnd) {
     // If the segment [segmentStart, segmentEnd) is completely within [queryStart, queryEnd), use it
     if (queryStart <= segmentStart && queryEnd >= segmentEnd) {
-        segmentList.push(segmentEnd - segmentStart);
+        segmentList.push(segmentEnd + segmentStart);
         return;
     }
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] ArithmeticOperator
solutions-descriptive/3.js:24:17
         return;
     }
 
-    const mid = (segmentStart + segmentEnd) / 2;
+    const mid = (segmentStart + segmentEnd) * 2;
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
killedBy: single unit square region
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ArithmeticOperator
solutions-descriptive/3.js:24:18
         return;
     }
 
-    const mid = (segmentStart + segmentEnd) / 2;
+    const mid = (segmentStart - segmentEnd) / 2;
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
killedBy: single unit square region
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
solutions-descriptive/3.js:27:9
     const mid = (segmentStart + segmentEnd) / 2;
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
-    if (queryStart < mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
+    if (queryStart <= mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
     if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
 }
killedBy: single unit square region
statusReason: RangeError: Maximum call stack size exceeded

[Killed] EqualityOperator
solutions-descriptive/3.js:27:9
     const mid = (segmentStart + segmentEnd) / 2;
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
-    if (queryStart < mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
+    if (queryStart >= mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
     if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
 }
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
solutions-descriptive/3.js:28:9
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
     if (queryStart < mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
-    if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
+    if (queryEnd >= mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
 }
 
killedBy: single unit square region
statusReason: RangeError: Maximum call stack size exceeded

[Killed] ConditionalExpression
solutions-descriptive/3.js:28:9
 
     // Recurse into left and/or right halves if they intersect with [queryStart, queryEnd)
     if (queryStart < mid) computeSegments(segmentList, queryStart, queryEnd, segmentStart, mid);
-    if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
+    if (false) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
 }
 
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
solutions-descriptive/3.js:31:20
     if (queryEnd > mid) computeSegments(segmentList, queryStart, queryEnd, mid, segmentEnd);
 }
 
-function gcd(a, b) {
-    while (a !== 0) {
-        const remainder = b % a;
-        b = a;
-        a = remainder;
-    }
-    return b;
-}
+function gcd(a, b) {}
 
 // function testing_test() {
killedBy: single unit square region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/3.js:32:12
 }
 
 function gcd(a, b) {
-    while (a !== 0) {
+    while (a === 0) {
         const remainder = b % a;
         b = a;
killedBy: arbitrary large region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 374
Received: 126.546875

[Killed] ConditionalExpression
solutions-descriptive/3.js:32:12
 }
 
 function gcd(a, b) {
-    while (a !== 0) {
+    while (false) {
         const remainder = b % a;
         b = a;
killedBy: arbitrary large region
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 374
Received: 126.546875

[Timeout] ArithmeticOperator
solutions-descriptive/3.js:33:27
 
 function gcd(a, b) {
     while (a !== 0) {
-        const remainder = b % a;
+        const remainder = b * a;
         b = a;
         a = remainder;
