[Killed] BlockStatement
solutions-descriptive/31.js:3:28
 const MOD = BigInt(998244353);
 
-function convolution(P, Q) {
-    let len = P.length;
-    let R = new Array(len).fill(0n);
-    for (let i = 0; i < len; i++) {
-        let suma = 0n;
-        for (let j = 0; j <= i; j++) {
-            suma += P[j] * Q[i - j];
-            suma %= MOD;
-        }
-        R[i] = suma;
-    }
-    return R;
-}
+function convolution(P, Q) {}
 
 export function solve(P, k) {
killedBy: n=1, m=2
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] ArrayDeclaration
solutions-descriptive/31.js:5:13
 
 function convolution(P, Q) {
     let len = P.length;
-    let R = new Array(len).fill(0n);
+    let R = new Array().fill(0n);
     for (let i = 0; i < len; i++) {
         let suma = 0n;

[Killed] EqualityOperator
solutions-descriptive/31.js:6:21
 function convolution(P, Q) {
     let len = P.length;
     let R = new Array(len).fill(0n);
-    for (let i = 0; i < len; i++) {
+    for (let i = 0; i <= len; i++) {
         let suma = 0n;
         for (let j = 0; j <= i; j++) {
killedBy: n=1, m=2
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/31.js:6:21
 function convolution(P, Q) {
     let len = P.length;
     let R = new Array(len).fill(0n);
-    for (let i = 0; i < len; i++) {
+    for (let i = 0; false; i++) {
         let suma = 0n;
         for (let j = 0; j <= i; j++) {
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1n,
-   1n,

[Killed] ConditionalExpression
solutions-descriptive/31.js:8:25
     let R = new Array(len).fill(0n);
     for (let i = 0; i < len; i++) {
         let suma = 0n;
-        for (let j = 0; j <= i; j++) {
+        for (let j = 0; false; j++) {
             suma += P[j] * Q[i - j];
             suma %= MOD;
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1n,
-   1n,

[Killed] BlockStatement
solutions-descriptive/31.js:8:38
     let R = new Array(len).fill(0n);
     for (let i = 0; i < len; i++) {
         let suma = 0n;
-        for (let j = 0; j <= i; j++) {
-            suma += P[j] * Q[i - j];
-            suma %= MOD;
-        }
+        for (let j = 0; j <= i; j++) {}
         R[i] = suma;
     }
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1n,
-   1n,

[Killed] AssignmentOperator
solutions-descriptive/31.js:9:13
     for (let i = 0; i < len; i++) {
         let suma = 0n;
         for (let j = 0; j <= i; j++) {
-            suma += P[j] * Q[i - j];
+            suma -= P[j] * Q[i - j];
             suma %= MOD;
         }
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1n,
-   1n,

[Killed] ArithmeticOperator
solutions-descriptive/31.js:9:30
     for (let i = 0; i < len; i++) {
         let suma = 0n;
         for (let j = 0; j <= i; j++) {
-            suma += P[j] * Q[i - j];
+            suma += P[j] * Q[i + j];
             suma %= MOD;
         }
killedBy: n=1, m=2
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] AssignmentOperator
solutions-descriptive/31.js:10:13
         let suma = 0n;
         for (let j = 0; j <= i; j++) {
             suma += P[j] * Q[i - j];
-            suma %= MOD;
+            suma *= MOD;
         }
         R[i] = suma;
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1n,
-   1n,

[Killed] BlockStatement
solutions-descriptive/31.js:17:29
     return R;
 }
 
-export function solve(P, k) {
-    let len = P.length;
-    let R = new Array(len).fill(0n);
-    R[0] = 1n;
-    while (k > 0) {
-        if (k % 2n == 1n) {
-            R = convolution(R, P);
-        }
-        P = convolution(P, P);
-        k >>= 1n;
-    }
-    return R;
-}
+export function solve(P, k) {}
 
 // function testing_test() {
killedBy: n=1, m=2
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
solutions-descriptive/31.js:21:12
     let len = P.length;
     let R = new Array(len).fill(0n);
     R[0] = 1n;
-    while (k > 0) {
+    while (false) {
         if (k % 2n == 1n) {
             R = convolution(R, P);
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1n,
-   1n,

[Timeout] EqualityOperator
solutions-descriptive/31.js:21:12
     let len = P.length;
     let R = new Array(len).fill(0n);
     R[0] = 1n;
-    while (k > 0) {
+    while (k >= 0) {
         if (k % 2n == 1n) {
             R = convolution(R, P);

[Killed] ConditionalExpression
solutions-descriptive/31.js:22:13
     let R = new Array(len).fill(0n);
     R[0] = 1n;
     while (k > 0) {
-        if (k % 2n == 1n) {
+        if (false) {
             R = convolution(R, P);
         }
killedBy: n=1, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1n,
-   1n,

[Killed] ConditionalExpression
solutions-descriptive/31.js:22:13
     let R = new Array(len).fill(0n);
     R[0] = 1n;
     while (k > 0) {
-        if (k % 2n == 1n) {
+        if (true) {
             R = convolution(R, P);
         }
killedBy: n=2, m=2
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1n,
-   4n,

[Timeout] AssignmentOperator
solutions-descriptive/31.js:26:9
             R = convolution(R, P);
         }
         P = convolution(P, P);
-        k >>= 1n;
+        k <<= 1n;
     }
     return R;
