[Killed] EqualityOperator
solutions-descriptive/34.js:7:21
     let peakX = 0,
         peakY = 0;
 
-    for (let i = 0; i < setX.length; i++) {
+    for (let i = 0; i <= setX.length; i++) {
         totalX += setX[i];
         if (setX[i] > peakX) peakX = setX[i];
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:7:21
     let peakX = 0,
         peakY = 0;
 
-    for (let i = 0; i < setX.length; i++) {
+    for (let i = 0; i >= setX.length; i++) {
         totalX += setX[i];
         if (setX[i] > peakX) peakX = setX[i];
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] AssignmentOperator
solutions-descriptive/34.js:8:9
         peakY = 0;
 
     for (let i = 0; i < setX.length; i++) {
-        totalX += setX[i];
+        totalX -= setX[i];
         if (setX[i] > peakX) peakX = setX[i];
     }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:9:13
 
     for (let i = 0; i < setX.length; i++) {
         totalX += setX[i];
-        if (setX[i] > peakX) peakX = setX[i];
+        if (false) peakX = setX[i];
     }
 
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:9:13
 
     for (let i = 0; i < setX.length; i++) {
         totalX += setX[i];
-        if (setX[i] > peakX) peakX = setX[i];
+        if (setX[i] <= peakX) peakX = setX[i];
     }
 
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:12:21
         if (setX[i] > peakX) peakX = setX[i];
     }
 
-    for (let j = 0; j < setY.length; j++) {
+    for (let j = 0; j >= setY.length; j++) {
         totalY += setY[j];
         if (setY[j] > peakY) peakY = setY[j];
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Killed] BlockStatement
solutions-descriptive/34.js:12:43
         if (setX[i] > peakX) peakX = setX[i];
     }
 
-    for (let j = 0; j < setY.length; j++) {
-        totalY += setY[j];
-        if (setY[j] > peakY) peakY = setY[j];
-    }
+    for (let j = 0; j < setY.length; j++) {}
 
     if (totalX < totalY) return "-1";
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Killed] AssignmentOperator
solutions-descriptive/34.js:13:9
     }
 
     for (let j = 0; j < setY.length; j++) {
-        totalY += setY[j];
+        totalY -= setY[j];
         if (setY[j] > peakY) peakY = setY[j];
     }
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Survived] ConditionalExpression
solutions-descriptive/34.js:14:13
 
     for (let j = 0; j < setY.length; j++) {
         totalY += setY[j];
-        if (setY[j] > peakY) peakY = setY[j];
+        if (true) peakY = setY[j];
     }
 

[Survived] ConditionalExpression
solutions-descriptive/34.js:14:13
 
     for (let j = 0; j < setY.length; j++) {
         totalY += setY[j];
-        if (setY[j] > peakY) peakY = setY[j];
+        if (false) peakY = setY[j];
     }
 

[Killed] ConditionalExpression
solutions-descriptive/34.js:17:9
         if (setY[j] > peakY) peakY = setY[j];
     }
 
-    if (totalX < totalY) return "-1";
+    if (true) return "-1";
 
     let diffVal = totalX - totalY;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:17:9
         if (setY[j] > peakY) peakY = setY[j];
     }
 
-    if (totalX < totalY) return "-1";
+    if (totalX >= totalY) return "-1";
 
     let diffVal = totalX - totalY;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ArithmeticOperator
solutions-descriptive/34.js:19:19
 
     if (totalX < totalY) return "-1";
 
-    let diffVal = totalX - totalY;
+    let diffVal = totalX + totalY;
     setX.sort((a, b) => a - b);
     setY.sort((a, b) => a - b);
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Survived] ArithmeticOperator
solutions-descriptive/34.js:20:25
     if (totalX < totalY) return "-1";
 
     let diffVal = totalX - totalY;
-    setX.sort((a, b) => a - b);
+    setX.sort((a, b) => a + b);
     setY.sort((a, b) => a - b);
 

[Survived] MethodExpression
solutions-descriptive/34.js:20:5
     if (totalX < totalY) return "-1";
 
     let diffVal = totalX - totalY;
-    setX.sort((a, b) => a - b);
+    setX;
     setY.sort((a, b) => a - b);
 

[Killed] ArrowFunction
solutions-descriptive/34.js:21:15
 
     let diffVal = totalX - totalY;
     setX.sort((a, b) => a - b);
-    setY.sort((a, b) => a - b);
+    setY.sort(() => undefined);
 
     if (diffVal === 0) {
killedBy: unordered b, mod 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "-1"

[Killed] MethodExpression
solutions-descriptive/34.js:21:5
 
     let diffVal = totalX - totalY;
     setX.sort((a, b) => a - b);
-    setY.sort((a, b) => a - b);
+    setY;
 
     if (diffVal === 0) {
killedBy: unordered b, mod 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:23:9
     setX.sort((a, b) => a - b);
     setY.sort((a, b) => a - b);
 
-    if (diffVal === 0) {
+    if (true) {
         return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
     }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:23:9
     setX.sort((a, b) => a - b);
     setY.sort((a, b) => a - b);
 
-    if (diffVal === 0) {
+    if (diffVal !== 0) {
         return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
     }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:24:43
     setY.sort((a, b) => a - b);
 
     if (diffVal === 0) {
-        return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
+        return arraysMatch(setX, setY) ? (peakX + 1 > 1000000000 ? peakX + 1 : "-1") : "-1";
     }
 
killedBy: peakX + 1 exceeds 1e9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-1"
Received: 1000000001

[Killed] ArithmeticOperator
solutions-descriptive/34.js:24:43
     setY.sort((a, b) => a - b);
 
     if (diffVal === 0) {
-        return arraysMatch(setX, setY) ? (peakX + 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
+        return arraysMatch(setX, setY) ? (peakX - 1 <= 1000000000 ? peakX + 1 : "-1") : "-1";
     }
 
killedBy: peakX + 1 exceeds 1e9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-1"
Received: 1000000001

[Killed] ConditionalExpression
solutions-descriptive/34.js:28:23
     }
 
     let factors = [];
-    for (let fac = 1; fac * fac <= diffVal; fac++) {
+    for (let fac = 1; false; fac++) {
         if (diffVal % fac === 0) {
             factors.push(fac);
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] UpdateOperator
solutions-descriptive/34.js:28:45
     }
 
     let factors = [];
-    for (let fac = 1; fac * fac <= diffVal; fac++) {
+    for (let fac = 1; fac * fac <= diffVal; fac--) {
         if (diffVal % fac === 0) {
             factors.push(fac);
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ArithmeticOperator
solutions-descriptive/34.js:29:13
 
     let factors = [];
     for (let fac = 1; fac * fac <= diffVal; fac++) {
-        if (diffVal % fac === 0) {
+        if (diffVal * fac === 0) {
             factors.push(fac);
             if (fac * fac !== diffVal) factors.push(diffVal / fac);
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:29:13
 
     let factors = [];
     for (let fac = 1; fac * fac <= diffVal; fac++) {
-        if (diffVal % fac === 0) {
+        if (diffVal % fac !== 0) {
             factors.push(fac);
             if (fac * fac !== diffVal) factors.push(diffVal / fac);
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:31:17
     for (let fac = 1; fac * fac <= diffVal; fac++) {
         if (diffVal % fac === 0) {
             factors.push(fac);
-            if (fac * fac !== diffVal) factors.push(diffVal / fac);
+            if (false) factors.push(diffVal / fac);
         }
     }
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:31:17
     for (let fac = 1; fac * fac <= diffVal; fac++) {
         if (diffVal % fac === 0) {
             factors.push(fac);
-            if (fac * fac !== diffVal) factors.push(diffVal / fac);
+            if (fac * fac === diffVal) factors.push(diffVal / fac);
         }
     }
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "-1"

[Killed] ArithmeticOperator
solutions-descriptive/34.js:35:28
         }
     }
 
-    factors.sort((a, b) => a - b);
+    factors.sort((a, b) => a + b);
 
     for (let candidateFactor of factors) {
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "14"

[Killed] MethodExpression
solutions-descriptive/34.js:35:5
         }
     }
 
-    factors.sort((a, b) => a - b);
+    factors;
 
     for (let candidateFactor of factors) {
killedBy: different possible k, picks the lowest valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "7"
Received: "14"

[Killed] BlockStatement
solutions-descriptive/34.js:37:42
 
     factors.sort((a, b) => a - b);
 
-    for (let candidateFactor of factors) {
-        if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
-
-        let remainders = [];
-        for (let x of setX) {
-            remainders.push(x % candidateFactor);
-        }
-
-        remainders.sort((a, b) => a - b);
-
-        if (arraysMatch(remainders, setY)) {
-            return candidateFactor.toString();
-        }
-    }
+    for (let candidateFactor of factors) {}
 
     return "-1";
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:38:13
     factors.sort((a, b) => a - b);
 
     for (let candidateFactor of factors) {
-        if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
+        if (candidateFactor > peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
 
         let remainders = [];
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:38:13
     factors.sort((a, b) => a - b);
 
     for (let candidateFactor of factors) {
-        if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
+        if (true) continue;
 
         let remainders = [];
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] BlockStatement
solutions-descriptive/34.js:41:29
         if (candidateFactor <= peakY || candidateFactor > peakX || candidateFactor > 1000000000) continue;
 
         let remainders = [];
-        for (let x of setX) {
-            remainders.push(x % candidateFactor);
-        }
+        for (let x of setX) {}
 
         remainders.sort((a, b) => a - b);
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ArithmeticOperator
solutions-descriptive/34.js:42:29
 
         let remainders = [];
         for (let x of setX) {
-            remainders.push(x % candidateFactor);
+            remainders.push(x * candidateFactor);
         }
 
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Survived] MethodExpression
solutions-descriptive/34.js:45:9
             remainders.push(x % candidateFactor);
         }
 
-        remainders.sort((a, b) => a - b);
+        remainders;
 
         if (arraysMatch(remainders, setY)) {

[Survived] ArrowFunction
solutions-descriptive/34.js:45:25
             remainders.push(x % candidateFactor);
         }
 
-        remainders.sort((a, b) => a - b);
+        remainders.sort(() => undefined);
 
         if (arraysMatch(remainders, setY)) {

[Killed] ConditionalExpression
solutions-descriptive/34.js:47:13
 
         remainders.sort((a, b) => a - b);
 
-        if (arraysMatch(remainders, setY)) {
+        if (true) {
             return candidateFactor.toString();
         }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "2"

[Killed] ConditionalExpression
solutions-descriptive/34.js:47:13
 
         remainders.sort((a, b) => a - b);
 
-        if (arraysMatch(remainders, setY)) {
+        if (false) {
             return candidateFactor.toString();
         }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] BlockStatement
solutions-descriptive/34.js:55:34
     return "-1";
 }
 
-function arraysMatch(arr1, arr2) {
-    if (arr1.length !== arr2.length) return false;
-    for (let i = 0; i < arr1.length; i++) {
-        if (arr1[i] !== arr2[i]) return false;
-    }
-    return true;
-}
+function arraysMatch(arr1, arr2) {}
 
 // function testing_test() {
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:56:9
 }
 
 function arraysMatch(arr1, arr2) {
-    if (arr1.length !== arr2.length) return false;
+    if (true) return false;
     for (let i = 0; i < arr1.length; i++) {
         if (arr1[i] !== arr2[i]) return false;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] EqualityOperator
solutions-descriptive/34.js:56:9
 }
 
 function arraysMatch(arr1, arr2) {
-    if (arr1.length !== arr2.length) return false;
+    if (arr1.length === arr2.length) return false;
     for (let i = 0; i < arr1.length; i++) {
         if (arr1[i] !== arr2[i]) return false;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"

[Killed] ConditionalExpression
solutions-descriptive/34.js:57:21
 
 function arraysMatch(arr1, arr2) {
     if (arr1.length !== arr2.length) return false;
-    for (let i = 0; i < arr1.length; i++) {
+    for (let i = 0; false; i++) {
         if (arr1[i] !== arr2[i]) return false;
     }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "2"

[Killed] EqualityOperator
solutions-descriptive/34.js:57:21
 
 function arraysMatch(arr1, arr2) {
     if (arr1.length !== arr2.length) return false;
-    for (let i = 0; i < arr1.length; i++) {
+    for (let i = 0; i >= arr1.length; i++) {
         if (arr1[i] !== arr2[i]) return false;
     }
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "2"

[Killed] ConditionalExpression
solutions-descriptive/34.js:58:13
 function arraysMatch(arr1, arr2) {
     if (arr1.length !== arr2.length) return false;
     for (let i = 0; i < arr1.length; i++) {
-        if (arr1[i] !== arr2[i]) return false;
+        if (false) return false;
     }
     return true;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "2"

[Killed] ConditionalExpression
solutions-descriptive/34.js:58:13
 function arraysMatch(arr1, arr2) {
     if (arr1.length !== arr2.length) return false;
     for (let i = 0; i < arr1.length; i++) {
-        if (arr1[i] !== arr2[i]) return false;
+        if (true) return false;
     }
     return true;
killedBy: simple k, mod is 3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "-1"
