[Survived] ArithmeticOperator
solutions-descriptive/36.js:1:13
-const MOD = 1e9 + 7;
+const MOD = 1e9 - 7;
 const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
 

[Survived] ArithmeticOperator
solutions-descriptive/36.js:2:18
 const MOD = 1e9 + 7;
-const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
+const MOD_CUT = ((1 << 20) / (1 << 20)) % MOD;
 
 function add(a, b) {

[Survived] ArithmeticOperator
solutions-descriptive/36.js:2:17
 const MOD = 1e9 + 7;
-const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
+const MOD_CUT = (1 << 20) * (1 << 20) * MOD;
 
 function add(a, b) {

[Survived] BlockStatement
solutions-descriptive/36.js:4:20
 const MOD = 1e9 + 7;
 const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
 
-function add(a, b) {
-    return (a + b) % MOD;
-}
+function add(a, b) {}
 
 function minus(a, b) {

[Survived] ArithmeticOperator
solutions-descriptive/36.js:5:12
 const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
 
 function add(a, b) {
-    return (a + b) % MOD;
+    return (a + b) * MOD;
 }
 

[Survived] ArithmeticOperator
solutions-descriptive/36.js:5:13
 const MOD_CUT = ((1 << 20) * (1 << 20)) % MOD;
 
 function add(a, b) {
-    return (a + b) % MOD;
+    return (a - b) % MOD;
 }
 

[Survived] BlockStatement
solutions-descriptive/36.js:8:22
     return (a + b) % MOD;
 }
 
-function minus(a, b) {
-    return add(add(a, -b), MOD);
-}
+function minus(a, b) {}
 
 function mul(a, b) {

[Survived] UnaryOperator
solutions-descriptive/36.js:9:23
 }
 
 function minus(a, b) {
-    return add(add(a, -b), MOD);
+    return add(add(a, +b), MOD);
 }
 

[Killed] BlockStatement
solutions-descriptive/36.js:12:20
     return add(add(a, -b), MOD);
 }
 
-function mul(a, b) {
-    let r = (a >> 20) * (b >> 20) * MOD_CUT +
-        (a & 0xfff00000) * (b & 0xfffff) +
-        (a & 0xfffff) * b;
-    return r % MOD;
-}
+function mul(a, b) {}
 
 function pow(a, b) {
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: undefined

[Killed] ArithmeticOperator
solutions-descriptive/36.js:13:13
 }
 
 function mul(a, b) {
-    let r = (a >> 20) * (b >> 20) * MOD_CUT +
-        (a & 0xfff00000) * (b & 0xfffff) +
-        (a & 0xfffff) * b;
+    let r = (a >> 20) * (b >> 20) * MOD_CUT + (a & 0xfff00000) * (b & 0xfffff) - (a & 0xfffff) * b;
     return r % MOD;
 }
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 966445639

[Killed] ArithmeticOperator
solutions-descriptive/36.js:13:13
 }
 
 function mul(a, b) {
-    let r = (a >> 20) * (b >> 20) * MOD_CUT +
+    let r = (a >> 20) / (b >> 20) * MOD_CUT +
         (a & 0xfff00000) * (b & 0xfffff) +
         (a & 0xfffff) * b;
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: NaN

[Survived] ArithmeticOperator
solutions-descriptive/36.js:14:9
 
 function mul(a, b) {
     let r = (a >> 20) * (b >> 20) * MOD_CUT +
-        (a & 0xfff00000) * (b & 0xfffff) +
+        (a & 0xfff00000) / (b & 0xfffff) +
         (a & 0xfffff) * b;
     return r % MOD;

[Killed] ArithmeticOperator
solutions-descriptive/36.js:15:9
 function mul(a, b) {
     let r = (a >> 20) * (b >> 20) * MOD_CUT +
         (a & 0xfff00000) * (b & 0xfffff) +
-        (a & 0xfffff) * b;
+        (a & 0xfffff) / b;
     return r % MOD;
 }
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 1

[Killed] ArithmeticOperator
solutions-descriptive/36.js:16:12
     let r = (a >> 20) * (b >> 20) * MOD_CUT +
         (a & 0xfff00000) * (b & 0xfffff) +
         (a & 0xfffff) * b;
-    return r % MOD;
+    return r * MOD;
 }
 
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 2.1957915721347208e+39

[Killed] BlockStatement
solutions-descriptive/36.js:19:20
     return r % MOD;
 }
 
-function pow(a, b) {
-    let r = 1;
-    let base = a;
-    while (b) {
-        if (b & 1n) {
-            r = mul(r, base);
-        }
-        b /= 2n;
-        base = mul(base, base);
-    }
-    return r;
-}
+function pow(a, b) {}
 
 export function solve(n, m, k, queries) {
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: undefined

[Killed] ConditionalExpression
solutions-descriptive/36.js:22:12
 function pow(a, b) {
     let r = 1;
     let base = a;
-    while (b) {
+    while (false) {
         if (b & 1n) {
             r = mul(r, base);
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 1

[Timeout] BlockStatement
solutions-descriptive/36.js:22:15
 function pow(a, b) {
     let r = 1;
     let base = a;
-    while (b) {
-        if (b & 1n) {
-            r = mul(r, base);
-        }
-        b /= 2n;
-        base = mul(base, base);
-    }
+    while (b) {}
     return r;
 }

[Killed] ConditionalExpression
solutions-descriptive/36.js:23:13
     let r = 1;
     let base = a;
     while (b) {
-        if (b & 1n) {
+        if (true) {
             r = mul(r, base);
         }
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 128

[Killed] ConditionalExpression
solutions-descriptive/36.js:23:13
     let r = 1;
     let base = a;
     while (b) {
-        if (b & 1n) {
+        if (false) {
             r = mul(r, base);
         }
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 1

[Timeout] AssignmentOperator
solutions-descriptive/36.js:26:9
         if (b & 1n) {
             r = mul(r, base);
         }
-        b /= 2n;
+        b *= 2n;
         base = mul(base, base);
     }

[Killed] BlockStatement
solutions-descriptive/36.js:32:41
     return r;
 }
 
-export function solve(n, m, k, queries) {
-    let count = 0;
-    let black = 0;
-
-    for (let i = 0; i < k; i++) {
-        const [x, y, color] = queries[i];
-        const isBorder = x === 1 || x === n || y === 1 || y === m;
-        const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
-            (x === n && y === 1) || (x === n && y === m);
-        if (isBorder && !isCorner) {
-            count++;
-            black += color;
-        }
-    }
-
-    const total = BigInt(n) * BigInt(m) - BigInt(k);
-
-    if (count === 2 * (n + m - 4)) {
-        return (black & 1) ? 0 : pow(2, total);
-    } else {
-        return pow(2, total - 1);
-    }
-}
+export function solve(n, m, k, queries) {}
 
 // function testing_test() {
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
solutions-descriptive/36.js:36:21
     let count = 0;
     let black = 0;
 
-    for (let i = 0; i < k; i++) {
+    for (let i = 0; i >= k; i++) {
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/36.js:36:21
     let count = 0;
     let black = 0;
 
-    for (let i = 0; i < k; i++) {
+    for (let i = 0; false; i++) {
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] EqualityOperator
solutions-descriptive/36.js:38:48
 
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
-        const isBorder = x === 1 || x === n || y === 1 || y === m;
+        const isBorder = x === 1 || x === n || y !== 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/36.js:38:48
 
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
-        const isBorder = x === 1 || x === n || y === 1 || y === m;
+        const isBorder = x === 1 || x === n || false || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/36.js:39:26
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
-        const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
-            (x === n && y === 1) || (x === n && y === m);
+        const isCorner = true;
         if (isBorder && !isCorner) {
             count++;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
solutions-descriptive/36.js:39:51
     for (let i = 0; i < k; i++) {
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
-        const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
+        const isCorner = (x === 1 && y === 1) || (x === 1 || y === m) ||
             (x === n && y === 1) || (x === n && y === m);
         if (isBorder && !isCorner) {
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
solutions-descriptive/36.js:40:14
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
-            (x === n && y === 1) || (x === n && y === m);
+            (x === n || y === 1) || (x === n && y === m);
         if (isBorder && !isCorner) {
             count++;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] LogicalOperator
solutions-descriptive/36.js:40:38
         const [x, y, color] = queries[i];
         const isBorder = x === 1 || x === n || y === 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
-            (x === n && y === 1) || (x === n && y === m);
+            (x === n && y === 1) || (x === n || y === m);
         if (isBorder && !isCorner) {
             count++;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/36.js:41:36
         const isBorder = x === 1 || x === n || y === 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);
-        if (isBorder && !isCorner) {
-            count++;
-            black += color;
-        }
+        if (isBorder && !isCorner) {}
     }
 
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/36.js:41:13
         const isBorder = x === 1 || x === n || y === 1 || y === m;
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);
-        if (isBorder && !isCorner) {
+        if (false) {
             count++;
             black += color;
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] UpdateOperator
solutions-descriptive/36.js:42:13
         const isCorner = (x === 1 && y === 1) || (x === 1 && y === m) ||
             (x === n && y === 1) || (x === n && y === m);
         if (isBorder && !isCorner) {
-            count++;
+            count--;
             black += color;
         }
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Survived] AssignmentOperator
solutions-descriptive/36.js:43:13
             (x === n && y === 1) || (x === n && y === m);
         if (isBorder && !isCorner) {
             count++;
-            black += color;
+            black -= color;
         }
     }

[Killed] ArithmeticOperator
solutions-descriptive/36.js:47:19
         }
     }
 
-    const total = BigInt(n) * BigInt(m) - BigInt(k);
+    const total = BigInt(n) * BigInt(m) + BigInt(k);
 
     if (count === 2 * (n + m - 4)) {
killedBy: all border (not corner) cells filled, zero border cells, even black, 3x4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 64
Received: 262144

[Survived] ArithmeticOperator
solutions-descriptive/36.js:47:19
         }
     }
 
-    const total = BigInt(n) * BigInt(m) - BigInt(k);
+    const total = BigInt(n) / BigInt(m) - BigInt(k);
 
     if (count === 2 * (n + m - 4)) {

[Killed] EqualityOperator
solutions-descriptive/36.js:49:9
 
     const total = BigInt(n) * BigInt(m) - BigInt(k);
 
-    if (count === 2 * (n + m - 4)) {
+    if (count !== 2 * (n + m - 4)) {
         return (black & 1) ? 0 : pow(2, total);
     } else {
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/36.js:49:9
 
     const total = BigInt(n) * BigInt(m) - BigInt(k);
 
-    if (count === 2 * (n + m - 4)) {
+    if (false) {
         return (black & 1) ? 0 : pow(2, total);
     } else {
killedBy: all border (not corner) cells filled (odd black count), 3x3
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Survived] BlockStatement
solutions-descriptive/36.js:51:12
 
     if (count === 2 * (n + m - 4)) {
         return (black & 1) ? 0 : pow(2, total);
-    } else {
-        return pow(2, total - 1);
-    }
+    } else {}
 }
 

[Survived] ArithmeticOperator
solutions-descriptive/36.js:52:23
     if (count === 2 * (n + m - 4)) {
         return (black & 1) ? 0 : pow(2, total);
     } else {
-        return pow(2, total - 1);
+        return pow(2, total + 1);
     }
 }
