[Killed] BlockStatement
solutions-descriptive/39.js:1:43
-export function solve(arrayLength, array) {
-    const seen = new Set();
-    const firstZeroIndex = array.includes(0) ? array.indexOf(0) : -1;
-    let mex = 0;
-
-
-    for (let i = arrayLength - 1; i >= 0; i--) {
-        if (array[i] < mex) {
-            mex = 0;
-            break;
-        }
-
-
-        if (array[i] !== 0 || i === firstZeroIndex) {
-            seen.add(array[i]);
-            while (seen.has(mex)) {
-                mex++;
-            }
-        }
-    }
-
-    const countZeros = array.filter(value => value === 0).length;
-    return arrayLength - countZeros + (mex !== 0 ? 1 : 0);
-}
+export function solve(arrayLength, array) {}
 
 //function testing_test() {
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Survived] UnaryOperator
solutions-descriptive/39.js:3:67
 export function solve(arrayLength, array) {
     const seen = new Set();
-    const firstZeroIndex = array.includes(0) ? array.indexOf(0) : -1;
+    const firstZeroIndex = array.includes(0) ? array.indexOf(0) : +1;
     let mex = 0;
 

[Killed] ConditionalExpression
solutions-descriptive/39.js:7:35
     let mex = 0;
 
 
-    for (let i = arrayLength - 1; i >= 0; i--) {
+    for (let i = arrayLength - 1; false; i--) {
         if (array[i] < mex) {
             mex = 0;
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
solutions-descriptive/39.js:7:35
     let mex = 0;
 
 
-    for (let i = arrayLength - 1; i >= 0; i--) {
+    for (let i = arrayLength - 1; i < 0; i--) {
         if (array[i] < mex) {
             mex = 0;
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
solutions-descriptive/39.js:8:13
 
 
     for (let i = arrayLength - 1; i >= 0; i--) {
-        if (array[i] < mex) {
+        if (array[i] <= mex) {
             mex = 0;
             break;
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/39.js:8:13
 
 
     for (let i = arrayLength - 1; i >= 0; i--) {
-        if (array[i] < mex) {
+        if (true) {
             mex = 0;
             break;
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
solutions-descriptive/39.js:14:53
         }
 
 
-        if (array[i] !== 0 || i === firstZeroIndex) {
-            seen.add(array[i]);
-            while (seen.has(mex)) {
-                mex++;
-            }
-        }
+        if (array[i] !== 0 || i === firstZeroIndex) {}
     }
 
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/39.js:14:13
         }
 
 
-        if (array[i] !== 0 || i === firstZeroIndex) {
+        if (true) {
             seen.add(array[i]);
             while (seen.has(mex)) {
killedBy: all zeros
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
solutions-descriptive/39.js:16:20
 
         if (array[i] !== 0 || i === firstZeroIndex) {
             seen.add(array[i]);
-            while (seen.has(mex)) {
+            while (false) {
                 mex++;
             }
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Timeout] BlockStatement
solutions-descriptive/39.js:16:35
 
         if (array[i] !== 0 || i === firstZeroIndex) {
             seen.add(array[i]);
-            while (seen.has(mex)) {
-                mex++;
-            }
+            while (seen.has(mex)) {}
         }
     }

[Survived] UpdateOperator
solutions-descriptive/39.js:17:17
         if (array[i] !== 0 || i === firstZeroIndex) {
             seen.add(array[i]);
             while (seen.has(mex)) {
-                mex++;
+                mex--;
             }
         }

[Killed] ArrowFunction
solutions-descriptive/39.js:22:37
         }
     }
 
-    const countZeros = array.filter(value => value === 0).length;
+    const countZeros = array.filter(() => undefined).length;
     return arrayLength - countZeros + (mex !== 0 ? 1 : 0);
 }
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] MethodExpression
solutions-descriptive/39.js:22:24
         }
     }
 
-    const countZeros = array.filter(value => value === 0).length;
+    const countZeros = array.length;
     return arrayLength - countZeros + (mex !== 0 ? 1 : 0);
 }
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/39.js:23:12
     }
 
     const countZeros = array.filter(value => value === 0).length;
-    return arrayLength - countZeros + (mex !== 0 ? 1 : 0);
+    return arrayLength + countZeros + (mex !== 0 ? 1 : 0);
 }
 
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] ArithmeticOperator
solutions-descriptive/39.js:23:12
     }
 
     const countZeros = array.filter(value => value === 0).length;
-    return arrayLength - countZeros + (mex !== 0 ? 1 : 0);
+    return arrayLength - countZeros - (mex !== 0 ? 1 : 0);
 }
 
killedBy: single element array - minimum case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1
