[Killed] ArrowFunction
solutions-descriptive/4.js:4:52
 export function solve(array) {
     const arrayLength = array.length;
 
-    const dpTable = Array(arrayLength).fill(0).map(() => Array(arrayLength).fill(0));
+    const dpTable = Array(arrayLength).fill(0).map(() => undefined);
     let currentScore;
 
killedBy: n=3, all 1s
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArrayDeclaration
solutions-descriptive/4.js:4:58
 export function solve(array) {
     const arrayLength = array.length;
 
-    const dpTable = Array(arrayLength).fill(0).map(() => Array(arrayLength).fill(0));
+    const dpTable = Array(arrayLength).fill(0).map(() => Array().fill(0));
     let currentScore;
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/4.js:8:34
     let currentScore;
 
 
-    for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
+    for (let subarrayLength = 3; subarrayLength < arrayLength; subarrayLength++) {
         for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
             const end = start + subarrayLength - 1;
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
solutions-descriptive/4.js:8:34
     let currentScore;
 
 
-    for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
+    for (let subarrayLength = 3; subarrayLength > arrayLength; subarrayLength++) {
         for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
             const end = start + subarrayLength - 1;
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UpdateOperator
solutions-descriptive/4.js:9:71
 
 
     for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
-        for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
+        for (let start = 0; start + subarrayLength - 1 < arrayLength; start--) {
             const end = start + subarrayLength - 1;
 
killedBy: n=3, all 1s
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ConditionalExpression
solutions-descriptive/4.js:9:29
 
 
     for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
-        for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
+        for (let start = 0; false; start++) {
             const end = start + subarrayLength - 1;
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/4.js:10:25
 
     for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
         for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
-            const end = start + subarrayLength - 1;
+            const end = start - subarrayLength - 1;
 
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/4.js:10:25
 
     for (let subarrayLength = 3; subarrayLength <= arrayLength; subarrayLength++) {
         for (let start = 0; start + subarrayLength - 1 < arrayLength; start++) {
-            const end = start + subarrayLength - 1;
+            const end = start + subarrayLength + 1;
 
 
killedBy: n=3, all 1s
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] BlockStatement
solutions-descriptive/4.js:13:78
             const end = start + subarrayLength - 1;
 
 
-            for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
-
-                currentScore = array[start] * array[end] * array[splitPoint] +
-                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
-                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
-
-
-                currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint + 1][end] : 0);
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
-
-
-                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
-            }
+            for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {}
         }
     }
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UpdateOperator
solutions-descriptive/4.js:13:64
             const end = start + subarrayLength - 1;
 
 
-            for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
+            for (let splitPoint = start + 1; splitPoint < end; splitPoint--) {
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
killedBy: n=3, all 1s
statusReason: TypeError: Cannot read properties of undefined (reading '2')

[Killed] ArithmeticOperator
solutions-descriptive/4.js:15:32
 
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
-                currentScore = array[start] * array[end] * array[splitPoint] +
+                currentScore = array[start] / array[end] * array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
killedBy: n=3, varied values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1.5

[Killed] ArithmeticOperator
solutions-descriptive/4.js:15:32
 
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
-                currentScore = array[start] * array[end] * array[splitPoint] +
+                currentScore = array[start] * array[end] / array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
killedBy: n=3, varied values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 2.6666666666666665

[Killed] ArithmeticOperator
solutions-descriptive/4.js:16:71
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
-                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
+                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint + 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
killedBy: n=4, all equal values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 250

[Killed] ArithmeticOperator
solutions-descriptive/4.js:16:60
             for (let splitPoint = start + 1; splitPoint < end; splitPoint++) {
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
-                    (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
+                    (start + 1 <= splitPoint - 1 ? dpTable[start - 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
killedBy: n=4, all equal values
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Killed] ArithmeticOperator
solutions-descriptive/4.js:17:58
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
-                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
+                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint - 1][end - 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
killedBy: n=4, all equal values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 250

[Killed] ArithmeticOperator
solutions-descriptive/4.js:17:74
 
                 currentScore = array[start] * array[end] * array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
-                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
+                    (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end + 1] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
killedBy: n=4, all equal values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: NaN

[Killed] MethodExpression
solutions-descriptive/4.js:18:39
                 currentScore = array[start] * array[end] * array[splitPoint] +
                     (start + 1 <= splitPoint - 1 ? dpTable[start + 1][splitPoint - 1] : 0) +
                     (splitPoint + 1 <= end - 1 ? dpTable[splitPoint + 1][end - 1] : 0);
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
+                dpTable[start][end] = Math.min(dpTable[start][end], currentScore);
 
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/4.js:21:94
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint + 1][end] : 0);
+                currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint - 1][end] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
killedBy: n=4, all equal values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 250

[Survived] ArithmeticOperator
solutions-descriptive/4.js:21:62
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint + 1][end] : 0);
+                currentScore = dpTable[start][splitPoint] + (splitPoint - 1 <= end ? dpTable[splitPoint + 1][end] : 0);
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 

[Killed] MethodExpression
solutions-descriptive/4.js:22:39
 
 
                 currentScore = dpTable[start][splitPoint] + (splitPoint + 1 <= end ? dpTable[splitPoint + 1][end] : 0);
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
+                dpTable[start][end] = Math.min(dpTable[start][end], currentScore);
 
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/4.js:25:74
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
+                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint + 1] : 0) + dpTable[splitPoint][end];
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
             }
killedBy: n=4, all equal values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 125
Received: 250

[Survived] ArithmeticOperator
solutions-descriptive/4.js:25:42
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
 
 
-                currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
+                currentScore = (start <= splitPoint + 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
                 dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
             }

[Killed] MethodExpression
solutions-descriptive/4.js:26:39
 
 
                 currentScore = (start <= splitPoint - 1 ? dpTable[start][splitPoint - 1] : 0) + dpTable[splitPoint][end];
-                dpTable[start][end] = Math.max(dpTable[start][end], currentScore);
+                dpTable[start][end] = Math.min(dpTable[start][end], currentScore);
             }
         }
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
solutions-descriptive/4.js:30:23
             }
         }
     }
-    return dpTable[0][arrayLength - 1];
+    return dpTable[0][arrayLength + 1];
 }
 
killedBy: n=3, all 1s
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined
