[Killed] ConditionalExpression
solutions-descriptive/40.js:4:21
 export function solve(nodeCount, pattern) {
     const positionGroups = {};
     let maxLabel = 0;
-    for (let i = 0; i < nodeCount; i++) {
+    for (let i = 0; false; i++) {
         const value = pattern[i];
         if (!positionGroups[value]) positionGroups[value] = [];
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
-   1,
-   2,

[Killed] BlockStatement
solutions-descriptive/40.js:4:41
 export function solve(nodeCount, pattern) {
     const positionGroups = {};
     let maxLabel = 0;
-    for (let i = 0; i < nodeCount; i++) {
-        const value = pattern[i];
-        if (!positionGroups[value]) positionGroups[value] = [];
-        positionGroups[value].push(i);
-        maxLabel = Math.max(maxLabel, value);
-    }
+    for (let i = 0; i < nodeCount; i++) {}
 
     let leftPos = 1,
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
-   1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:6:13
     let maxLabel = 0;
     for (let i = 0; i < nodeCount; i++) {
         const value = pattern[i];
-        if (!positionGroups[value]) positionGroups[value] = [];
+        if (false) positionGroups[value] = [];
         positionGroups[value].push(i);
         maxLabel = Math.max(maxLabel, value);
killedBy: n=4, various patterns
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
solutions-descriptive/40.js:6:13
     let maxLabel = 0;
     for (let i = 0; i < nodeCount; i++) {
         const value = pattern[i];
-        if (!positionGroups[value]) positionGroups[value] = [];
+        if (positionGroups[value]) positionGroups[value] = [];
         positionGroups[value].push(i);
         maxLabel = Math.max(maxLabel, value);
killedBy: n=4, various patterns
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] MethodExpression
solutions-descriptive/40.js:8:20
         const value = pattern[i];
         if (!positionGroups[value]) positionGroups[value] = [];
         positionGroups[value].push(i);
-        maxLabel = Math.max(maxLabel, value);
+        maxLabel = Math.min(maxLabel, value);
     }
 
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Survived] ArithmeticOperator
solutions-descriptive/40.js:16:22
     const result = Array(nodeCount);
     const used = Array(nodeCount);
     let leftIndex = 0,
-        rightIndex = nodeCount - 1;
+        rightIndex = nodeCount + 1;
 
     for (let label = 1; label <= maxLabel; label++) {

[Killed] ConditionalExpression
solutions-descriptive/40.js:18:25
     let leftIndex = 0,
         rightIndex = nodeCount - 1;
 
-    for (let label = 1; label <= maxLabel; label++) {
+    for (let label = 1; false; label++) {
         while (used[leftIndex]) leftIndex++;
         while (used[rightIndex]) rightIndex--;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Killed] EqualityOperator
solutions-descriptive/40.js:18:25
     let leftIndex = 0,
         rightIndex = nodeCount - 1;
 
-    for (let label = 1; label <= maxLabel; label++) {
+    for (let label = 1; label > maxLabel; label++) {
         while (used[leftIndex]) leftIndex++;
         while (used[rightIndex]) rightIndex--;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Survived] ConditionalExpression
solutions-descriptive/40.js:19:16
         rightIndex = nodeCount - 1;
 
     for (let label = 1; label <= maxLabel; label++) {
-        while (used[leftIndex]) leftIndex++;
+        while (false) leftIndex++;
         while (used[rightIndex]) rightIndex--;
 

[Survived] UpdateOperator
solutions-descriptive/40.js:19:33
         rightIndex = nodeCount - 1;
 
     for (let label = 1; label <= maxLabel; label++) {
-        while (used[leftIndex]) leftIndex++;
+        while (used[leftIndex]) leftIndex--;
         while (used[rightIndex]) rightIndex--;
 

[Survived] UpdateOperator
solutions-descriptive/40.js:20:34
 
     for (let label = 1; label <= maxLabel; label++) {
         while (used[leftIndex]) leftIndex++;
-        while (used[rightIndex]) rightIndex--;
+        while (used[rightIndex]) rightIndex++;
 
         const group = positionGroups[label];

[Survived] ConditionalExpression
solutions-descriptive/40.js:20:16
 
     for (let label = 1; label <= maxLabel; label++) {
         while (used[leftIndex]) leftIndex++;
-        while (used[rightIndex]) rightIndex--;
+        while (false) rightIndex--;
 
         const group = positionGroups[label];

[Killed] EqualityOperator
solutions-descriptive/40.js:23:30
         while (used[rightIndex]) rightIndex--;
 
         const group = positionGroups[label];
-        const startsAtLeft = group[0] === leftIndex;
+        const startsAtLeft = group[0] !== leftIndex;
         const endsAtRight = group[group.length - 1] === rightIndex;
 
killedBy: Edge case: only one -1 (n=2)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:23:30
         while (used[rightIndex]) rightIndex--;
 
         const group = positionGroups[label];
-        const startsAtLeft = group[0] === leftIndex;
+        const startsAtLeft = true;
         const endsAtRight = group[group.length - 1] === rightIndex;
 
killedBy: Edge case: only one -1 (n=2)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Survived] EqualityOperator
solutions-descriptive/40.js:24:29
 
         const group = positionGroups[label];
         const startsAtLeft = group[0] === leftIndex;
-        const endsAtRight = group[group.length - 1] === rightIndex;
+        const endsAtRight = group[group.length - 1] !== rightIndex;
 
         if (label % 2 === 1) {

[Survived] ConditionalExpression
solutions-descriptive/40.js:24:29
 
         const group = positionGroups[label];
         const startsAtLeft = group[0] === leftIndex;
-        const endsAtRight = group[group.length - 1] === rightIndex;
+        const endsAtRight = false;
 
         if (label % 2 === 1) {

[Killed] BlockStatement
solutions-descriptive/40.js:26:30
         const startsAtLeft = group[0] === leftIndex;
         const endsAtRight = group[group.length - 1] === rightIndex;
 
-        if (label % 2 === 1) {
-            if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, rightPos, -1, mid);
-                        rightPos -= group.length;
-                        break;
-                    }
-                }
-            } else if (endsAtRight) {
-                rightPos -= group.length;
-                fillLinear(used, result, group, rightPos + 1, 1);
-            } else {
-                fillLinear(used, result, group, rightPos, -1);
-                rightPos -= group.length;
-            }
-        } else {
+        if (label % 2 === 1) {} else {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
    2,

[Survived] ConditionalExpression
solutions-descriptive/40.js:26:13
         const startsAtLeft = group[0] === leftIndex;
         const endsAtRight = group[group.length - 1] === rightIndex;
 
-        if (label % 2 === 1) {
+        if (true) {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {

[Killed] LogicalOperator
solutions-descriptive/40.js:27:17
         const endsAtRight = group[group.length - 1] === rightIndex;
 
         if (label % 2 === 1) {
-            if (startsAtLeft && endsAtRight) {
+            if (startsAtLeft || endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
killedBy: Edge case: only one -1 (n=2)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] BlockStatement
solutions-descriptive/40.js:27:46
         const endsAtRight = group[group.length - 1] === rightIndex;
 
         if (label % 2 === 1) {
-            if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, rightPos, -1, mid);
-                        rightPos -= group.length;
-                        break;
-                    }
-                }
-            } else if (endsAtRight) {
+            if (startsAtLeft && endsAtRight) {} else if (endsAtRight) {
                 rightPos -= group.length;
                 fillLinear(used, result, group, rightPos + 1, 1);
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:28:42
 
         if (label % 2 === 1) {
             if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
+                for (let mid = group[0]; false; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] EqualityOperator
solutions-descriptive/40.js:28:42
 
         if (label % 2 === 1) {
             if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
+                for (let mid = group[0]; mid >= nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:29:25
         if (label % 2 === 1) {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
+                    if (false) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);
                         rightPos -= group.length;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:29:25
         if (label % 2 === 1) {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
+                    if (false || pattern[mid] > label) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);
                         rightPos -= group.length;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] UnaryOperator
solutions-descriptive/40.js:30:70
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, rightPos, -1, mid);
+                        fillSymmetric(used, result, group, rightPos, +1, mid);
                         rightPos -= group.length;
                         break;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Set {
    1,
-   2,

[Survived] AssignmentOperator
solutions-descriptive/40.js:31:25
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, rightPos, -1, mid);
-                        rightPos -= group.length;
+                        rightPos += group.length;
                         break;
                     }

[Killed] BlockStatement
solutions-descriptive/40.js:35:37
                         break;
                     }
                 }
-            } else if (endsAtRight) {
-                rightPos -= group.length;
-                fillLinear(used, result, group, rightPos + 1, 1);
-            } else {
+            } else if (endsAtRight) {} else {
                 fillLinear(used, result, group, rightPos, -1);
                 rightPos -= group.length;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
    2,

[Survived] ConditionalExpression
solutions-descriptive/40.js:35:24
                         break;
                     }
                 }
-            } else if (endsAtRight) {
+            } else if (true) {
                 rightPos -= group.length;
                 fillLinear(used, result, group, rightPos + 1, 1);

[Killed] AssignmentOperator
solutions-descriptive/40.js:36:17
                     }
                 }
             } else if (endsAtRight) {
-                rightPos -= group.length;
+                rightPos += group.length;
                 fillLinear(used, result, group, rightPos + 1, 1);
             } else {
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Set {
    1,
    2,

[Killed] ArithmeticOperator
solutions-descriptive/40.js:37:49
                 }
             } else if (endsAtRight) {
                 rightPos -= group.length;
-                fillLinear(used, result, group, rightPos + 1, 1);
+                fillLinear(used, result, group, rightPos - 1, 1);
             } else {
                 fillLinear(used, result, group, rightPos, -1);
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 0

  Set {
    1,
    2,

[Killed] BlockStatement
solutions-descriptive/40.js:38:20
             } else if (endsAtRight) {
                 rightPos -= group.length;
                 fillLinear(used, result, group, rightPos + 1, 1);
-            } else {
-                fillLinear(used, result, group, rightPos, -1);
-                rightPos -= group.length;
-            }
+            } else {}
         } else {
             if (startsAtLeft && endsAtRight) {
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
    2,

[Killed] UnaryOperator
solutions-descriptive/40.js:39:59
                 rightPos -= group.length;
                 fillLinear(used, result, group, rightPos + 1, 1);
             } else {
-                fillLinear(used, result, group, rightPos, -1);
+                fillLinear(used, result, group, rightPos, +1);
                 rightPos -= group.length;
             }
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
    2,

[Killed] AssignmentOperator
solutions-descriptive/40.js:40:17
                 fillLinear(used, result, group, rightPos + 1, 1);
             } else {
                 fillLinear(used, result, group, rightPos, -1);
-                rightPos -= group.length;
+                rightPos += group.length;
             }
         } else {
killedBy: Distinct iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
    2,

[Killed] BlockStatement
solutions-descriptive/40.js:42:16
                 fillLinear(used, result, group, rightPos, -1);
                 rightPos -= group.length;
             }
-        } else {
-            if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, leftPos, 1, mid);
-                        leftPos += group.length;
-                        break;
-                    }
-                }
-            } else if (endsAtRight) {
-                leftPos += group.length;
-                fillLinear(used, result, group, leftPos - 1, -1);
-            } else {
-                fillLinear(used, result, group, leftPos, 1);
-                leftPos += group.length;
-            }
-        }
+        } else {}
     }
 
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] BlockStatement
solutions-descriptive/40.js:43:46
                 rightPos -= group.length;
             }
         } else {
-            if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, leftPos, 1, mid);
-                        leftPos += group.length;
-                        break;
-                    }
-                }
-            } else if (endsAtRight) {
+            if (startsAtLeft && endsAtRight) {} else if (endsAtRight) {
                 leftPos += group.length;
                 fillLinear(used, result, group, leftPos - 1, -1);
killedBy: n=6, more iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Survived] ConditionalExpression
solutions-descriptive/40.js:43:17
                 rightPos -= group.length;
             }
         } else {
-            if (startsAtLeft && endsAtRight) {
+            if (false) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {

[Killed] BlockStatement
solutions-descriptive/40.js:44:66
             }
         } else {
             if (startsAtLeft && endsAtRight) {
-                for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, leftPos, 1, mid);
-                        leftPos += group.length;
-                        break;
-                    }
-                }
+                for (let mid = group[0]; mid < nodeCount; mid++) {}
             } else if (endsAtRight) {
                 leftPos += group.length;
killedBy: n=6, more iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Killed] EqualityOperator
solutions-descriptive/40.js:45:45
         } else {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
+                    if (pattern[mid] < 0 || pattern[mid] <= label) {
                         fillSymmetric(used, result, group, leftPos, 1, mid);
                         leftPos += group.length;
killedBy: n=6, more iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
    2,

[Killed] BlockStatement
solutions-descriptive/40.js:45:67
         } else {
             if (startsAtLeft && endsAtRight) {
                 for (let mid = group[0]; mid < nodeCount; mid++) {
-                    if (pattern[mid] < 0 || pattern[mid] > label) {
-                        fillSymmetric(used, result, group, leftPos, 1, mid);
-                        leftPos += group.length;
-                        break;
-                    }
+                    if (pattern[mid] < 0 || pattern[mid] > label) {}
                 }
             } else if (endsAtRight) {
killedBy: n=6, more iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
    1,
-   2,

[Killed] AssignmentOperator
solutions-descriptive/40.js:47:25
                 for (let mid = group[0]; mid < nodeCount; mid++) {
                     if (pattern[mid] < 0 || pattern[mid] > label) {
                         fillSymmetric(used, result, group, leftPos, 1, mid);
-                        leftPos += group.length;
+                        leftPos -= group.length;
                         break;
                     }
killedBy: n=6, more iterations
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
+   -2,
    1,

[Survived] BlockStatement
solutions-descriptive/40.js:51:37
                         break;
                     }
                 }
-            } else if (endsAtRight) {
-                leftPos += group.length;
-                fillLinear(used, result, group, leftPos - 1, -1);
-            } else {
+            } else if (endsAtRight) {} else {
                 fillLinear(used, result, group, leftPos, 1);
                 leftPos += group.length;

[Survived] ConditionalExpression
solutions-descriptive/40.js:51:24
                         break;
                     }
                 }
-            } else if (endsAtRight) {
+            } else if (false) {
                 leftPos += group.length;
                 fillLinear(used, result, group, leftPos - 1, -1);

[Survived] AssignmentOperator
solutions-descriptive/40.js:52:17
                     }
                 }
             } else if (endsAtRight) {
-                leftPos += group.length;
+                leftPos -= group.length;
                 fillLinear(used, result, group, leftPos - 1, -1);
             } else {

[Survived] UnaryOperator
solutions-descriptive/40.js:53:62
                 }
             } else if (endsAtRight) {
                 leftPos += group.length;
-                fillLinear(used, result, group, leftPos - 1, -1);
+                fillLinear(used, result, group, leftPos - 1, +1);
             } else {
                 fillLinear(used, result, group, leftPos, 1);

[Survived] ArithmeticOperator
solutions-descriptive/40.js:53:49
                 }
             } else if (endsAtRight) {
                 leftPos += group.length;
-                fillLinear(used, result, group, leftPos - 1, -1);
+                fillLinear(used, result, group, leftPos + 1, -1);
             } else {
                 fillLinear(used, result, group, leftPos, 1);

[Killed] BlockStatement
solutions-descriptive/40.js:54:20
             } else if (endsAtRight) {
                 leftPos += group.length;
                 fillLinear(used, result, group, leftPos - 1, -1);
-            } else {
-                fillLinear(used, result, group, leftPos, 1);
-                leftPos += group.length;
-            }
+            } else {}
         }
     }
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] AssignmentOperator
solutions-descriptive/40.js:56:17
                 fillLinear(used, result, group, leftPos - 1, -1);
             } else {
                 fillLinear(used, result, group, leftPos, 1);
-                leftPos += group.length;
+                leftPos -= group.length;
             }
         }
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
+   0,
    1,

[Killed] UnaryOperator
solutions-descriptive/40.js:61:40
         }
     }
 
-    const negOneGroup = positionGroups[-1];
+    const negOneGroup = positionGroups[+1];
     if (negOneGroup) result[negOneGroup[0]] = leftPos;
 
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
    2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:62:9
     }
 
     const negOneGroup = positionGroups[-1];
-    if (negOneGroup) result[negOneGroup[0]] = leftPos;
+    if (false) result[negOneGroup[0]] = leftPos;
 
     return result;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Survived] ConditionalExpression
solutions-descriptive/40.js:62:9
     }
 
     const negOneGroup = positionGroups[-1];
-    if (negOneGroup) result[negOneGroup[0]] = leftPos;
+    if (true) result[negOneGroup[0]] = leftPos;
 
     return result;

[Killed] BlockStatement
solutions-descriptive/40.js:67:62
     return result;
 }
 
-function fillLinear(used, result, indices, startValue, step) {
-    for (let k = 0; k < indices.length; k++) {
-        result[indices[k]] = startValue;
-        used[indices[k]] = true;
-        startValue += step;
-    }
-}
+function fillLinear(used, result, indices, startValue, step) {}
 
 function fillSymmetric(used, result, indices, startValue, step, midIndex) {
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
-   1,
    2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:68:21
 }
 
 function fillLinear(used, result, indices, startValue, step) {
-    for (let k = 0; k < indices.length; k++) {
+    for (let k = 0; false; k++) {
         result[indices[k]] = startValue;
         used[indices[k]] = true;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
-   1,
    2,

[Killed] EqualityOperator
solutions-descriptive/40.js:68:21
 }
 
 function fillLinear(used, result, indices, startValue, step) {
-    for (let k = 0; k < indices.length; k++) {
+    for (let k = 0; k >= indices.length; k++) {
         result[indices[k]] = startValue;
         used[indices[k]] = true;
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Set {
-   1,
    2,

[Survived] BooleanLiteral
solutions-descriptive/40.js:70:28
 function fillLinear(used, result, indices, startValue, step) {
     for (let k = 0; k < indices.length; k++) {
         result[indices[k]] = startValue;
-        used[indices[k]] = true;
+        used[indices[k]] = false;
         startValue += step;
     }

[Killed] AssignmentOperator
solutions-descriptive/40.js:71:9
     for (let k = 0; k < indices.length; k++) {
         result[indices[k]] = startValue;
         used[indices[k]] = true;
-        startValue += step;
+        startValue -= step;
     }
 }
killedBy: n=4, various patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Set {
    1,
    2,

[Killed] BlockStatement
solutions-descriptive/40.js:75:75
     }
 }
 
-function fillSymmetric(used, result, indices, startValue, step, midIndex) {
-    let i = 0,
-        j = indices.length - 1;
-    while (indices[i] < midIndex) {
-        used[indices[i]] = true;
-        result[indices[i++]] = startValue;
-        startValue += step;
-    }
-    while (indices[j] > midIndex) {
-        used[indices[j]] = true;
-        result[indices[j--]] = startValue;
-        startValue += step;
-    }
-}
+function fillSymmetric(used, result, indices, startValue, step, midIndex) {}
 
 // function testing_test() {
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Set {
    1,
-   2,

[Killed] ArithmeticOperator
solutions-descriptive/40.js:77:13
 
 function fillSymmetric(used, result, indices, startValue, step, midIndex) {
     let i = 0,
-        j = indices.length - 1;
+        j = indices.length + 1;
     while (indices[i] < midIndex) {
         used[indices[i]] = true;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
-   2,
