[Killed] ConditionalExpression
solutions-descriptive/40.js:78:12
 function fillSymmetric(used, result, indices, startValue, step, midIndex) {
     let i = 0,
         j = indices.length - 1;
-    while (indices[i] < midIndex) {
+    while (false) {
         used[indices[i]] = true;
         result[indices[i++]] = startValue;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
-   2,

[Killed] EqualityOperator
solutions-descriptive/40.js:78:12
 function fillSymmetric(used, result, indices, startValue, step, midIndex) {
     let i = 0,
         j = indices.length - 1;
-    while (indices[i] < midIndex) {
+    while (indices[i] >= midIndex) {
         used[indices[i]] = true;
         result[indices[i++]] = startValue;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
-   2,

[Survived] BooleanLiteral
solutions-descriptive/40.js:79:28
     let i = 0,
         j = indices.length - 1;
     while (indices[i] < midIndex) {
-        used[indices[i]] = true;
+        used[indices[i]] = false;
         result[indices[i++]] = startValue;
         startValue += step;

[Killed] UpdateOperator
solutions-descriptive/40.js:80:24
         j = indices.length - 1;
     while (indices[i] < midIndex) {
         used[indices[i]] = true;
-        result[indices[i++]] = startValue;
+        result[indices[i--]] = startValue;
         startValue += step;
     }
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] AssignmentOperator
solutions-descriptive/40.js:81:9
     while (indices[i] < midIndex) {
         used[indices[i]] = true;
         result[indices[i++]] = startValue;
-        startValue += step;
+        startValue -= step;
     }
     while (indices[j] > midIndex) {
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Set {
    1,
-   2,

[Killed] ConditionalExpression
solutions-descriptive/40.js:83:12
         result[indices[i++]] = startValue;
         startValue += step;
     }
-    while (indices[j] > midIndex) {
+    while (false) {
         used[indices[j]] = true;
         result[indices[j--]] = startValue;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
-   2,

[Killed] EqualityOperator
solutions-descriptive/40.js:83:12
         result[indices[i++]] = startValue;
         startValue += step;
     }
-    while (indices[j] > midIndex) {
+    while (indices[j] <= midIndex) {
         used[indices[j]] = true;
         result[indices[j--]] = startValue;
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Set {
    1,
-   2,

[Survived] BooleanLiteral
solutions-descriptive/40.js:84:28
         startValue += step;
     }
     while (indices[j] > midIndex) {
-        used[indices[j]] = true;
+        used[indices[j]] = false;
         result[indices[j--]] = startValue;
         startValue += step;

[Killed] UpdateOperator
solutions-descriptive/40.js:85:24
     }
     while (indices[j] > midIndex) {
         used[indices[j]] = true;
-        result[indices[j--]] = startValue;
+        result[indices[j++]] = startValue;
         startValue += step;
     }
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Set {
    1,
-   2,

[Killed] AssignmentOperator
solutions-descriptive/40.js:86:9
     while (indices[j] > midIndex) {
         used[indices[j]] = true;
         result[indices[j--]] = startValue;
-        startValue += step;
+        startValue -= step;
     }
 }
killedBy: All elements except one removed in first iteration
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Set {
    1,
-   2,
