[Killed] BlockStatement
solutions-descriptive/41.js:122:34
         return high;
     }
 
-    function calculate(position) {
-        if (position <= 0) return 0n;
-
-        const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
-        const remaining = position - trianglePrefix[baseIndex];
-
-        let startRow, endCol;
-        if (remaining) {
-            startRow = baseIndex + 1;
-            endCol = baseIndex + remaining;
-        } else {
-            startRow = baseIndex;
-            endCol = arraySize;
-        }
-
-        return prefixTriangleSum[startRow - 1] +
-            (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
-            prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
-    }
+    function calculate(position) {}
 }
 
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 15
+ Received  + 15

  Array [
-   "1",
-   "4",

[Killed] EqualityOperator
solutions-descriptive/41.js:123:13
     }
 
     function calculate(position) {
-        if (position <= 0) return 0n;
+        if (position < 0) return 0n;
 
         const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/41.js:123:13
     }
 
     function calculate(position) {
-        if (position <= 0) return 0n;
+        if (false) return 0n;
 
         const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArrowFunction
solutions-descriptive/41.js:125:54
     function calculate(position) {
         if (position <= 0) return 0n;
 
-        const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
+        const baseIndex = binarySearch(1, arraySize, () => undefined);
         const remaining = position - trianglePrefix[baseIndex];
 
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/41.js:125:59
     function calculate(position) {
         if (position <= 0) return 0n;
 
-        const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
+        const baseIndex = binarySearch(1, arraySize, i => true);
         const remaining = position - trianglePrefix[baseIndex];
 
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
solutions-descriptive/41.js:126:27
         if (position <= 0) return 0n;
 
         const baseIndex = binarySearch(1, arraySize, i => trianglePrefix[i] <= position);
-        const remaining = position - trianglePrefix[baseIndex];
+        const remaining = position + trianglePrefix[baseIndex];
 
         let startRow, endCol;
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
solutions-descriptive/41.js:129:13
         const remaining = position - trianglePrefix[baseIndex];
 
         let startRow, endCol;
-        if (remaining) {
+        if (false) {
             startRow = baseIndex + 1;
             endCol = baseIndex + remaining;
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/41.js:129:24
         const remaining = position - trianglePrefix[baseIndex];
 
         let startRow, endCol;
-        if (remaining) {
-            startRow = baseIndex + 1;
-            endCol = baseIndex + remaining;
-        } else {
+        if (remaining) {} else {
             startRow = baseIndex;
             endCol = arraySize;
killedBy: Example case from description
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/41.js:130:24
 
         let startRow, endCol;
         if (remaining) {
-            startRow = baseIndex + 1;
+            startRow = baseIndex - 1;
             endCol = baseIndex + remaining;
         } else {
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
solutions-descriptive/41.js:131:22
         let startRow, endCol;
         if (remaining) {
             startRow = baseIndex + 1;
-            endCol = baseIndex + remaining;
+            endCol = baseIndex - remaining;
         } else {
             startRow = baseIndex;
killedBy: Example case from description
statusReason: TypeError: Cannot mix BigInt and other types, use explicit conversions

[Killed] BlockStatement
solutions-descriptive/41.js:132:16
         if (remaining) {
             startRow = baseIndex + 1;
             endCol = baseIndex + remaining;
-        } else {
-            startRow = baseIndex;
-            endCol = arraySize;
-        }
+        } else {}
 
         return prefixTriangleSum[startRow - 1] +
killedBy: Example case from description
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/41.js:137:34
             endCol = arraySize;
         }
 
-        return prefixTriangleSum[startRow - 1] +
+        return prefixTriangleSum[startRow + 1] +
             (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
             prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  + 13

  Array [
-   "1",
-   "4",

[Killed] ArithmeticOperator
solutions-descriptive/41.js:137:16
             endCol = arraySize;
         }
 
-        return prefixTriangleSum[startRow - 1] +
-            (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
+        return prefixTriangleSum[startRow - 1] - (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
             prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
     }
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  + 14

  Array [
-   "1",
-   "4",

[Killed] ArithmeticOperator
solutions-descriptive/41.js:138:54
         }
 
         return prefixTriangleSum[startRow - 1] +
-            (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
+            (prefixOfPrefix[endCol] - prefixOfPrefix[startRow + 1]) -
             prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
     }
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 13
+ Received  + 13

  Array [
-   "1",
-   "4",

[Killed] ArithmeticOperator
solutions-descriptive/41.js:138:14
         }
 
         return prefixTriangleSum[startRow - 1] +
-            (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
+            (prefixOfPrefix[endCol] + prefixOfPrefix[startRow - 1]) -
             prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
     }
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  + 10

  Array [
    "1",
    "4",

[Killed] ArithmeticOperator
solutions-descriptive/41.js:139:48
 
         return prefixTriangleSum[startRow - 1] +
             (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
-            prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
+            prefixArray[startRow - 1] * BigInt(endCol + startRow + 1);
     }
 }
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 10
+ Received  + 10

  Array [
    "1",
    "4",

[Killed] ArithmeticOperator
solutions-descriptive/41.js:139:13
 
         return prefixTriangleSum[startRow - 1] +
             (prefixOfPrefix[endCol] - prefixOfPrefix[startRow - 1]) -
-            prefixArray[startRow - 1] * BigInt(endCol - startRow + 1);
+            prefixArray[startRow - 1] / BigInt(endCol - startRow + 1);
     }
 }
killedBy: Example case from description
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -9,9 +9,9 @@
    "54",
    "60",
