[Killed] BlockStatement
solutions-descriptive/43.js:4:33
 export function solve(nodeCount, cost, values, edges) {
     values.unshift(0);
     const adjacencyList = {};
-    for (const [u, v] of edges) {
-        adjacencyList[u] = adjacencyList[u] || [];
-        adjacencyList[v] = adjacencyList[v] || [];
-        adjacencyList[u].push(v);
-        adjacencyList[v].push(u);
-    }
+    for (const [u, v] of edges) {}
 
     const dpExclude = Array(nodeCount + 1).fill(0);
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] ConditionalExpression
solutions-descriptive/43.js:5:28
     values.unshift(0);
     const adjacencyList = {};
     for (const [u, v] of edges) {
-        adjacencyList[u] = adjacencyList[u] || [];
+        adjacencyList[u] = false;
         adjacencyList[v] = adjacencyList[v] || [];
         adjacencyList[u].push(v);
killedBy: three camps, chain, must choose optimal
statusReason: TypeError: adjacencyList[u].push is not a function

[Killed] LogicalOperator
solutions-descriptive/43.js:5:28
     values.unshift(0);
     const adjacencyList = {};
     for (const [u, v] of edges) {
-        adjacencyList[u] = adjacencyList[u] || [];
+        adjacencyList[u] = adjacencyList[u] && [];
         adjacencyList[v] = adjacencyList[v] || [];
         adjacencyList[u].push(v);
killedBy: three camps, chain, must choose optimal
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] LogicalOperator
solutions-descriptive/43.js:6:28
     const adjacencyList = {};
     for (const [u, v] of edges) {
         adjacencyList[u] = adjacencyList[u] || [];
-        adjacencyList[v] = adjacencyList[v] || [];
+        adjacencyList[v] = adjacencyList[v] && [];
         adjacencyList[u].push(v);
         adjacencyList[v].push(u);
killedBy: three camps, chain, must choose optimal
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
solutions-descriptive/43.js:6:28
     const adjacencyList = {};
     for (const [u, v] of edges) {
         adjacencyList[u] = adjacencyList[u] || [];
-        adjacencyList[v] = adjacencyList[v] || [];
+        adjacencyList[v] = true;
         adjacencyList[u].push(v);
         adjacencyList[v].push(u);
killedBy: three camps, chain, must choose optimal
statusReason: TypeError: adjacencyList[v].push is not a function

[Killed] ArithmeticOperator
solutions-descriptive/43.js:11:29
         adjacencyList[v].push(u);
     }
 
-    const dpExclude = Array(nodeCount + 1).fill(0);
+    const dpExclude = Array(nodeCount - 1).fill(0);
     const dpInclude = Array(nodeCount + 1).fill(0);
 
killedBy: single camp, positive gold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Killed] ArrayDeclaration
solutions-descriptive/43.js:11:23
         adjacencyList[v].push(u);
     }
 
-    const dpExclude = Array(nodeCount + 1).fill(0);
+    const dpExclude = Array().fill(0);
     const dpInclude = Array(nodeCount + 1).fill(0);
 
killedBy: single camp, positive gold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Survived] ArithmeticOperator
solutions-descriptive/43.js:12:29
     }
 
     const dpExclude = Array(nodeCount + 1).fill(0);
-    const dpInclude = Array(nodeCount + 1).fill(0);
+    const dpInclude = Array(nodeCount - 1).fill(0);
 
     const stack = [

[Survived] ArrayDeclaration
solutions-descriptive/43.js:12:23
     }
 
     const dpExclude = Array(nodeCount + 1).fill(0);
-    const dpInclude = Array(nodeCount + 1).fill(0);
+    const dpInclude = Array().fill(0);
 
     const stack = [

[Survived] UnaryOperator
solutions-descriptive/43.js:15:16
     const dpInclude = Array(nodeCount + 1).fill(0);
 
     const stack = [
-        [1, 0, -1]
+        [1, 0, +1]
     ];
 

[Killed] ArrayDeclaration
solutions-descriptive/43.js:15:9
     const dpInclude = Array(nodeCount + 1).fill(0);
 
     const stack = [
-        [1, 0, -1]
+        []
     ];
 
killedBy: single camp, positive gold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] EqualityOperator
solutions-descriptive/43.js:18:12
         [1, 0, -1]
     ];
 
-    while (stack.length > 0) {
+    while (stack.length >= 0) {
         const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
         const neighbors = adjacencyList[currentNode] || [];
killedBy: single camp, positive gold
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArithmeticOperator
solutions-descriptive/43.js:19:65
     ];
 
     while (stack.length > 0) {
-        const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
+        const [currentNode, nextChildIndex, parentNode] = stack[stack.length + 1];
         const neighbors = adjacencyList[currentNode] || [];
 
killedBy: single camp, positive gold
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
solutions-descriptive/43.js:20:27
 
     while (stack.length > 0) {
         const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
-        const neighbors = adjacencyList[currentNode] || [];
+        const neighbors = true;
 
         if (nextChildIndex < neighbors.length) {
killedBy: single camp, positive gold
statusReason: TypeError: neighbors is not iterable

[Killed] ConditionalExpression
solutions-descriptive/43.js:20:27
 
     while (stack.length > 0) {
         const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
-        const neighbors = adjacencyList[currentNode] || [];
+        const neighbors = false;
 
         if (nextChildIndex < neighbors.length) {
killedBy: single camp, positive gold
statusReason: TypeError: neighbors is not iterable

[Killed] ConditionalExpression
solutions-descriptive/43.js:22:13
         const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
         const neighbors = adjacencyList[currentNode] || [];
 
-        if (nextChildIndex < neighbors.length) {
+        if (false) {
             stack[stack.length - 1][1]++;
             const childNode = neighbors[nextChildIndex];
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Survived] EqualityOperator
solutions-descriptive/43.js:22:13
         const [currentNode, nextChildIndex, parentNode] = stack[stack.length - 1];
         const neighbors = adjacencyList[currentNode] || [];
 
-        if (nextChildIndex < neighbors.length) {
+        if (nextChildIndex <= neighbors.length) {
             stack[stack.length - 1][1]++;
             const childNode = neighbors[nextChildIndex];

[Killed] ArithmeticOperator
solutions-descriptive/43.js:23:19
         const neighbors = adjacencyList[currentNode] || [];
 
         if (nextChildIndex < neighbors.length) {
-            stack[stack.length - 1][1]++;
+            stack[stack.length + 1][1]++;
             const childNode = neighbors[nextChildIndex];
             if (childNode !== parentNode) {
killedBy: three camps, chain, must choose optimal
statusReason: TypeError: Cannot read properties of undefined (reading '1')

[Timeout] UpdateOperator
solutions-descriptive/43.js:23:13
         const neighbors = adjacencyList[currentNode] || [];
 
         if (nextChildIndex < neighbors.length) {
-            stack[stack.length - 1][1]++;
+            stack[stack.length - 1][1]--;
             const childNode = neighbors[nextChildIndex];
             if (childNode !== parentNode) {

[Killed] EqualityOperator
solutions-descriptive/43.js:25:17
         if (nextChildIndex < neighbors.length) {
             stack[stack.length - 1][1]++;
             const childNode = neighbors[nextChildIndex];
-            if (childNode !== parentNode) {
+            if (childNode === parentNode) {
                 stack.push([childNode, 0, currentNode]);
             }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] BlockStatement
solutions-descriptive/43.js:25:43
         if (nextChildIndex < neighbors.length) {
             stack[stack.length - 1][1]++;
             const childNode = neighbors[nextChildIndex];
-            if (childNode !== parentNode) {
-                stack.push([childNode, 0, currentNode]);
-            }
+            if (childNode !== parentNode) {}
         } else {
             stack.pop();
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] ArrayDeclaration
solutions-descriptive/43.js:26:28
             stack[stack.length - 1][1]++;
             const childNode = neighbors[nextChildIndex];
             if (childNode !== parentNode) {
-                stack.push([childNode, 0, currentNode]);
+                stack.push([]);
             }
         } else {
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Timeout] BlockStatement
solutions-descriptive/43.js:28:16
             if (childNode !== parentNode) {
                 stack.push([childNode, 0, currentNode]);
             }
-        } else {
-            stack.pop();
-            dpInclude[currentNode] = values[currentNode];
-            for (const neighbor of neighbors) {
-                if (neighbor === parentNode) continue;
-                dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
-                dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
-            }
-        }
+        } else {}
     }
 

[Killed] BlockStatement
solutions-descriptive/43.js:31:47
         } else {
             stack.pop();
             dpInclude[currentNode] = values[currentNode];
-            for (const neighbor of neighbors) {
-                if (neighbor === parentNode) continue;
-                dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
-                dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
-            }
+            for (const neighbor of neighbors) {}
         }
     }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] ConditionalExpression
solutions-descriptive/43.js:32:21
             stack.pop();
             dpInclude[currentNode] = values[currentNode];
             for (const neighbor of neighbors) {
-                if (neighbor === parentNode) continue;
+                if (true) continue;
                 dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
                 dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] EqualityOperator
solutions-descriptive/43.js:32:21
             stack.pop();
             dpInclude[currentNode] = values[currentNode];
             for (const neighbor of neighbors) {
-                if (neighbor === parentNode) continue;
+                if (neighbor !== parentNode) continue;
                 dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
                 dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 5

[Killed] AssignmentOperator
solutions-descriptive/43.js:33:17
             dpInclude[currentNode] = values[currentNode];
             for (const neighbor of neighbors) {
                 if (neighbor === parentNode) continue;
-                dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
+                dpExclude[currentNode] -= Math.max(dpExclude[neighbor], dpInclude[neighbor]);
                 dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
             }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] MethodExpression
solutions-descriptive/43.js:33:43
             dpInclude[currentNode] = values[currentNode];
             for (const neighbor of neighbors) {
                 if (neighbor === parentNode) continue;
-                dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
+                dpExclude[currentNode] += Math.min(dpExclude[neighbor], dpInclude[neighbor]);
                 dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
             }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ArithmeticOperator
solutions-descriptive/43.js:34:95
             for (const neighbor of neighbors) {
                 if (neighbor === parentNode) continue;
                 dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
-                dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
+                dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 / cost);
             }
         }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 16

[Killed] MethodExpression
solutions-descriptive/43.js:34:43
             for (const neighbor of neighbors) {
                 if (neighbor === parentNode) continue;
                 dpExclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor]);
-                dpInclude[currentNode] += Math.max(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
+                dpInclude[currentNode] += Math.min(dpExclude[neighbor], dpInclude[neighbor] - 2 * cost);
             }
         }
killedBy: three camps, chain, must choose optimal
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 7

[Killed] MethodExpression
solutions-descriptive/43.js:39:12
         }
     }
 
-    return Math.max(dpExclude[1], dpInclude[1]);
+    return Math.min(dpExclude[1], dpInclude[1]);
 }
 
killedBy: single camp, positive gold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0
