[Timeout] ArithmeticOperator
solutions-descriptive/44.js:1:18
-const MAX_SIZE = 1e7 + 10;
+const MAX_SIZE = 1e7 - 10;
 const sgValues = new Uint32Array(MAX_SIZE);
 const isComposite = new Uint8Array(MAX_SIZE);

[Killed] BlockStatement
solutions-descriptive/44.js:7:28
 const factor = new Uint32Array(MAX_SIZE);
 const primes = [];
 
-function initializeSieve() {
-    let primeCount = 0;
-    for (let num = 2; num < MAX_SIZE; num++) {
-        if (!isComposite[num]) {
-            primes[primeCount++] = num;
-            factor[num] = num;
-        }
-        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
-            isComposite[num * primes[j]] = 1;
-            if (num % primes[j] === 0) {
-                factor[num * primes[j]] = factor[num];
-                break;
-            }
-            factor[num * primes[j]] = primes[j];
-        }
-    }
-}
+function initializeSieve() {}
 
 function computeSGValues() {
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Killed] ConditionalExpression
solutions-descriptive/44.js:9:23
 
 function initializeSieve() {
     let primeCount = 0;
-    for (let num = 2; num < MAX_SIZE; num++) {
+    for (let num = 2; false; num++) {
         if (!isComposite[num]) {
             primes[primeCount++] = num;
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Killed] EqualityOperator
solutions-descriptive/44.js:9:23
 
 function initializeSieve() {
     let primeCount = 0;
-    for (let num = 2; num < MAX_SIZE; num++) {
+    for (let num = 2; num >= MAX_SIZE; num++) {
         if (!isComposite[num]) {
             primes[primeCount++] = num;
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Killed] ConditionalExpression
solutions-descriptive/44.js:10:13
 function initializeSieve() {
     let primeCount = 0;
     for (let num = 2; num < MAX_SIZE; num++) {
-        if (!isComposite[num]) {
+        if (false) {
             primes[primeCount++] = num;
             factor[num] = num;
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Killed] BlockStatement
solutions-descriptive/44.js:10:32
 function initializeSieve() {
     let primeCount = 0;
     for (let num = 2; num < MAX_SIZE; num++) {
-        if (!isComposite[num]) {
-            primes[primeCount++] = num;
-            factor[num] = num;
-        }
+        if (!isComposite[num]) {}
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Timeout] UpdateOperator
solutions-descriptive/44.js:11:20
     let primeCount = 0;
     for (let num = 2; num < MAX_SIZE; num++) {
         if (!isComposite[num]) {
-            primes[primeCount++] = num;
+            primes[primeCount--] = num;
             factor[num] = num;
         }

[Killed] ConditionalExpression
solutions-descriptive/44.js:14:25
             primes[primeCount++] = num;
             factor[num] = num;
         }
-        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
+        for (let j = 0; false; j++) {
             isComposite[num * primes[j]] = 1;
             if (num % primes[j] === 0) {
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Killed] EqualityOperator
solutions-descriptive/44.js:14:25
             primes[primeCount++] = num;
             factor[num] = num;
         }
-        for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
+        for (let j = 0; j >= primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
             if (num % primes[j] === 0) {
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Timeout] ArithmeticOperator
solutions-descriptive/44.js:15:25
             factor[num] = num;
         }
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
-            isComposite[num * primes[j]] = 1;
+            isComposite[num / primes[j]] = 1;
             if (num % primes[j] === 0) {
                 factor[num * primes[j]] = factor[num];

[Killed] ConditionalExpression
solutions-descriptive/44.js:16:17
         }
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
-            if (num % primes[j] === 0) {
+            if (true) {
                 factor[num * primes[j]] = factor[num];
                 break;
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Timeout] EqualityOperator
solutions-descriptive/44.js:16:17
         }
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
-            if (num % primes[j] === 0) {
+            if (num % primes[j] !== 0) {
                 factor[num * primes[j]] = factor[num];
                 break;

[Timeout] ArithmeticOperator
solutions-descriptive/44.js:17:24
         for (let j = 0; j < primeCount && num * primes[j] < MAX_SIZE; j++) {
             isComposite[num * primes[j]] = 1;
             if (num % primes[j] === 0) {
-                factor[num * primes[j]] = factor[num];
+                factor[num / primes[j]] = factor[num];
                 break;
             }

[Timeout] ArithmeticOperator
solutions-descriptive/44.js:20:20
                 factor[num * primes[j]] = factor[num];
                 break;
             }
-            factor[num * primes[j]] = primes[j];
+            factor[num / primes[j]] = primes[j];
         }
     }

[Killed] BlockStatement
solutions-descriptive/44.js:25:28
     }
 }
 
-function computeSGValues() {
-    let maxSG = 0;
-    for (let i = 1; i < MAX_SIZE; i++) {
-        if (i & 1) {
-            if (!isComposite[i]) {
-                sgValues[i] = ++maxSG;
-            } else {
-                sgValues[i] = sgValues[factor[i]];
-            }
-        }
-    }
-}
+function computeSGValues() {}
 
 export function solve(arr) {
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] EqualityOperator
solutions-descriptive/44.js:27:21
 
 function computeSGValues() {
     let maxSG = 0;
-    for (let i = 1; i < MAX_SIZE; i++) {
+    for (let i = 1; i >= MAX_SIZE; i++) {
         if (i & 1) {
             if (!isComposite[i]) {
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] ConditionalExpression
solutions-descriptive/44.js:27:21
 
 function computeSGValues() {
     let maxSG = 0;
-    for (let i = 1; i < MAX_SIZE; i++) {
+    for (let i = 1; false; i++) {
         if (i & 1) {
             if (!isComposite[i]) {
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] ConditionalExpression
solutions-descriptive/44.js:28:13
 function computeSGValues() {
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
-        if (i & 1) {
+        if (false) {
             if (!isComposite[i]) {
                 sgValues[i] = ++maxSG;
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] BlockStatement
solutions-descriptive/44.js:28:20
 function computeSGValues() {
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
-        if (i & 1) {
-            if (!isComposite[i]) {
-                sgValues[i] = ++maxSG;
-            } else {
-                sgValues[i] = sgValues[factor[i]];
-            }
-        }
+        if (i & 1) {}
     }
 }
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] ConditionalExpression
solutions-descriptive/44.js:29:17
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
         if (i & 1) {
-            if (!isComposite[i]) {
+            if (false) {
                 sgValues[i] = ++maxSG;
             } else {
killedBy: single pile of 1 stone, Alice wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Alice"
Received: "Bob"

[Killed] ConditionalExpression
solutions-descriptive/44.js:29:17
     let maxSG = 0;
     for (let i = 1; i < MAX_SIZE; i++) {
         if (i & 1) {
-            if (!isComposite[i]) {
+            if (true) {
                 sgValues[i] = ++maxSG;
             } else {
killedBy: example test: [3, 2, 9], Bob wins
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "Alice"

[Timeout] UpdateOperator
solutions-descriptive/44.js:30:31
     for (let i = 1; i < MAX_SIZE; i++) {
         if (i & 1) {
             if (!isComposite[i]) {
-                sgValues[i] = ++maxSG;
+                sgValues[i] = --maxSG;
             } else {
                 sgValues[i] = sgValues[factor[i]];

[Timeout] BlockStatement
solutions-descriptive/44.js:31:20
         if (i & 1) {
             if (!isComposite[i]) {
                 sgValues[i] = ++maxSG;
-            } else {
-                sgValues[i] = sgValues[factor[i]];
-            }
+            } else {}
         }
     }

[Timeout] BlockStatement
solutions-descriptive/44.js:38:28
     }
 }
 
-export function solve(arr) {
-    let nimSum = 0;
-    for (let i = 0; i < arr.length; i++) {
-        nimSum ^= sgValues[arr[i]];
-    }
-    return nimSum ? "Alice" : "Bob";
-}
+export function solve(arr) {}
 
 initializeSieve();

[Timeout] EqualityOperator
solutions-descriptive/44.js:40:21
 
 export function solve(arr) {
     let nimSum = 0;
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; i <= arr.length; i++) {
         nimSum ^= sgValues[arr[i]];
     }

[Timeout] EqualityOperator
solutions-descriptive/44.js:40:21
 
 export function solve(arr) {
     let nimSum = 0;
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; i >= arr.length; i++) {
         nimSum ^= sgValues[arr[i]];
     }
