[Killed] BlockStatement
solutions-descriptive/5.js:1:26
-export function solve(n) {
-    const steps = [];
-
-    if (n === 81) {
-        steps.push("!");
-    } else {
-        steps.push(`add ${n - 81}`);
-        steps.push("!");
-    }
-
-    return steps;
-}
+export function solve(n) {}
 // function testing_test() {
 //     const testCases = [
killedBy: n is 81 (edge where digit sum maximum for <=10^9)
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["!"]
Received: undefined

[Killed] ConditionalExpression
solutions-descriptive/5.js:4:9
 export function solve(n) {
     const steps = [];
 
-    if (n === 81) {
+    if (true) {
         steps.push("!");
     } else {
killedBy: n is 1 (minimum possible n)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
-   "add -80",
    "!",

[Killed] ConditionalExpression
solutions-descriptive/5.js:4:9
 export function solve(n) {
     const steps = [];
 
-    if (n === 81) {
+    if (false) {
         steps.push("!");
     } else {
killedBy: n is 81 (edge where digit sum maximum for <=10^9)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "add 0",
    "!",

[Killed] StringLiteral
solutions-descriptive/5.js:5:20
     const steps = [];
 
     if (n === 81) {
-        steps.push("!");
+        steps.push("");
     } else {
         steps.push(`add ${n - 81}`);
killedBy: n is 81 (edge where digit sum maximum for <=10^9)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "!",
+   "",

[Killed] BlockStatement
solutions-descriptive/5.js:6:12
 
     if (n === 81) {
         steps.push("!");
-    } else {
-        steps.push(`add ${n - 81}`);
-        steps.push("!");
-    }
+    } else {}
 
     return steps;
killedBy: n is 1 (minimum possible n)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "add -80",
-   "!",

[Killed] ArithmeticOperator
solutions-descriptive/5.js:7:27
     if (n === 81) {
         steps.push("!");
     } else {
-        steps.push(`add ${n - 81}`);
+        steps.push(`add ${n + 81}`);
         steps.push("!");
     }
killedBy: n is 1 (minimum possible n)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "add -80",
+   "add 82",

[Killed] StringLiteral
solutions-descriptive/5.js:8:20
         steps.push("!");
     } else {
         steps.push(`add ${n - 81}`);
-        steps.push("!");
+        steps.push("");
     }
 
killedBy: n is 1 (minimum possible n)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "add -80",
-   "!",
