[Killed] UpdateOperator
solutions-descriptive/7.js:4:28
 export function solve(lines) {
     let n = parseInt(lines[0]);
     let tree = new Tree(n);
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; i < n; i--) {
         let [u, v] = lines[i].split(' ').map(x => parseInt(x) - 1);
         tree.addEdge(u, v);
killedBy: n = 2 (root and one child)
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] EqualityOperator
solutions-descriptive/7.js:4:21
 export function solve(lines) {
     let n = parseInt(lines[0]);
     let tree = new Tree(n);
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; i <= n; i++) {
         let [u, v] = lines[i].split(' ').map(x => parseInt(x) - 1);
         tree.addEdge(u, v);
killedBy: n = 1 (single node)
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ArrowFunction
solutions-descriptive/7.js:5:46
     let n = parseInt(lines[0]);
     let tree = new Tree(n);
     for (let i = 1; i < n; i++) {
-        let [u, v] = lines[i].split(' ').map(x => parseInt(x) - 1);
+        let [u, v] = lines[i].split(' ').map(() => undefined);
         tree.addEdge(u, v);
     }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:5:51
     let n = parseInt(lines[0]);
     let tree = new Tree(n);
     for (let i = 1; i < n; i++) {
-        let [u, v] = lines[i].split(' ').map(x => parseInt(x) - 1);
+        let [u, v] = lines[i].split(' ').map(x => parseInt(x) + 1);
         tree.addEdge(u, v);
     }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:11:24
     tree.build(0);
 
     let maxDepth = tree.depth;
-    let nDepth = Array(maxDepth + 1).fill(0);
+    let nDepth = Array(maxDepth - 1).fill(0);
     let subtreeSize = Array(n).fill(1);
 
killedBy: n = 1 (single node)
statusReason: RangeError: Invalid array length

[Killed] BlockStatement
solutions-descriptive/7.js:14:56
     let nDepth = Array(maxDepth + 1).fill(0);
     let subtreeSize = Array(n).fill(1);
 
-    for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
-        let u = tree.bfsTour[i];
-        nDepth[tree.nodeDepth[u]]++;
-        if (!tree.isRoot(u)) {
-            subtreeSize[tree.parent[u]] += subtreeSize[u];
-        }
-    }
+    for (let i = tree.bfsTour.length - 1; i >= 0; i--) {}
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-2"

[Killed] EqualityOperator
solutions-descriptive/7.js:14:43
     let nDepth = Array(maxDepth + 1).fill(0);
     let subtreeSize = Array(n).fill(1);
 
-    for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
+    for (let i = tree.bfsTour.length - 1; i < 0; i--) {
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-2"

[Killed] UpdateOperator
solutions-descriptive/7.js:16:9
 
     for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
         let u = tree.bfsTour[i];
-        nDepth[tree.nodeDepth[u]]++;
+        nDepth[tree.nodeDepth[u]]--;
         if (!tree.isRoot(u)) {
             subtreeSize[tree.parent[u]] += subtreeSize[u];
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-6"

[Killed] ConditionalExpression
solutions-descriptive/7.js:17:13
     for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;
-        if (!tree.isRoot(u)) {
+        if (false) {
             subtreeSize[tree.parent[u]] += subtreeSize[u];
         }
killedBy: n = 3, chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "2"

[Killed] BooleanLiteral
solutions-descriptive/7.js:17:13
     for (let i = tree.bfsTour.length - 1; i >= 0; i--) {
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;
-        if (!tree.isRoot(u)) {
+        if (tree.isRoot(u)) {
             subtreeSize[tree.parent[u]] += subtreeSize[u];
         }
killedBy: n = 3, chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "2"

[Killed] AssignmentOperator
solutions-descriptive/7.js:18:13
         let u = tree.bfsTour[i];
         nDepth[tree.nodeDepth[u]]++;
         if (!tree.isRoot(u)) {
-            subtreeSize[tree.parent[u]] += subtreeSize[u];
+            subtreeSize[tree.parent[u]] -= subtreeSize[u];
         }
     }
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "1"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:22:28
         }
     }
 
-    let nDepthPref = Array(maxDepth + 2).fill(0);
+    let nDepthPref = Array(maxDepth - 2).fill(0);
     for (let d = 0; d <= maxDepth; d++) {
         nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
killedBy: n = 1 (single node)
statusReason: RangeError: Invalid array length

[Killed] ArrayDeclaration
solutions-descriptive/7.js:22:22
         }
     }
 
-    let nDepthPref = Array(maxDepth + 2).fill(0);
+    let nDepthPref = Array().fill(0);
     for (let d = 0; d <= maxDepth; d++) {
         nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
killedBy: n = 1 (single node)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] EqualityOperator
solutions-descriptive/7.js:23:21
     }
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
-    for (let d = 0; d <= maxDepth; d++) {
+    for (let d = 0; d < maxDepth; d++) {
         nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
     }
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-4"

[Killed] BlockStatement
solutions-descriptive/7.js:23:41
     }
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
-    for (let d = 0; d <= maxDepth; d++) {
-        nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
-    }
+    for (let d = 0; d <= maxDepth; d++) {}
 
     let ans = BigInt(0);
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-2"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:24:20
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
     for (let d = 0; d <= maxDepth; d++) {
-        nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
+        nDepthPref[d - 1] = nDepthPref[d] + nDepth[d];
     }
 
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-2"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:24:29
 
     let nDepthPref = Array(maxDepth + 2).fill(0);
     for (let d = 0; d <= maxDepth; d++) {
-        nDepthPref[d + 1] = nDepthPref[d] + nDepth[d];
+        nDepthPref[d + 1] = nDepthPref[d] - nDepth[d];
     }
 
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-4"

[Killed] EqualityOperator
solutions-descriptive/7.js:28:21
     }
 
     let ans = BigInt(0);
-    for (let u = 0; u < n; u++) {
+    for (let u = 0; u >= n; u++) {
         let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "-16"

[Killed] ConditionalExpression
solutions-descriptive/7.js:28:21
     }
 
     let ans = BigInt(0);
-    for (let u = 0; u < n; u++) {
+    for (let u = 0; false; u++) {
         let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "-16"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:29:35
 
     let ans = BigInt(0);
     for (let u = 0; u < n; u++) {
-        let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
+        let k = BigInt(nDepthPref[maxDepth - 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
killedBy: n = 1 (single node)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:29:24
 
     let ans = BigInt(0);
     for (let u = 0; u < n; u++) {
-        let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
+        let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] + subtreeSize[u]);
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "4"

[Killed] AssignmentOperator
solutions-descriptive/7.js:30:9
     let ans = BigInt(0);
     for (let u = 0; u < n; u++) {
         let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
-        ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
+        ans -= BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
 
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "-38"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:30:16
     let ans = BigInt(0);
     for (let u = 0; u < n; u++) {
         let k = BigInt(nDepthPref[maxDepth + 1] - nDepthPref[tree.nodeDepth[u]] - subtreeSize[u]);
-        ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
+        ans += BigInt(2) / BigInt(tree.nodeDepth[u]) * k;
     }
 
killedBy: n = 1 (single node)
statusReason: RangeError: Division by zero

[Killed] EqualityOperator
solutions-descriptive/7.js:33:21
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
 
-    for (let d = 0; d <= maxDepth; d++) {
+    for (let d = 0; d > maxDepth; d++) {
         ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
     }
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "12"

[Killed] UpdateOperator
solutions-descriptive/7.js:33:36
         ans += BigInt(2) * BigInt(tree.nodeDepth[u]) * k;
     }
 
-    for (let d = 0; d <= maxDepth; d++) {
+    for (let d = 0; d <= maxDepth; d--) {
         ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
     }
killedBy: n = 1 (single node)
statusReason: TypeError: Cannot convert undefined to a BigInt

[Killed] ArithmeticOperator
solutions-descriptive/7.js:34:55
     }
 
     for (let d = 0; d <= maxDepth; d++) {
-        ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
+        ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] + 1);
     }
 
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-2"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:34:16
     }
 
     for (let d = 0; d <= maxDepth; d++) {
-        ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
+        ans -= BigInt(d) * BigInt(nDepth[d]) / BigInt(nDepth[d] - 1);
     }
 
killedBy: n = 1 (single node)
statusReason: RangeError: Division by zero

[Killed] BlockStatement
solutions-descriptive/7.js:37:33
         ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
     }
 
-    for (let u = 0; u < n; u++) {
-        let pairs = BigInt(0);
-        for (let v of tree.children(u)) {
-            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
-        }
-        pairs /= BigInt(2);
-        ans -= BigInt(2 * tree.nodeDepth[u] + 1) * pairs;
-    }
+    for (let u = 0; u < n; u++) {}
 
     return ans.toString();
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "16"

[Killed] EqualityOperator
solutions-descriptive/7.js:37:21
         ans -= BigInt(d) * BigInt(nDepth[d]) * BigInt(nDepth[d] - 1);
     }
 
-    for (let u = 0; u < n; u++) {
+    for (let u = 0; u >= n; u++) {
         let pairs = BigInt(0);
         for (let v of tree.children(u)) {
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "16"

[Killed] BlockStatement
solutions-descriptive/7.js:39:41
 
     for (let u = 0; u < n; u++) {
         let pairs = BigInt(0);
-        for (let v of tree.children(u)) {
-            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
-        }
+        for (let v of tree.children(u)) {}
         pairs /= BigInt(2);
         ans -= BigInt(2 * tree.nodeDepth[u] + 1) * pairs;
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "16"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:40:54
     for (let u = 0; u < n; u++) {
         let pairs = BigInt(0);
         for (let v of tree.children(u)) {
-            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
+            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 + subtreeSize[v]);
         }
         pairs /= BigInt(2);
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-1"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:40:54
     for (let u = 0; u < n; u++) {
         let pairs = BigInt(0);
         for (let v of tree.children(u)) {
-            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
+            pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] + 1 - subtreeSize[v]);
         }
         pairs /= BigInt(2);
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "-1"

[Killed] AssignmentOperator
solutions-descriptive/7.js:42:9
         for (let v of tree.children(u)) {
             pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
         }
-        pairs /= BigInt(2);
+        pairs *= BigInt(2);
         ans -= BigInt(2 * tree.nodeDepth[u] + 1) * pairs;
     }
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "-24"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:43:23
             pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
         }
         pairs /= BigInt(2);
-        ans -= BigInt(2 * tree.nodeDepth[u] + 1) * pairs;
+        ans -= BigInt(2 * tree.nodeDepth[u] - 1) * pairs;
     }
 
killedBy: n = 6, more children
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "6"
Received: "18"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:43:16
             pairs += BigInt(subtreeSize[v]) * BigInt(subtreeSize[u] - 1 - subtreeSize[v]);
         }
         pairs /= BigInt(2);
-        ans -= BigInt(2 * tree.nodeDepth[u] + 1) * pairs;
+        ans -= BigInt(2 * tree.nodeDepth[u] + 1) / pairs;
     }
 
killedBy: n = 1 (single node)
statusReason: RangeError: Division by zero

[Killed] BlockStatement
solutions-descriptive/7.js:50:20
 }
 
 class Tree {
-    constructor(n) {
-        this.n = n;
-        this.root = -1;
-        this.depth = -1;
-        this.parent = new Array(n).fill(-1);
-        this.nodeDepth = new Array(n).fill(-1);
-        this.bfsTour = [];
-        this.edges = [];
-        this.s = new Array(n + 2).fill(0);
-        this.g = [];
-    }
+    constructor(n) {}
 
     addEdge(u, v) {
killedBy: n = 1 (single node)
statusReason: TypeError: this.edges is not iterable

[Survived] UnaryOperator
solutions-descriptive/7.js:52:21
 class Tree {
     constructor(n) {
         this.n = n;
-        this.root = -1;
+        this.root = +1;
         this.depth = -1;
         this.parent = new Array(n).fill(-1);

[Survived] UnaryOperator
solutions-descriptive/7.js:53:22
     constructor(n) {
         this.n = n;
         this.root = -1;
-        this.depth = -1;
+        this.depth = +1;
         this.parent = new Array(n).fill(-1);
         this.nodeDepth = new Array(n).fill(-1);

[Survived] UnaryOperator
solutions-descriptive/7.js:54:41
         this.n = n;
         this.root = -1;
         this.depth = -1;
-        this.parent = new Array(n).fill(-1);
+        this.parent = new Array(n).fill(+1);
         this.nodeDepth = new Array(n).fill(-1);
         this.bfsTour = [];

[Survived] ArrayDeclaration
solutions-descriptive/7.js:54:23
         this.n = n;
         this.root = -1;
         this.depth = -1;
-        this.parent = new Array(n).fill(-1);
+        this.parent = new Array().fill(-1);
         this.nodeDepth = new Array(n).fill(-1);
         this.bfsTour = [];

[Survived] UnaryOperator
solutions-descriptive/7.js:55:44
         this.root = -1;
         this.depth = -1;
         this.parent = new Array(n).fill(-1);
-        this.nodeDepth = new Array(n).fill(-1);
+        this.nodeDepth = new Array(n).fill(+1);
         this.bfsTour = [];
         this.edges = [];

[Killed] ArithmeticOperator
solutions-descriptive/7.js:58:28
         this.nodeDepth = new Array(n).fill(-1);
         this.bfsTour = [];
         this.edges = [];
-        this.s = new Array(n + 2).fill(0);
+        this.s = new Array(n - 2).fill(0);
         this.g = [];
     }
killedBy: n = 1 (single node)
statusReason: RangeError: Invalid array length

[Survived] ArrayDeclaration
solutions-descriptive/7.js:59:18
         this.bfsTour = [];
         this.edges = [];
         this.s = new Array(n + 2).fill(0);
-        this.g = [];
+        this.g = ["Stryker was here"];
     }
 

[Killed] BlockStatement
solutions-descriptive/7.js:62:19
         this.g = [];
     }
 
-    addEdge(u, v) {
-        this.edges.push(u, v);
-    }
+    addEdge(u, v) {}
 
     adjItr(node) {
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] BlockStatement
solutions-descriptive/7.js:66:18
         this.edges.push(u, v);
     }
 
-    adjItr(node) {
-        let res = [];
-        for (let i = this.s[node]; i < this.s[node + 1]; i++) {
-            res.push(this.g[i]);
-        }
-        return res;
-    }
+    adjItr(node) {}
 
     build(root) {
killedBy: n = 1 (single node)
statusReason: TypeError: this.adjItr is not a function or its return value is not iterable

[Killed] BlockStatement
solutions-descriptive/7.js:68:63
 
     adjItr(node) {
         let res = [];
-        for (let i = this.s[node]; i < this.s[node + 1]; i++) {
-            res.push(this.g[i]);
-        }
+        for (let i = this.s[node]; i < this.s[node + 1]; i++) {}
         return res;
     }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:68:47
 
     adjItr(node) {
         let res = [];
-        for (let i = this.s[node]; i < this.s[node + 1]; i++) {
+        for (let i = this.s[node]; i < this.s[node - 1]; i++) {
             res.push(this.g[i]);
         }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] UpdateOperator
solutions-descriptive/7.js:75:35
     }
 
     build(root) {
-        for (let i of this.edges) this.s[i + 2]++;
+        for (let i of this.edges) this.s[i + 2]--;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
killedBy: n = 3, chain tree
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:75:42
     }
 
     build(root) {
-        for (let i of this.edges) this.s[i + 2]++;
+        for (let i of this.edges) this.s[i - 2]++;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] AssignmentOperator
solutions-descriptive/7.js:76:46
 
     build(root) {
         for (let i of this.edges) this.s[i + 2]++;
-        for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
+        for (let i = 0; i < this.n + 1; i++) this.s[i + 1] -= this.s[i];
         this.g = new Array(this.edges.length);
         for (let i = 0; i < this.edges.length; i++) {
killedBy: n = 3, chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "11"

[Killed] ArithmeticOperator
solutions-descriptive/7.js:76:53
 
     build(root) {
         for (let i of this.edges) this.s[i + 2]++;
-        for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
+        for (let i = 0; i < this.n + 1; i++) this.s[i - 1] += this.s[i];
         this.g = new Array(this.edges.length);
         for (let i = 0; i < this.edges.length; i++) {
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Survived] ArrayDeclaration
solutions-descriptive/7.js:77:18
     build(root) {
         for (let i of this.edges) this.s[i + 2]++;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
-        this.g = new Array(this.edges.length);
+        this.g = new Array();
         for (let i = 0; i < this.edges.length; i++) {
             let j = this.edges[i] + 1;

[Killed] ConditionalExpression
solutions-descriptive/7.js:78:25
         for (let i of this.edges) this.s[i + 2]++;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
-        for (let i = 0; i < this.edges.length; i++) {
+        for (let i = 0; false; i++) {
             let j = this.edges[i] + 1;
             this.g[this.s[j]] = this.edges[i ^ 1];
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] BlockStatement
solutions-descriptive/7.js:78:53
         for (let i of this.edges) this.s[i + 2]++;
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
-        for (let i = 0; i < this.edges.length; i++) {
-            let j = this.edges[i] + 1;
-            this.g[this.s[j]] = this.edges[i ^ 1];
-            this.s[j]++;
-        }
+        for (let i = 0; i < this.edges.length; i++) {}
 
         this.root = root;
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:79:21
         for (let i = 0; i < this.n + 1; i++) this.s[i + 1] += this.s[i];
         this.g = new Array(this.edges.length);
         for (let i = 0; i < this.edges.length; i++) {
-            let j = this.edges[i] + 1;
+            let j = this.edges[i] - 1;
             this.g[this.s[j]] = this.edges[i ^ 1];
             this.s[j]++;
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] UpdateOperator
solutions-descriptive/7.js:81:13
         for (let i = 0; i < this.edges.length; i++) {
             let j = this.edges[i] + 1;
             this.g[this.s[j]] = this.edges[i ^ 1];
-            this.s[j]++;
+            this.s[j]--;
         }
 
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] UnaryOperator
solutions-descriptive/7.js:85:29
         }
 
         this.root = root;
-        this.parent[root] = -1;
+        this.parent[root] = +1;
         this.nodeDepth[root] = 0;
         this.bfsTour = [root];
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] BlockStatement
solutions-descriptive/7.js:89:37
         this.nodeDepth[root] = 0;
         this.bfsTour = [root];
 
-        for (let v of this.bfsTour) {
-            for (let u of this.adjItr(v)) {
-                if (u !== this.parent[v]) {
-                    this.parent[u] = v;
-                    this.nodeDepth[u] = this.nodeDepth[v] + 1;
-                    this.bfsTour.push(u);
-                }
-            }
-        }
+        for (let v of this.bfsTour) {}
 
         this.depth = this.nodeDepth[this.bfsTour[this.bfsTour.length - 1]];
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] BlockStatement
solutions-descriptive/7.js:90:43
         this.bfsTour = [root];
 
         for (let v of this.bfsTour) {
-            for (let u of this.adjItr(v)) {
-                if (u !== this.parent[v]) {
-                    this.parent[u] = v;
-                    this.nodeDepth[u] = this.nodeDepth[v] + 1;
-                    this.bfsTour.push(u);
-                }
-            }
+            for (let u of this.adjItr(v)) {}
         }
 
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] EqualityOperator
solutions-descriptive/7.js:91:21
 
         for (let v of this.bfsTour) {
             for (let u of this.adjItr(v)) {
-                if (u !== this.parent[v]) {
+                if (u === this.parent[v]) {
                     this.parent[u] = v;
                     this.nodeDepth[u] = this.nodeDepth[v] + 1;
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] BlockStatement
solutions-descriptive/7.js:91:43
 
         for (let v of this.bfsTour) {
             for (let u of this.adjItr(v)) {
-                if (u !== this.parent[v]) {
-                    this.parent[u] = v;
-                    this.nodeDepth[u] = this.nodeDepth[v] + 1;
-                    this.bfsTour.push(u);
-                }
+                if (u !== this.parent[v]) {}
             }
         }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:93:41
             for (let u of this.adjItr(v)) {
                 if (u !== this.parent[v]) {
                     this.parent[u] = v;
-                    this.nodeDepth[u] = this.nodeDepth[v] + 1;
+                    this.nodeDepth[u] = this.nodeDepth[v] - 1;
                     this.bfsTour.push(u);
                 }
killedBy: n = 2 (root and one child)
statusReason: RangeError: The number NaN cannot be converted to a BigInt because it is not an integer

[Killed] ArithmeticOperator
solutions-descriptive/7.js:99:50
             }
         }
 
-        this.depth = this.nodeDepth[this.bfsTour[this.bfsTour.length - 1]];
+        this.depth = this.nodeDepth[this.bfsTour[this.bfsTour.length + 1]];
     }
 
killedBy: n = 1 (single node)
statusReason: RangeError: Invalid array length

[Survived] BlockStatement
solutions-descriptive/7.js:102:15
         this.depth = this.nodeDepth[this.bfsTour[this.bfsTour.length - 1]];
     }
 
-    isRoot(u) {
-        return u === this.root;
-    }
+    isRoot(u) {}
 
     children(u) {

[Killed] EqualityOperator
solutions-descriptive/7.js:103:16
     }
 
     isRoot(u) {
-        return u === this.root;
+        return u !== this.root;
     }
 
killedBy: n = 3, chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "2"

[Killed] ConditionalExpression
solutions-descriptive/7.js:103:16
     }
 
     isRoot(u) {
-        return u === this.root;
+        return true;
     }
 
killedBy: n = 3, chain tree
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "2"

[Killed] BlockStatement
solutions-descriptive/7.js:106:17
         return u === this.root;
     }
 
-    children(u) {
-        return this.adjItr(u).filter(v => v !== this.parent[u]);
-    }
+    children(u) {}
 }
 //code error
killedBy: n = 1 (single node)
statusReason: TypeError: tree.children is not a function or its return value is not iterable

[Killed] ConditionalExpression
solutions-descriptive/7.js:107:43
     }
 
     children(u) {
-        return this.adjItr(u).filter(v => v !== this.parent[u]);
+        return this.adjItr(u).filter(v => true);
     }
 }
killedBy: n = 2 (root and one child)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "6"
