[Survived] MethodExpression
solutions-descriptive/8.js:2:5
 export function solve(n, m, arrayA, arrayB) {
-    arrayA.sort((x, y) => x - y);
+    arrayA;
     arrayB.sort((x, y) => x - y);
 

[Survived] ArithmeticOperator
solutions-descriptive/8.js:2:27
 export function solve(n, m, arrayA, arrayB) {
-    arrayA.sort((x, y) => x - y);
+    arrayA.sort((x, y) => x + y);
     arrayB.sort((x, y) => x - y);
 

[Survived] ArrowFunction
solutions-descriptive/8.js:3:17
 export function solve(n, m, arrayA, arrayB) {
     arrayA.sort((x, y) => x - y);
-    arrayB.sort((x, y) => x - y);
+    arrayB.sort(() => undefined);
 
     let diffA = [];

[Survived] ArithmeticOperator
solutions-descriptive/8.js:3:27
 export function solve(n, m, arrayA, arrayB) {
     arrayA.sort((x, y) => x - y);
-    arrayB.sort((x, y) => x - y);
+    arrayB.sort((x, y) => x + y);
 
     let diffA = [];

[Killed] ArrayDeclaration
solutions-descriptive/8.js:5:17
     arrayA.sort((x, y) => x - y);
     arrayB.sort((x, y) => x - y);
 
-    let diffA = [];
+    let diffA = ["Stryker was here"];
     let diffB = [];
 
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] ConditionalExpression
solutions-descriptive/8.js:9:21
     let diffB = [];
 
 
-    for (let i = 0; i < Math.floor(n / 2); i++) {
+    for (let i = 0; false; i++) {
         diffA.push(arrayA[n - 1 - i] - arrayA[i]);
     }
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] BlockStatement
solutions-descriptive/8.js:9:49
     let diffB = [];
 
 
-    for (let i = 0; i < Math.floor(n / 2); i++) {
-        diffA.push(arrayA[n - 1 - i] - arrayA[i]);
-    }
+    for (let i = 0; i < Math.floor(n / 2); i++) {}
 
 
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] ArithmeticOperator
solutions-descriptive/8.js:10:27
 
 
     for (let i = 0; i < Math.floor(n / 2); i++) {
-        diffA.push(arrayA[n - 1 - i] - arrayA[i]);
+        diffA.push(arrayA[n + 1 - i] - arrayA[i]);
     }
 
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Survived] ArithmeticOperator
solutions-descriptive/8.js:10:27
 
 
     for (let i = 0; i < Math.floor(n / 2); i++) {
-        diffA.push(arrayA[n - 1 - i] - arrayA[i]);
+        diffA.push(arrayA[n - 1 + i] - arrayA[i]);
     }
 

[Killed] ConditionalExpression
solutions-descriptive/8.js:14:21
     }
 
 
-    for (let i = 0; i < Math.floor(m / 2); i++) {
+    for (let i = 0; false; i++) {
         diffB.push(arrayB[m - 1 - i] - arrayB[i]);
     }
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Killed] BlockStatement
solutions-descriptive/8.js:14:49
     }
 
 
-    for (let i = 0; i < Math.floor(m / 2); i++) {
-        diffB.push(arrayB[m - 1 - i] - arrayB[i]);
-    }
+    for (let i = 0; i < Math.floor(m / 2); i++) {}
 
     const maxTeams = Math.min(Math.floor((n + m) / 3), n, m);
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Killed] ArithmeticOperator
solutions-descriptive/8.js:15:27
 
 
     for (let i = 0; i < Math.floor(m / 2); i++) {
-        diffB.push(arrayB[m - 1 - i] - arrayB[i]);
+        diffB.push(arrayB[m + 1 - i] - arrayB[i]);
     }
 
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Survived] ArithmeticOperator
solutions-descriptive/8.js:15:27
 
 
     for (let i = 0; i < Math.floor(m / 2); i++) {
-        diffB.push(arrayB[m - 1 - i] - arrayB[i]);
+        diffB.push(arrayB[m - 1 + i] - arrayB[i]);
     }
 

[Killed] MethodExpression
solutions-descriptive/8.js:18:22
         diffB.push(arrayB[m - 1 - i] - arrayB[i]);
     }
 
-    const maxTeams = Math.min(Math.floor((n + m) / 3), n, m);
+    const maxTeams = Math.max(Math.floor((n + m) / 3), n, m);
     const resultLines = [maxTeams.toString()];
 
killedBy: minimum input (n=1, m=1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 2

- 0
+ 1
+ NaN

[Killed] ArithmeticOperator
solutions-descriptive/8.js:18:43
         diffB.push(arrayB[m - 1 - i] - arrayB[i]);
     }
 
-    const maxTeams = Math.min(Math.floor((n + m) / 3), n, m);
+    const maxTeams = Math.min(Math.floor((n - m) / 3), n, m);
     const resultLines = [maxTeams.toString()];
 
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- 1
- 3
+ -1

[Killed] EqualityOperator
solutions-descriptive/8.js:26:28
     let indexB = 0;
     let totalDifference = 0;
 
-    for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
+    for (let teamSize = 1; teamSize < maxTeams; teamSize++) {
         if (indexA > n - teamSize) {
             totalDifference += diffB[indexB];
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+

[Killed] ConditionalExpression
solutions-descriptive/8.js:26:28
     let indexB = 0;
     let totalDifference = 0;
 
-    for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
+    for (let teamSize = 1; false; teamSize++) {
         if (indexA > n - teamSize) {
             totalDifference += diffB[indexB];
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+

[Killed] EqualityOperator
solutions-descriptive/8.js:27:13
     let totalDifference = 0;
 
     for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
-        if (indexA > n - teamSize) {
+        if (indexA <= n - teamSize) {
             totalDifference += diffB[indexB];
             indexB++;
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Killed] ConditionalExpression
solutions-descriptive/8.js:27:13
     let totalDifference = 0;
 
     for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
-        if (indexA > n - teamSize) {
+        if (true) {
             totalDifference += diffB[indexB];
             indexB++;
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Survived] AssignmentOperator
solutions-descriptive/8.js:28:13
 
     for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
         if (indexA > n - teamSize) {
-            totalDifference += diffB[indexB];
+            totalDifference -= diffB[indexB];
             indexB++;
             indexA--;

[Survived] UpdateOperator
solutions-descriptive/8.js:29:13
     for (let teamSize = 1; teamSize <= maxTeams; teamSize++) {
         if (indexA > n - teamSize) {
             totalDifference += diffB[indexB];
-            indexB++;
+            indexB--;
             indexA--;
             totalDifference -= diffA[indexA];

[Survived] UpdateOperator
solutions-descriptive/8.js:30:13
         if (indexA > n - teamSize) {
             totalDifference += diffB[indexB];
             indexB++;
-            indexA--;
+            indexA++;
             totalDifference -= diffA[indexA];
         }

[Survived] AssignmentOperator
solutions-descriptive/8.js:31:13
             totalDifference += diffB[indexB];
             indexB++;
             indexA--;
-            totalDifference -= diffA[indexA];
+            totalDifference += diffA[indexA];
         }
 

[Killed] ConditionalExpression
solutions-descriptive/8.js:34:13
             totalDifference -= diffA[indexA];
         }
 
-        if (indexB > m - teamSize) {
+        if (true) {
             totalDifference += diffA[indexA];
             indexA++;
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Killed] EqualityOperator
solutions-descriptive/8.js:34:13
             totalDifference -= diffA[indexA];
         }
 
-        if (indexB > m - teamSize) {
+        if (indexB <= m - teamSize) {
             totalDifference += diffA[indexA];
             indexA++;
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ NaN

[Survived] AssignmentOperator
solutions-descriptive/8.js:35:13
         }
 
         if (indexB > m - teamSize) {
-            totalDifference += diffA[indexA];
+            totalDifference -= diffA[indexA];
             indexA++;
             indexB--;

[Survived] UpdateOperator
solutions-descriptive/8.js:36:13
 
         if (indexB > m - teamSize) {
             totalDifference += diffA[indexA];
-            indexA++;
+            indexA--;
             indexB--;
             totalDifference -= diffB[indexB];

[Survived] UpdateOperator
solutions-descriptive/8.js:37:13
         if (indexB > m - teamSize) {
             totalDifference += diffA[indexA];
             indexA++;
-            indexB--;
+            indexB++;
             totalDifference -= diffB[indexB];
         }

[Survived] AssignmentOperator
solutions-descriptive/8.js:38:13
             totalDifference += diffA[indexA];
             indexA++;
             indexB--;
-            totalDifference -= diffB[indexB];
+            totalDifference += diffB[indexB];
         }
 

[Killed] ConditionalExpression
solutions-descriptive/8.js:41:13
             totalDifference -= diffB[indexB];
         }
 
-        if (indexA === n - teamSize) {
+        if (true) {
             totalDifference += diffB[indexB];
             indexB++;
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] EqualityOperator
solutions-descriptive/8.js:41:13
             totalDifference -= diffB[indexB];
         }
 
-        if (indexA === n - teamSize) {
+        if (indexA !== n - teamSize) {
             totalDifference += diffB[indexB];
             indexB++;
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] AssignmentOperator
solutions-descriptive/8.js:42:13
         }
 
         if (indexA === n - teamSize) {
-            totalDifference += diffB[indexB];
+            totalDifference -= diffB[indexB];
             indexB++;
         } else if (indexB === m - teamSize) {
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 3
+ -3

[Survived] ArithmeticOperator
solutions-descriptive/8.js:44:31
         if (indexA === n - teamSize) {
             totalDifference += diffB[indexB];
             indexB++;
-        } else if (indexB === m - teamSize) {
+        } else if (indexB === m + teamSize) {
             totalDifference += diffA[indexA];
             indexA++;

[Survived] BlockStatement
solutions-descriptive/8.js:44:45
         if (indexA === n - teamSize) {
             totalDifference += diffB[indexB];
             indexB++;
-        } else if (indexB === m - teamSize) {
-            totalDifference += diffA[indexA];
-            indexA++;
-        } else if (diffA[indexA] > diffB[indexB]) {
+        } else if (indexB === m - teamSize) {} else if (diffA[indexA] > diffB[indexB]) {
             totalDifference += diffA[indexA];
             indexA++;

[Survived] AssignmentOperator
solutions-descriptive/8.js:45:13
             totalDifference += diffB[indexB];
             indexB++;
         } else if (indexB === m - teamSize) {
-            totalDifference += diffA[indexA];
+            totalDifference -= diffA[indexA];
             indexA++;
         } else if (diffA[indexA] > diffB[indexB]) {

[Killed] BlockStatement
solutions-descriptive/8.js:47:51
         } else if (indexB === m - teamSize) {
             totalDifference += diffA[indexA];
             indexA++;
-        } else if (diffA[indexA] > diffB[indexB]) {
-            totalDifference += diffA[indexA];
-            indexA++;
-        } else {
+        } else if (diffA[indexA] > diffB[indexB]) {} else {
             totalDifference += diffB[indexB];
             indexB++;
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 0

[Killed] EqualityOperator
solutions-descriptive/8.js:47:20
         } else if (indexB === m - teamSize) {
             totalDifference += diffA[indexA];
             indexA++;
-        } else if (diffA[indexA] > diffB[indexB]) {
+        } else if (diffA[indexA] <= diffB[indexB]) {
             totalDifference += diffA[indexA];
             indexA++;
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ 3

[Killed] AssignmentOperator
solutions-descriptive/8.js:48:13
             totalDifference += diffA[indexA];
             indexA++;
         } else if (diffA[indexA] > diffB[indexB]) {
-            totalDifference += diffA[indexA];
+            totalDifference -= diffA[indexA];
             indexA++;
         } else {
killedBy: n=2, m=2: smallest nontrivial, expect 1 operation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 5
+ -5

[Killed] BlockStatement
solutions-descriptive/8.js:50:16
         } else if (diffA[indexA] > diffB[indexB]) {
             totalDifference += diffA[indexA];
             indexA++;
-        } else {
-            totalDifference += diffB[indexB];
-            indexB++;
-        }
+        } else {}
 
         maxDiffs.push(totalDifference);
killedBy: large values in A and B
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 2000000000
+ 0

[Killed] AssignmentOperator
solutions-descriptive/8.js:51:13
             totalDifference += diffA[indexA];
             indexA++;
         } else {
-            totalDifference += diffB[indexB];
+            totalDifference -= diffB[indexB];
             indexB++;
         }
killedBy: large values in A and B
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

  1
- 2000000000
+ -2000000000

[Killed] BlockStatement
solutions-descriptive/8.js:58:23
         maxDiffs.push(totalDifference);
     }
 
-    if (maxTeams > 0) {
-        resultLines.push(maxDiffs.join(' '));
-    }
+    if (maxTeams > 0) {}
 
     return resultLines.join('\n');
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 0

  1
- 3

[Killed] EqualityOperator
solutions-descriptive/8.js:58:9
         maxDiffs.push(totalDifference);
     }
 
-    if (maxTeams > 0) {
+    if (maxTeams >= 0) {
         resultLines.push(maxDiffs.join(' '));
     }
killedBy: minimum input (n=1, m=1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 1

  0
+

[Killed] StringLiteral
solutions-descriptive/8.js:62:29
         resultLines.push(maxDiffs.join(' '));
     }
 
-    return resultLines.join('\n');
+    return resultLines.join("");
 }
 
killedBy: n=1, m=2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 2
+ Received  + 1

- 1
- 3
+ 13
