[Killed] ArithmeticOperator
solutions-descriptive/1.js:3:31
 function solve(x, y, maxFactorRatio) {
     const commonGCD = gcd(x, y); 
-    const stepsToX = minSteps(x / commonGCD);
+    const stepsToX = minSteps(x * commonGCD);
     const stepsToY = minSteps(y / commonGCD);
     const totalSteps = stepsToX + stepsToY;
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ArithmeticOperator
solutions-descriptive/1.js:4:31
 function solve(x, y, maxFactorRatio) {
     const commonGCD = gcd(x, y); 
     const stepsToX = minSteps(x / commonGCD);
-    const stepsToY = minSteps(y / commonGCD);
+    const stepsToY = minSteps(y * commonGCD);
     const totalSteps = stepsToX + stepsToY;
     return totalSteps === Infinity ? -1 : totalSteps;
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ArithmeticOperator
solutions-descriptive/1.js:5:24
     const commonGCD = gcd(x, y); 
     const stepsToX = minSteps(x / commonGCD);
     const stepsToY = minSteps(y / commonGCD);
-    const totalSteps = stepsToX + stepsToY;
+    const totalSteps = stepsToX - stepsToY;
     return totalSteps === Infinity ? -1 : totalSteps;
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] ConditionalExpression
solutions-descriptive/1.js:6:12
     const stepsToX = minSteps(x / commonGCD);
     const stepsToY = minSteps(y / commonGCD);
     const totalSteps = stepsToX + stepsToY;
-    return totalSteps === Infinity ? -1 : totalSteps;
+    return false ? -1 : totalSteps;
 
     function minSteps(target) {
killedBy: Prompt 1 - Problem 1 case 3: impossible case (2 → 81 with k = 2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: Infinity

[Killed] UnaryOperator
solutions-descriptive/1.js:6:38
     const stepsToX = minSteps(x / commonGCD);
     const stepsToY = minSteps(y / commonGCD);
     const totalSteps = stepsToX + stepsToY;
-    return totalSteps === Infinity ? -1 : totalSteps;
+    return totalSteps === Infinity ? +1 : totalSteps;
 
     function minSteps(target) {
killedBy: Prompt 1 - Problem 1 case 3: impossible case (2 → 81 with k = 2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: -1
Received: 1

[Survived] ArrayDeclaration
solutions-descriptive/1.js:9:29
     return totalSteps === Infinity ? -1 : totalSteps;
 
     function minSteps(target) {
-        const allDivisors = [];
+        const allDivisors = ["Stryker was here"];
         
         

[Killed] ConditionalExpression
solutions-descriptive/1.js:12:25
         const allDivisors = [];
         
         
-        for (let i = 1; i * i <= target; i++) {
+        for (let i = 1; false; i++) {
             if (target % i === 0) {
                 allDivisors.push(i);
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/1.js:12:25
         const allDivisors = [];
         
         
-        for (let i = 1; i * i <= target; i++) {
+        for (let i = 1; i * i > target; i++) {
             if (target % i === 0) {
                 allDivisors.push(i);
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] EqualityOperator
solutions-descriptive/1.js:13:17
         
         
         for (let i = 1; i * i <= target; i++) {
-            if (target % i === 0) {
+            if (target % i !== 0) {
                 allDivisors.push(i);
                 if (i !== target / i) {
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] BlockStatement
solutions-descriptive/1.js:13:35
         
         
         for (let i = 1; i * i <= target; i++) {
-            if (target % i === 0) {
-                allDivisors.push(i);
-                if (i !== target / i) {
-                    allDivisors.push(target / i);
-                }
-            }
+            if (target % i === 0) {}
         }
         allDivisors.sort((a, b) => a - b); 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/1.js:15:21
         for (let i = 1; i * i <= target; i++) {
             if (target % i === 0) {
                 allDivisors.push(i);
-                if (i !== target / i) {
+                if (false) {
                     allDivisors.push(target / i);
                 }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
solutions-descriptive/1.js:15:39
         for (let i = 1; i * i <= target; i++) {
             if (target % i === 0) {
                 allDivisors.push(i);
-                if (i !== target / i) {
-                    allDivisors.push(target / i);
-                }
+                if (i !== target / i) {}
             }
         }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
solutions-descriptive/1.js:16:38
             if (target % i === 0) {
                 allDivisors.push(i);
                 if (i !== target / i) {
-                    allDivisors.push(target / i);
+                    allDivisors.push(target * i);
                 }
             }
killedBy: Prompt 1 - Problem 1 case 2: 5 → 100 with k = 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] MethodExpression
solutions-descriptive/1.js:20:9
                 }
             }
         }
-        allDivisors.sort((a, b) => a - b); 
+        allDivisors; 
 
         const minOperations = Array(allDivisors.length).fill(Infinity);
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArrowFunction
solutions-descriptive/1.js:20:26
                 }
             }
         }
-        allDivisors.sort((a, b) => a - b); 
+        allDivisors.sort(() => undefined); 
 
         const minOperations = Array(allDivisors.length).fill(Infinity);
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
solutions-descriptive/1.js:24:25
 
         const minOperations = Array(allDivisors.length).fill(Infinity);
 
-        for (let i = 0; i < allDivisors.length; i++) {
+        for (let i = 0; i >= allDivisors.length; i++) {
             let bestPrevStep = Infinity;
             
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
solutions-descriptive/1.js:24:25
 
         const minOperations = Array(allDivisors.length).fill(Infinity);
 
-        for (let i = 0; i < allDivisors.length; i++) {
+        for (let i = 0; false; i++) {
             let bestPrevStep = Infinity;
             
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
solutions-descriptive/1.js:27:29
         for (let i = 0; i < allDivisors.length; i++) {
             let bestPrevStep = Infinity;
             
-            for (let j = 0; j < i; j++) {
+            for (let j = 0; false; j++) {
                 const larger = allDivisors[i];
                 const smaller = allDivisors[j];
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
solutions-descriptive/1.js:27:41
         for (let i = 0; i < allDivisors.length; i++) {
             let bestPrevStep = Infinity;
             
-            for (let j = 0; j < i; j++) {
-                const larger = allDivisors[i];
-                const smaller = allDivisors[j];
-
-                if (larger % smaller === 0 && (larger / smaller) <= maxFactorRatio) {
-                    bestPrevStep = Math.min(bestPrevStep, minOperations[j]);
-                }
-            }
+            for (let j = 0; j < i; j++) {}
 
             
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
solutions-descriptive/1.js:31:47
                 const larger = allDivisors[i];
                 const smaller = allDivisors[j];
 
-                if (larger % smaller === 0 && (larger / smaller) <= maxFactorRatio) {
+                if (larger % smaller === 0 && true) {
                     bestPrevStep = Math.min(bestPrevStep, minOperations[j]);
                 }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-descriptive/1.js:31:21
                 const larger = allDivisors[i];
                 const smaller = allDivisors[j];
 
-                if (larger % smaller === 0 && (larger / smaller) <= maxFactorRatio) {
+                if (true) {
                     bestPrevStep = Math.min(bestPrevStep, minOperations[j]);
                 }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] MethodExpression
solutions-descriptive/1.js:32:36
                 const smaller = allDivisors[j];
 
                 if (larger % smaller === 0 && (larger / smaller) <= maxFactorRatio) {
-                    bestPrevStep = Math.min(bestPrevStep, minOperations[j]);
+                    bestPrevStep = Math.max(bestPrevStep, minOperations[j]);
                 }
             }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] BlockStatement
solutions-descriptive/1.js:37:51
             }
 
             
-            if (allDivisors[i] <= maxFactorRatio) {
-                minOperations[i] = allDivisors[i] === 1 ? 0 : 1;
-            }
+            if (allDivisors[i] <= maxFactorRatio) {}
 
             
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ConditionalExpression
solutions-descriptive/1.js:37:17
             }
 
             
-            if (allDivisors[i] <= maxFactorRatio) {
+            if (true) {
                 minOperations[i] = allDivisors[i] === 1 ? 0 : 1;
             }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-descriptive/1.js:38:36
 
             
             if (allDivisors[i] <= maxFactorRatio) {
-                minOperations[i] = allDivisors[i] === 1 ? 0 : 1;
+                minOperations[i] = true ? 0 : 1;
             }
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
solutions-descriptive/1.js:38:36
 
             
             if (allDivisors[i] <= maxFactorRatio) {
-                minOperations[i] = allDivisors[i] === 1 ? 0 : 1;
+                minOperations[i] = false ? 0 : 1;
             }
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] MethodExpression
solutions-descriptive/1.js:42:32
             }
 
             
-            minOperations[i] = Math.min(minOperations[i], bestPrevStep + 1);
+            minOperations[i] = Math.max(minOperations[i], bestPrevStep + 1);
         }
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -1

[Killed] ArithmeticOperator
solutions-descriptive/1.js:42:59
             }
 
             
-            minOperations[i] = Math.min(minOperations[i], bestPrevStep + 1);
+            minOperations[i] = Math.min(minOperations[i], bestPrevStep - 1);
         }
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: -2

[Killed] ArithmeticOperator
solutions-descriptive/1.js:45:30
             minOperations[i] = Math.min(minOperations[i], bestPrevStep + 1);
         }
 
-        return minOperations[allDivisors.length - 1];
+        return minOperations[allDivisors.length + 1];
     }
 }
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] BlockStatement
solutions-descriptive/1.js:50:20
 }
 
 
-function gcd(a, b) {
-    while (a) {
-        const remainder = b % a;
-        b = a;
-        a = remainder;
-    }
-    return b;
-}
+function gcd(a, b) {}
 
 
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Killed] ConditionalExpression
solutions-descriptive/1.js:51:12
 
 
 function gcd(a, b) {
-    while (a) {
+    while (false) {
         const remainder = b % a;
         b = a;
killedBy: Prompt 1 - Problem 1 case 1: 2 → 8 with k = 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: NaN

[Timeout] BlockStatement
solutions-descriptive/1.js:51:15
 
 
 function gcd(a, b) {
-    while (a) {
-        const remainder = b % a;
-        b = a;
-        a = remainder;
-    }
+    while (a) {}
     return b;
 }

[Timeout] ArithmeticOperator
solutions-descriptive/1.js:52:27
 
 function gcd(a, b) {
     while (a) {
-        const remainder = b % a;
+        const remainder = b * a;
         b = a;
         a = remainder;

[Survived] BlockStatement
solutions-descriptive/1.js:60:17
 }
 
 
-function test() {
-    const testCases = [
-        { x: 4, y: 6, k: 3, expected: 2 },
-        { x: 4, y: 5, k: 3, expected: -1 },
-        { x: 4, y: 6, k: 2, expected: -1 },
-        { x: 10, y: 45, k: 3, expected: 3 },
-        { x: 780, y: 23, k: 42, expected: 3 },
-        { x: 11, y: 270, k: 23, expected: 3 },
-        { x: 1, y: 982800, k:13, expected: 6 },
-        { x: 1, y: 6, k: 2, expected: -1 }
-    ];
-
-    for (const { x, y, k, expected } of testCases) {
-        const result = solve(x, y, k);
-        console.log(`x=${x}, y=${y}, k=${k}:`);
-        console.log(`  Expected: ${expected}, Got: ${result}`);
-        console.log(`  ${result === expected ? "PASS" : "FAIL"}`);
-    }
-}
+function test() {}
 
 test();

[Survived] UnaryOperator
solutions-descriptive/1.js:63:39
 function test() {
     const testCases = [
         { x: 4, y: 6, k: 3, expected: 2 },
-        { x: 4, y: 5, k: 3, expected: -1 },
+        { x: 4, y: 5, k: 3, expected: +1 },
         { x: 4, y: 6, k: 2, expected: -1 },
         { x: 10, y: 45, k: 3, expected: 3 },

[Survived] UnaryOperator
solutions-descriptive/1.js:64:39
     const testCases = [
         { x: 4, y: 6, k: 3, expected: 2 },
         { x: 4, y: 5, k: 3, expected: -1 },
-        { x: 4, y: 6, k: 2, expected: -1 },
+        { x: 4, y: 6, k: 2, expected: +1 },
         { x: 10, y: 45, k: 3, expected: 3 },
         { x: 780, y: 23, k: 42, expected: 3 },

[Survived] ObjectLiteral
solutions-descriptive/1.js:64:9
     const testCases = [
         { x: 4, y: 6, k: 3, expected: 2 },
         { x: 4, y: 5, k: 3, expected: -1 },
-        { x: 4, y: 6, k: 2, expected: -1 },
+        {},
         { x: 10, y: 45, k: 3, expected: 3 },
         { x: 780, y: 23, k: 42, expected: 3 },

[Survived] ObjectLiteral
solutions-descriptive/1.js:65:9
         { x: 4, y: 6, k: 3, expected: 2 },
         { x: 4, y: 5, k: 3, expected: -1 },
         { x: 4, y: 6, k: 2, expected: -1 },
-        { x: 10, y: 45, k: 3, expected: 3 },
+        {},
         { x: 780, y: 23, k: 42, expected: 3 },
         { x: 11, y: 270, k: 23, expected: 3 },

[Survived] UnaryOperator
solutions-descriptive/1.js:69:39
         { x: 780, y: 23, k: 42, expected: 3 },
         { x: 11, y: 270, k: 23, expected: 3 },
         { x: 1, y: 982800, k:13, expected: 6 },
-        { x: 1, y: 6, k: 2, expected: -1 }
+        { x: 1, y: 6, k: 2, expected: +1 }
     ];
 

[Survived] BlockStatement
solutions-descriptive/1.js:72:52
         { x: 1, y: 6, k: 2, expected: -1 }
     ];
 
-    for (const { x, y, k, expected } of testCases) {
-        const result = solve(x, y, k);
-        console.log(`x=${x}, y=${y}, k=${k}:`);
-        console.log(`  Expected: ${expected}, Got: ${result}`);
-        console.log(`  ${result === expected ? "PASS" : "FAIL"}`);
-    }
+    for (const { x, y, k, expected } of testCases) {}
 }
 

[Survived] ConditionalExpression
solutions-descriptive/1.js:76:26
         const result = solve(x, y, k);
         console.log(`x=${x}, y=${y}, k=${k}:`);
         console.log(`  Expected: ${expected}, Got: ${result}`);
-        console.log(`  ${result === expected ? "PASS" : "FAIL"}`);
+        console.log(`  ${false ? "PASS" : "FAIL"}`);
     }
 }

[Survived] EqualityOperator
solutions-descriptive/1.js:76:26
         const result = solve(x, y, k);
         console.log(`x=${x}, y=${y}, k=${k}:`);
         console.log(`  Expected: ${expected}, Got: ${result}`);
-        console.log(`  ${result === expected ? "PASS" : "FAIL"}`);
+        console.log(`  ${result !== expected ? "PASS" : "FAIL"}`);
     }
 }
